; ModuleID = 'core_2d_camera'
source_filename = "core_2d_camera"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%Rectangle = type { float, float, float, float }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Color = type { i8, i8, i8, i8 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Camera2D = type { %Vector2, %Vector2, float, float }
%Vector2 = type { float, float }

@core_2d_camera.MAX_BUILDINGS = local_unnamed_addr constant i32 100, align 4, !dbg !0
@.str = private unnamed_addr constant [34 x i8] c"raylib [core] example - 2d camera\00", align 1
@.__const = private unnamed_addr constant %Rectangle { float 4.000000e+02, float 2.800000e+02, float 4.000000e+01, float 4.000000e+01 }, align 4
@"$ct.long" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8
@.panic_msg = internal constant [39 x i8] c"Negative array indexing (index was %d)\00", align 1
@.file = internal constant [18 x i8] c"core_2d_camera.c3\00", align 1
@.func = internal constant [5 x i8] c"main\00", align 1
@.panic_msg.1 = internal constant [60 x i8] c"Array index out of bounds (array had size %d, index was %d)\00", align 1
@raylib5.rl.RAYWHITE = external constant %Color, align 1
@raylib5.rl.DARKGRAY = external constant %Color, align 1
@raylib5.rl.RED = external constant %Color, align 1
@raylib5.rl.GREEN = external constant %Color, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_BUILDINGS", linkageName: "core_2d_camera.MAX_BUILDINGS", scope: !2, file: !2, line: 9, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "core_2d_camera.c3", directory: "/Users/tekin/Documents/Development/c3/rl_examples/src/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !{i32 2, !"Dwarf Version", i32 4}
!5 = !{i32 2, !"Debug Info Version", i32 3}
!6 = !{i32 2, !"wchar_size", i32 4}
!7 = !{i32 4, !"PIC Level", i32 2}
!8 = !{i32 1, !"uwtable", i32 1}
!9 = !{i32 2, !"frame-pointer", i32 1}
!10 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !11, splitDebugInlining: false)
!11 = !{!0}
!12 = distinct !DISubprogram(name: "main", linkageName: "main", scope: !2, file: !2, line: 11, type: !13, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !15)
!13 = !DISubroutineType(types: !14)
!14 = !{!3}
!15 = !{}
!16 = !DILocalVariable(name: "screenWidth", scope: !12, file: !2, line: 14, type: !3, align: 4)
!17 = !DILocation(line: 14, column: 9, scope: !12)
!18 = !DILocation(line: 14, column: 23, scope: !12)
!19 = !DILocalVariable(name: "screenHeight", scope: !12, file: !2, line: 15, type: !3, align: 4)
!20 = !DILocation(line: 15, column: 9, scope: !12)
!21 = !DILocation(line: 15, column: 24, scope: !12)
!22 = !DILocation(line: 17, column: 47, scope: !12)
!23 = !DILocation(line: 17, column: 5, scope: !12)
!24 = !DILocalVariable(name: "player", scope: !12, file: !2, line: 19, type: !25, align: 4)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", scope: !2, file: !2, line: 83, size: 128, align: 32, elements: !26, identifier: "raylib5.rl.Rectangle")
!26 = !{!27, !29, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !2, line: 85, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !2, line: 86, baseType: !28, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !25, file: !2, line: 87, baseType: !28, size: 32, align: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !25, file: !2, line: 88, baseType: !28, size: 32, align: 32, offset: 96)
!32 = !DILocation(line: 19, column: 15, scope: !12)
!33 = !DILocalVariable(name: "buildings", scope: !12, file: !2, line: 20, type: !34, align: 4)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 12800, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 100, lowerBound: 0)
!37 = !DILocation(line: 20, column: 30, scope: !12)
!38 = !DILocalVariable(name: "buildColors", scope: !12, file: !2, line: 21, type: !39, align: 1)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3200, align: 8, elements: !35)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "Color", scope: !2, file: !2, line: 74, size: 32, align: 8, elements: !41, identifier: "raylib5.rl.Color")
!41 = !{!42, !44, !45, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !40, file: !2, line: 76, baseType: !43, size: 8, align: 8)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !40, file: !2, line: 77, baseType: !43, size: 8, align: 8, offset: 8)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !40, file: !2, line: 78, baseType: !43, size: 8, align: 8, offset: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !40, file: !2, line: 79, baseType: !43, size: 8, align: 8, offset: 24)
!47 = !DILocation(line: 21, column: 26, scope: !12)
!48 = !DILocalVariable(name: "spacing", scope: !12, file: !2, line: 23, type: !3, align: 4)
!49 = !DILocation(line: 23, column: 9, scope: !12)
!50 = !DILocation(line: 23, column: 19, scope: !12)
!51 = !DILocalVariable(name: "i", scope: !52, file: !2, line: 25, type: !3, align: 4)
!52 = distinct !DILexicalBlock(scope: !12, file: !2, line: 25, column: 5)
!53 = !DILocation(line: 25, column: 14, scope: !52)
!54 = !DILocation(line: 25, column: 18, scope: !52)
!55 = !DILocation(line: 25, column: 21, scope: !52)
!56 = !DILocation(line: 27, column: 19, scope: !57)
!57 = distinct !DILexicalBlock(scope: !52, file: !2, line: 26, column: 5)
!58 = !DILocation(line: 27, column: 31, scope: !57)
!59 = !DILocation(line: 28, column: 19, scope: !57)
!60 = !DILocation(line: 28, column: 32, scope: !57)
!61 = !DILocation(line: 29, column: 19, scope: !57)
!62 = !DILocation(line: 29, column: 26, scope: !57)
!63 = !DILocation(line: 29, column: 60, scope: !57)
!64 = !DILocation(line: 30, column: 19, scope: !57)
!65 = !DILocation(line: 30, column: 37, scope: !57)
!66 = !DILocation(line: 30, column: 26, scope: !57)
!67 = !DILocation(line: 32, column: 9, scope: !57)
!68 = !DILocation(line: 32, column: 35, scope: !57)
!69 = !DILocation(line: 34, column: 21, scope: !57)
!70 = !DILocation(line: 34, column: 26, scope: !57)
!71 = !DILocation(line: 25, column: 40, scope: !52)
!72 = !DILocalVariable(name: "camera", scope: !12, file: !2, line: 42, type: !73, align: 4)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Camera2D", scope: !2, file: !2, line: 173, size: 192, align: 32, elements: !74, identifier: "raylib5.rl.Camera2D")
!74 = !{!75, !80, !81, !82}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !73, file: !2, line: 175, baseType: !76, size: 64, align: 32)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vector2", scope: !73, file: !2, line: 38, size: 64, align: 32, elements: !77, identifier: "raylib5.rl.Vector2")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !76, file: !2, line: 40, baseType: !28, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !76, file: !2, line: 41, baseType: !28, size: 32, align: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !73, file: !2, line: 176, baseType: !76, size: 64, align: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !73, file: !2, line: 177, baseType: !28, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !73, file: !2, line: 178, baseType: !28, size: 32, align: 32, offset: 160)
!83 = !DILocation(line: 42, column: 14, scope: !12)
!84 = !DILocation(line: 43, column: 5, scope: !12)
!85 = !DILocation(line: 43, column: 31, scope: !12)
!86 = !DILocation(line: 43, column: 21, scope: !12)
!87 = !DILocation(line: 43, column: 49, scope: !12)
!88 = !DILocation(line: 44, column: 31, scope: !12)
!89 = !DILocation(line: 44, column: 21, scope: !12)
!90 = !DILocation(line: 44, column: 49, scope: !12)
!91 = !DILocation(line: 45, column: 5, scope: !12)
!92 = !DILocation(line: 45, column: 23, scope: !12)
!93 = !DILocation(line: 46, column: 5, scope: !12)
!94 = !DILocation(line: 46, column: 19, scope: !12)
!95 = !DILocation(line: 48, column: 5, scope: !12)
!96 = !DILocation(line: 50, column: 5, scope: !12)
!97 = !DILocation(line: 50, column: 13, scope: !98)
!98 = distinct !DILexicalBlock(scope: !12, file: !2, line: 50, column: 5)
!99 = !DILocation(line: 53, column: 13, scope: !100)
!100 = distinct !DILexicalBlock(scope: !98, file: !2, line: 51, column: 5)
!101 = !DILocation(line: 53, column: 45, scope: !102)
!102 = distinct !DILexicalBlock(scope: !100, file: !2, line: 53, column: 43)
!103 = !DILocation(line: 54, column: 18, scope: !100)
!104 = !DILocation(line: 54, column: 49, scope: !105)
!105 = distinct !DILexicalBlock(scope: !100, file: !2, line: 54, column: 47)
!106 = !DILocation(line: 57, column: 9, scope: !100)
!107 = !DILocation(line: 57, column: 35, scope: !100)
!108 = !DILocation(line: 57, column: 25, scope: !100)
!109 = !DILocation(line: 57, column: 50, scope: !100)
!110 = !DILocation(line: 60, column: 13, scope: !100)
!111 = !DILocation(line: 60, column: 41, scope: !112)
!112 = distinct !DILexicalBlock(scope: !100, file: !2, line: 60, column: 39)
!113 = !DILocation(line: 61, column: 18, scope: !100)
!114 = !DILocation(line: 61, column: 46, scope: !115)
!115 = distinct !DILexicalBlock(scope: !100, file: !2, line: 61, column: 44)
!116 = !DILocation(line: 64, column: 13, scope: !100)
!117 = !DILocation(line: 64, column: 36, scope: !118)
!118 = distinct !DILexicalBlock(scope: !100, file: !2, line: 64, column: 35)
!119 = !DILocation(line: 64, column: 54, scope: !118)
!120 = !DILocation(line: 65, column: 18, scope: !100)
!121 = !DILocation(line: 65, column: 42, scope: !122)
!122 = distinct !DILexicalBlock(scope: !100, file: !2, line: 65, column: 41)
!123 = !DILocation(line: 65, column: 60, scope: !122)
!124 = !DILocation(line: 68, column: 9, scope: !100)
!125 = !DILocation(line: 68, column: 26, scope: !100)
!126 = !DILocation(line: 70, column: 13, scope: !100)
!127 = !DILocation(line: 70, column: 34, scope: !128)
!128 = distinct !DILexicalBlock(scope: !100, file: !2, line: 70, column: 33)
!129 = !DILocation(line: 70, column: 48, scope: !128)
!130 = !DILocation(line: 71, column: 18, scope: !100)
!131 = !DILocation(line: 71, column: 39, scope: !132)
!132 = distinct !DILexicalBlock(scope: !100, file: !2, line: 71, column: 38)
!133 = !DILocation(line: 71, column: 53, scope: !132)
!134 = !DILocation(line: 74, column: 13, scope: !100)
!135 = !DILocation(line: 76, column: 13, scope: !136)
!136 = distinct !DILexicalBlock(scope: !100, file: !2, line: 75, column: 9)
!137 = !DILocation(line: 76, column: 27, scope: !136)
!138 = !DILocation(line: 77, column: 13, scope: !136)
!139 = !DILocation(line: 77, column: 31, scope: !136)
!140 = !DILocation(line: 80, column: 9, scope: !100)
!141 = !DILocation(line: 81, column: 13, scope: !100)
!142 = !DILocation(line: 82, column: 13, scope: !100)
!143 = !DILocation(line: 84, column: 17, scope: !100)
!144 = !DILocalVariable(name: "i", scope: !145, file: !2, line: 86, type: !3, align: 4)
!145 = distinct !DILexicalBlock(scope: !100, file: !2, line: 86, column: 17)
!146 = !DILocation(line: 86, column: 26, scope: !145)
!147 = !DILocation(line: 86, column: 30, scope: !145)
!148 = !DILocation(line: 86, column: 33, scope: !145)
!149 = !DILocation(line: 86, column: 89, scope: !150)
