; ModuleID = 'raygui::rg::style::dark'
source_filename = "raygui::rg::style::dark"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%GuiStyleProp = type { i16, i32, i32 }
%Rectangle = type { float, float, float, float }
%GlyphInfo = type { i32, i32, i32, i32, %Image }
%Image = type { ptr, i32, i32, i32, i32 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Font = type { i32, i32, i32, %Texture, ptr, ptr }
%Texture = type { i32, i32, i32, i32, i32 }
%"Rectangle[]" = type { ptr, i64 }
%"GlyphInfo[]" = type { ptr, i64 }

@raygui.rg.style.dark.DARK_STYLE_PROPS_COUNT = local_unnamed_addr constant i32 23, align 4, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DARK_STYLE_PROPS_COUNT", linkageName: "raygui.rg.style.dark.DARK_STYLE_PROPS_COUNT", scope: !2, file: !2, line: 20, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "dark.c3", directory: "/Users/tekin/Documents/Development/c3/vendor/libraries/raygui.c3l")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DARK_SIZE_PROPS", linkageName: "raygui.rg.style.dark.DARK_SIZE_PROPS", scope: !2, file: !2, line: 23, type: !6, isLocal: false, isDefinition: true, align: 4)
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2208, align: 32, elements: !33)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "GuiStyleProp", scope: !2, file: !2, line: 14, size: 96, align: 32, elements: !8, identifier: "raygui.rg.GuiStyleProp")
!8 = !{!9, !29, !31}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "controlId", scope: !7, file: !2, line: 15, baseType: !10, size: 16, align: 16)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GuiControl", scope: !7, file: !2, line: 65, baseType: !11, size: 16, align: 16, elements: !12)
!11 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!13 = !DIEnumerator(name: "DEFAULT", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "LABEL", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "BUTTON", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "TOGGLE", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "SLIDER", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "PROGRESSBAR", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "CHECKBOX", value: 6, isUnsigned: true)
!20 = !DIEnumerator(name: "COMBOBOX", value: 7, isUnsigned: true)
!21 = !DIEnumerator(name: "DROPDOWNBOX", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "TEXTBOX", value: 9, isUnsigned: true)
!23 = !DIEnumerator(name: "VALUEBOX", value: 10, isUnsigned: true)
!24 = !DIEnumerator(name: "SPINNER", value: 11, isUnsigned: true)
!25 = !DIEnumerator(name: "LISTVIEW", value: 12, isUnsigned: true)
!26 = !DIEnumerator(name: "COLORPICKER", value: 13, isUnsigned: true)
!27 = !DIEnumerator(name: "SCROLLBAR", value: 14, isUnsigned: true)
!28 = !DIEnumerator(name: "STATUSBAR", value: 15, isUnsigned: true)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "propertyId", scope: !7, file: !2, line: 16, baseType: !30, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuiControlProperty", scope: !2, file: !2, line: 457, baseType: !3, align: 4)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "propertyValue", scope: !7, file: !2, line: 17, baseType: !32, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !3, align: 4)
!33 = !{!34}
!34 = !DISubrange(count: 23, lowerBound: 0)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "DARK_STYLE_FONT_ATLAS_COMP_SIZE", linkageName: "raygui.rg.style.dark.DARK_STYLE_FONT_ATLAS_COMP_SIZE", scope: !2, file: !2, line: 51, type: !3, isLocal: false, isDefinition: true, align: 4)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "DARK_FONT_DATA", linkageName: "raygui.rg.style.dark.DARK_FONT_DATA", scope: !2, file: !2, line: 54, type: !39, isLocal: false, isDefinition: true, align: 1)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 17008, align: 8, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !{!42}
!42 = !DISubrange(count: 2126, lowerBound: 0)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "DARK_FONT_RECS", linkageName: "raygui.rg.style.dark.DARK_FONT_RECS", scope: !2, file: !2, line: 164, type: !45, isLocal: false, isDefinition: true, align: 4)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24192, align: 32, elements: !53)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rectangle", scope: !2, file: !2, line: 83, size: 128, align: 32, elements: !47, identifier: "raylib5.rl.Rectangle")
!47 = !{!48, !50, !51, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !2, line: 85, baseType: !49, size: 32, align: 32)
!49 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !2, line: 86, baseType: !49, size: 32, align: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !46, file: !2, line: 87, baseType: !49, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !46, file: !2, line: 88, baseType: !49, size: 32, align: 32, offset: 96)
!53 = !{!54}
!54 = !DISubrange(count: 189, lowerBound: 0)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "DARK_FONT_GLYPHS", linkageName: "raygui.rg.style.dark.DARK_FONT_GLYPHS", scope: !2, file: !2, line: 358, type: !57, isLocal: false, isDefinition: true, align: 8)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 60480, align: 64, elements: !53)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphInfo", scope: !2, file: !2, line: 140, size: 320, align: 64, elements: !59, identifier: "raylib5.rl.GlyphInfo")
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !58, file: !2, line: 142, baseType: !3, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "offsetX", scope: !58, file: !2, line: 143, baseType: !3, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "offsetY", scope: !58, file: !2, line: 144, baseType: !3, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "advanceX", scope: !58, file: !2, line: 145, baseType: !3, size: 32, align: 32, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !58, file: !2, line: 146, baseType: !65, size: 192, align: 64, offset: 128)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", scope: !58, file: !2, line: 92, size: 192, align: 64, elements: !66, identifier: "raylib5.rl.Image")
!66 = !{!67, !69, !70, !71, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !2, line: 94, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !65, file: !2, line: 95, baseType: !3, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !65, file: !2, line: 96, baseType: !3, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !65, file: !2, line: 97, baseType: !3, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !65, file: !2, line: 98, baseType: !73, size: 32, align: 32, offset: 160)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PixelFormat", scope: !65, file: !2, line: 565, baseType: !3, size: 32, align: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!75 = !DIEnumerator(name: "NONE", value: 0)
!76 = !DIEnumerator(name: "UNCOMPRESSED_GRAYSCALE", value: 1)
!77 = !DIEnumerator(name: "UNCOMPRESSED_GRAY_ALPHA", value: 2)
!78 = !DIEnumerator(name: "UNCOMPRESSED_R5G6B5", value: 3)
!79 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8", value: 4)
!80 = !DIEnumerator(name: "UNCOMPRESSED_R5G5B5A1", value: 5)
!81 = !DIEnumerator(name: "UNCOMPRESSED_R4G4B4A4", value: 6)
!82 = !DIEnumerator(name: "UNCOMPRESSED_R8G8B8A8", value: 7)
!83 = !DIEnumerator(name: "UNCOMPRESSED_R32", value: 8)
!84 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32", value: 9)
!85 = !DIEnumerator(name: "UNCOMPRESSED_R32G32B32A32", value: 10)
!86 = !DIEnumerator(name: "COMPRESSED_DXT1_RGB", value: 11)
!87 = !DIEnumerator(name: "COMPRESSED_DXT1_RGBA", value: 12)
!88 = !DIEnumerator(name: "COMPRESSED_DXT3_RGBA", value: 13)
!89 = !DIEnumerator(name: "COMPRESSED_DXT5_RGBA", value: 14)
!90 = !DIEnumerator(name: "COMPRESSED_ETC1_RGB", value: 15)
!91 = !DIEnumerator(name: "COMPRESSED_ETC2_RGB", value: 16)
!92 = !DIEnumerator(name: "COMPRESSED_ETC2_EAC_RGBA", value: 17)
!93 = !DIEnumerator(name: "COMPRESSED_PVRT_RGB", value: 18)
!94 = !DIEnumerator(name: "COMPRESSED_PVRT_RGBA", value: 19)
!95 = !DIEnumerator(name: "COMPRESSED_ASTC_4X4_RGBA", value: 20)
!96 = !DIEnumerator(name: "COMPRESSED_ASTC_8X8_RGBA", value: 21)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{i32 2, !"wchar_size", i32 4}
!100 = !{i32 4, !"PIC Level", i32 2}
!101 = !{i32 1, !"uwtable", i32 1}
!102 = !{i32 2, !"frame-pointer", i32 1}
!103 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, globals: !105, splitDebugInlining: false)
!104 = !{!10, !73}
!105 = !{!0, !4, !35, !37, !43, !55}
!106 = distinct !DISubprogram(name: "load", linkageName: "raygui.rg.style.dark.load", scope: !2, file: !2, line: 551, type: !107, scopeLine: 551, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !103, retainedNodes: !109)
!107 = !DISubroutineType(types: !108)
!108 = !{null}
!109 = !{}
!110 = !DILocation(line: 555, column: 14, scope: !111)
!111 = distinct !DILexicalBlock(scope: !106, file: !2, line: 555, column: 5)
!112 = !DILocalVariable(name: "i", scope: !111, file: !2, line: 555, type: !3, align: 4)
!113 = !DILocation(line: 555, column: 18, scope: !111)
!114 = !DILocation(line: 555, column: 21, scope: !111)
!115 = !DILocation(line: 557, column: 41, scope: !116)
!116 = distinct !DILexicalBlock(scope: !111, file: !2, line: 556, column: 5)
!117 = !DILocation(line: 557, column: 71, scope: !116)
!118 = !DILocation(line: 557, column: 102, scope: !116)
!119 = !DILocation(line: 557, column: 9, scope: !116)
!120 = !DILocation(line: 555, column: 49, scope: !111)
!121 = !DILocalVariable(name: "darkFontDataSize", scope: !106, file: !2, line: 562, type: !3, align: 4)
!122 = !DILocation(line: 562, column: 9, scope: !106)
!123 = !DILocation(line: 562, column: 28, scope: !106)
!124 = !DILocalVariable(name: "data", scope: !106, file: !2, line: 563, type: !125, align: 8)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DILocation(line: 563, column: 11, scope: !106)
!127 = !DILocation(line: 563, column: 18, scope: !106)
!128 = !DILocalVariable(name: "imFont", scope: !106, file: !2, line: 564, type: !65, align: 8)
!129 = !DILocation(line: 564, column: 11, scope: !106)
!130 = !DILocation(line: 564, column: 22, scope: !106)
!131 = !DILocation(line: 564, column: 28, scope: !106)
!132 = !DILocation(line: 564, column: 33, scope: !106)
!133 = !DILocation(line: 564, column: 38, scope: !106)
!134 = !DILocation(line: 564, column: 41, scope: !106)
!135 = !DILocalVariable(name: "font", scope: !106, file: !2, line: 566, type: !136, align: 8)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Font", scope: !2, file: !2, line: 150, size: 384, align: 64, elements: !137, identifier: "raylib5.rl.Font")
!137 = !{!138, !139, !140, !141, !151, !153}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "baseSize", scope: !136, file: !2, line: 152, baseType: !3, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "glyphCount", scope: !136, file: !2, line: 153, baseType: !3, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "glyphPadding", scope: !136, file: !2, line: 154, baseType: !3, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !136, file: !2, line: 155, baseType: !142, size: 160, align: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "Texture2D", scope: !2, file: !2, line: 112, baseType: !143, align: 4)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture", scope: !2, file: !2, line: 102, size: 160, align: 32, elements: !144, identifier: "raylib5.rl.Texture")
!144 = !{!145, !147, !148, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !2, line: 104, baseType: !146, size: 32, align: 32)
!146 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !143, file: !2, line: 105, baseType: !3, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !143, file: !2, line: 106, baseType: !3, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mipmaps", scope: !143, file: !2, line: 107, baseType: !3, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !143, file: !2, line: 108, baseType: !73, size: 32, align: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "recs", scope: !136, file: !2, line: 156, baseType: !152, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Rectangle*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !136, file: !2, line: 157, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "GlyphInfo*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!155 = !DILocation(line: 566, column: 10, scope: !106)
!156 = !DILocation(line: 567, column: 21, scope: !106)
!157 = !DILocation(line: 568, column: 5, scope: !106)
!158 = !DILocation(line: 568, column: 23, scope: !106)
!159 = !DILocation(line: 571, column: 5, scope: !106)
!160 = !DILocation(line: 571, column: 20, scope: !106)
!161 = !DILocation(line: 572, column: 5, scope: !106)
!162 = !DILocation(line: 576, column: 5, scope: !106)
!163 = !DILocation(line: 576, column: 43, scope: !106)
!164 = !DILocation(line: 252, column: 55, scope: !165, inlinedAt: !167)
!165 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !166, file: !166, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!166 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!167 = !DILocation(line: 244, column: 9, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !166, file: !166, line: 242, scopeLine: 242, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!169 = !DILocation(line: 746, column: 9, scope: !170, inlinedAt: !172)
!170 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !171, file: !171, line: 744, scopeLine: 744, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!171 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!172 = !DILocation(line: 576, column: 17, scope: !106)
!173 = !DILocation(line: 252, column: 40, scope: !165, inlinedAt: !167)
!174 = !DILocation(line: 79, column: 6, scope: !175, inlinedAt: !176)
!175 = distinct !DISubprogram(name: "calloc_try", linkageName: "calloc_try", scope: !166, file: !166, line: 77, scopeLine: 77, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!176 = !DILocation(line: 252, column: 18, scope: !165, inlinedAt: !167)
!177 = !DILocation(line: 79, column: 20, scope: !175, inlinedAt: !176)
!178 = !DILocation(line: 28, column: 71, scope: !179, inlinedAt: !180)
!179 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !166, file: !166, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!180 = !DILocation(line: 80, column: 9, scope: !175, inlinedAt: !176)
!181 = !DILocation(line: 252, column: 67, scope: !165, inlinedAt: !167)
!182 = !DILocation(line: 577, column: 5, scope: !106)
!183 = !DILocation(line: 577, column: 17, scope: !106)
!184 = !DILocation(line: 581, column: 5, scope: !106)
!185 = !DILocation(line: 581, column: 45, scope: !106)
!186 = !DILocation(line: 252, column: 55, scope: !187, inlinedAt: !188)
!187 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !166, file: !166, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!188 = !DILocation(line: 244, column: 9, scope: !189, inlinedAt: !190)
!189 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !166, file: !166, line: 242, scopeLine: 242, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!190 = !DILocation(line: 746, column: 9, scope: !191, inlinedAt: !192)
!191 = distinct !DISubprogram(name: "new_array", linkageName: "new_array", scope: !171, file: !171, line: 744, scopeLine: 744, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !103)
!192 = !DILocation(line: 581, column: 19, scope: !106)
!193 = !DILocation(line: 252, column: 40, scope: !187, inlinedAt: !188)
!194 = !DILocation(line: 79, column: 6, scope: !195, inlinedAt: !196)
