; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }

@"std.os.backtrace.BacktraceFault$SEGMENT_NOT_FOUND" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.backtrace.BacktraceFault" to i64), %"char[]" { ptr @.fault, i64 17 }, i64 1 }, align 8
@.fault = internal constant [18 x i8] c"SEGMENT_NOT_FOUND\00", align 1
@"std.os.backtrace.BacktraceFault$EXECUTABLE_PATH_NOT_FOUND" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.backtrace.BacktraceFault" to i64), %"char[]" { ptr @.fault.1, i64 25 }, i64 2 }, align 8
@.fault.1 = internal constant [26 x i8] c"EXECUTABLE_PATH_NOT_FOUND\00", align 1
@"std.os.backtrace.BacktraceFault$IMAGE_NOT_FOUND" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.backtrace.BacktraceFault" to i64), %"char[]" { ptr @.fault.2, i64 15 }, i64 3 }, align 8
@.fault.2 = internal constant [16 x i8] c"IMAGE_NOT_FOUND\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "/opt/homebrew/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 17, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 18, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 19, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 20, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 21, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 22, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 23, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIC Level", i32 2}
!34 = !{i32 1, !"uwtable", i32 1}
!35 = !{i32 2, !"frame-pointer", i32 1}
!36 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !37, splitDebugInlining: false)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 27, type: !39, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!39 = !DISubroutineType(types: !40)
!40 = !{!29, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !{}
!43 = !DILocation(line: 28, column: 1, scope: !38)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !38, file: !2, line: 27, type: !41)
!45 = !DILocation(line: 27, column: 28, scope: !38)
!46 = !DILocation(line: 29, column: 9, scope: !38)
!47 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 32, type: !39, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!48 = !DILocation(line: 33, column: 1, scope: !47)
!49 = !DILocalVariable(name: "self", arg: 1, scope: !47, file: !2, line: 32, type: !41)
!50 = !DILocation(line: 32, column: 30, scope: !47)
!51 = !DILocation(line: 34, column: 10, scope: !47)
!52 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 37, type: !53, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !57, !41, !58}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !56)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 71, size: 384, align: 64, elements: !60, identifier: "std.io.Formatter")
!60 = !{!61, !62, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 73, baseType: !25, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !59, file: !2, line: 74, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!65 = !DISubroutineType(types: !66)
!66 = !{!55, !25, !25, !14}
!67 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, line: 75, baseType: !68, size: 256, align: 64, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !59, file: !2, line: 75, size: 256, align: 64, elements: !69)
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !2, line: 77, baseType: !20, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !68, file: !2, line: 78, baseType: !20, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !68, file: !2, line: 79, baseType: !20, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !68, file: !2, line: 80, baseType: !16, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !68, file: !2, line: 81, baseType: !55, size: 64, align: 64, offset: 192)
!75 = !DILocation(line: 38, column: 1, scope: !52)
!76 = !DILocalVariable(name: "self", arg: 1, scope: !52, file: !2, line: 37, type: !41)
!77 = !DILocation(line: 37, column: 29, scope: !52)
!78 = !DILocalVariable(name: "formatter", arg: 2, scope: !52, file: !2, line: 37, type: !58)
!79 = !DILocation(line: 37, column: 47, scope: !52)
!80 = !DILocalVariable(name: "inline_suffix", scope: !52, file: !2, line: 39, type: !9, align: 8)
!81 = !DILocation(line: 39, column: 9, scope: !52)
!82 = !DILocation(line: 39, column: 25, scope: !52)
!83 = !DILocation(line: 39, column: 56, scope: !52)
!84 = !DILocation(line: 40, column: 6, scope: !52)
!85 = !DILocation(line: 42, column: 51, scope: !86)
!86 = distinct !DILexicalBlock(scope: !52, file: !2, line: 41, column: 2)
!87 = !DILocation(line: 42, column: 66, scope: !86)
!88 = !DILocation(line: 42, column: 84, scope: !86)
!89 = !DILocation(line: 42, column: 95, scope: !86)
!90 = !DILocation(line: 42, column: 106, scope: !86)
!91 = !DILocation(line: 42, column: 10, scope: !86)
!92 = !DILocation(line: 44, column: 6, scope: !52)
!93 = !DILocation(line: 46, column: 49, scope: !94)
!94 = distinct !DILexicalBlock(scope: !52, file: !2, line: 45, column: 2)
!95 = !DILocation(line: 46, column: 10, scope: !94)
!96 = !DILocation(line: 48, column: 63, scope: !52)
!97 = !DILocation(line: 48, column: 78, scope: !52)
!98 = !DILocation(line: 48, column: 96, scope: !52)
!99 = !DILocation(line: 48, column: 9, scope: !52)
!100 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 50, type: !101, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !41}
!103 = !DILocation(line: 51, column: 1, scope: !100)
!104 = !DILocalVariable(name: "self", arg: 1, scope: !100, file: !2, line: 50, type: !41)
!105 = !DILocation(line: 50, column: 24, scope: !100)
!106 = !DILocation(line: 52, column: 7, scope: !100)
!107 = !DILocation(line: 52, column: 29, scope: !100)
!108 = !DILocation(line: 53, column: 18, scope: !100)
!109 = !DILocation(line: 53, column: 34, scope: !100)
!110 = !DILocation(line: 101, column: 6, scope: !111, inlinedAt: !113)
!111 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !112, file: !112, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!112 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!113 = !DILocation(line: 53, column: 2, scope: !100)
!114 = !DILocation(line: 101, column: 18, scope: !111, inlinedAt: !113)
!115 = !DILocation(line: 105, column: 25, scope: !111, inlinedAt: !113)
!116 = !DILocation(line: 105, column: 2, scope: !111, inlinedAt: !113)
!117 = !DILocation(line: 54, column: 18, scope: !100)
!118 = !DILocation(line: 54, column: 34, scope: !100)
!119 = !DILocation(line: 101, column: 6, scope: !120, inlinedAt: !121)
!120 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !112, file: !112, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!121 = !DILocation(line: 54, column: 2, scope: !100)
!122 = !DILocation(line: 101, column: 18, scope: !120, inlinedAt: !121)
!123 = !DILocation(line: 105, column: 25, scope: !120, inlinedAt: !121)
!124 = !DILocation(line: 105, column: 2, scope: !120, inlinedAt: !121)
!125 = !DILocation(line: 55, column: 18, scope: !100)
!126 = !DILocation(line: 55, column: 34, scope: !100)
!127 = !DILocation(line: 101, column: 6, scope: !128, inlinedAt: !129)
!128 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !112, file: !112, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !36)
!129 = !DILocation(line: 55, column: 2, scope: !100)
!130 = !DILocation(line: 101, column: 18, scope: !128, inlinedAt: !129)
!131 = !DILocation(line: 105, column: 25, scope: !128, inlinedAt: !129)
!132 = !DILocation(line: 105, column: 2, scope: !128, inlinedAt: !129)
!133 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 58, type: !134, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!134 = !DISubroutineType(types: !135)
!135 = !{!41, !41, !7, !9, !9, !9, !20, !22}
!136 = !DILocation(line: 59, column: 1, scope: !133)
!137 = !DILocalVariable(name: "self", arg: 1, scope: !133, file: !2, line: 58, type: !41)
!138 = !DILocation(line: 58, column: 30, scope: !133)
!139 = !DILocalVariable(name: "offset", arg: 2, scope: !133, file: !2, line: 58, type: !6)
!140 = !DILocation(line: 58, column: 42, scope: !133)
!141 = !DILocalVariable(name: "function", arg: 3, scope: !133, file: !2, line: 58, type: !9)
!142 = !DILocation(line: 58, column: 57, scope: !133)
!143 = !DILocalVariable(name: "object_file", arg: 4, scope: !133, file: !2, line: 58, type: !9)
!144 = !DILocation(line: 58, column: 74, scope: !133)
!145 = !DILocalVariable(name: "file", arg: 5, scope: !133, file: !2, line: 58, type: !9)
!146 = !DILocation(line: 58, column: 94, scope: !133)
!147 = !DILocalVariable(name: "line", arg: 6, scope: !133, file: !2, line: 58, type: !20)
!148 = !DILocation(line: 58, column: 110, scope: !133)
!149 = !DILocalVariable(name: "allocator", arg: 7, scope: !133, file: !2, line: 58, type: !22)
!150 = !DILocation(line: 58, column: 130, scope: !133)
!151 = !DILocation(line: 60, column: 6, scope: !133)
!152 = !DILocation(line: 62, column: 3, scope: !153)
!153 = distinct !DILexicalBlock(scope: !133, file: !2, line: 61, column: 2)
!154 = !DILocation(line: 62, column: 17, scope: !153)
!155 = !DILocation(line: 63, column: 3, scope: !153)
!156 = !DILocation(line: 63, column: 19, scope: !153)
!157 = !DILocation(line: 64, column: 3, scope: !153)
!158 = !DILocation(line: 64, column: 22, scope: !153)
!159 = !DILocation(line: 65, column: 3, scope: !153)
!160 = !DILocation(line: 65, column: 15, scope: !153)
!161 = !DILocation(line: 66, column: 3, scope: !153)
!162 = !DILocation(line: 66, column: 15, scope: !153)
!163 = !DILocation(line: 67, column: 3, scope: !153)
!164 = !DILocation(line: 67, column: 20, scope: !153)
!165 = !DILocation(line: 68, column: 10, scope: !153)
!166 = !DILocation(line: 70, column: 2, scope: !133)
!167 = !DILocation(line: 70, column: 16, scope: !133)
!168 = !DILocation(line: 71, column: 2, scope: !133)
!169 = !DILocation(line: 71, column: 32, scope: !133)
!170 = !DILocation(line: 71, column: 18, scope: !133)
!171 = !DILocation(line: 72, column: 2, scope: !133)
!172 = !DILocation(line: 72, column: 38, scope: !133)
!173 = !DILocation(line: 72, column: 21, scope: !133)
!174 = !DILocation(line: 73, column: 2, scope: !133)
!175 = !DILocation(line: 73, column: 24, scope: !133)
!176 = !DILocation(line: 73, column: 14, scope: !133)
!177 = !DILocation(line: 74, column: 2, scope: !133)
!178 = !DILocation(line: 74, column: 19, scope: !133)
!179 = !DILocation(line: 75, column: 2, scope: !133)
!180 = !DILocation(line: 75, column: 14, scope: !133)
!181 = !DILocation(line: 76, column: 9, scope: !133)
!182 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 79, type: !183, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !36, retainedNodes: !42)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !185}
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !186, identifier: "void*[]")
!186 = !{!187, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !185, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, baseType: !16, size: 64, align: 64, offset: 64)
!190 = !DILocalVariable(name: "buffer", arg: 1, scope: !182, file: !2, line: 79, type: !185)
!191 = !DILocation(line: 79, column: 36, scope: !182)
!192 = !DILocation(line: 81, column: 6, scope: !182)
!193 = !DILocation(line: 81, column: 26, scope: !182)
!194 = !DILocalVariable(name: "len", scope: !182, file: !2, line: 84, type: !195, align: 4)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !196, align: 4)
!196 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!197 = !DILocation(line: 84, column: 9, scope: !182)
!198 = !DILocation(line: 84, column: 44, scope: !182)
!199 = !DILocation(line: 84, column: 15, scope: !182)
!200 = !DILocation(line: 85, column: 11, scope: !182)
!201 = !DILocation(line: 85, column: 18, scope: !182)
!202 = !DILocation(line: 85, column: 19, scope: !182)
