; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%Stat = type { i32, i16, i16, i64, i32, i32, i32, %TimeSpec, %TimeSpec, %TimeSpec, %TimeSpec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%TimeSpec = type { i64, i64 }
%"any[]" = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }
%List = type { i64, i64, %any, ptr }

@std.core.mem.allocator.thread_temp_allocator = extern_weak thread_local global ptr, align 8
@"std.io.IoError$ALREADY_EXISTS" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.io.IoError" to i64), %"char[]" { ptr @.fault, i64 14 }, i64 1 }, align 8
@.fault = internal constant [15 x i8] c"ALREADY_EXISTS\00", align 1
@"std.io.IoError$BUSY" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.io.IoError" to i64), %"char[]" { ptr @.fault.1, i64 4 }, i64 2 }, align 8
@.fault.1 = internal constant [5 x i8] c"BUSY\00", align 1
@"std.io.IoError$CANNOT_READ_DIR" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.io.IoError" to i64), %"char[]" { ptr @.fault.2, i64 15 }, i64 3 }, align 8
@.fault.2 = internal constant [16 x i8] c"CANNOT_READ_DIR\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "fileinfo.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!8 = !{!9, !28}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !11, file: !10, line: 26, baseType: !24, size: 32, align: 32, elements: !25)
!10 = !DIFile(filename: "rmtree.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !10, file: !10, line: 20, size: 192, align: 64, elements: !12, identifier: "std.io.path.PathImp")
!12 = !{!13, !23}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !11, file: !10, line: 22, baseType: !14, size: 128, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !16, identifier: "char[]")
!16 = !{!17, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !15, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !22)
!22 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !11, file: !10, line: 23, baseType: !9, size: 32, align: 32, offset: 128)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !{!26, !27}
!26 = !DIEnumerator(name: "WIN32", value: 0)
!27 = !DIEnumerator(name: "POSIX", value: 1)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !29, file: !29, line: 7, baseType: !24, size: 32, align: 32, elements: !30)
!29 = !DIFile(filename: "file_libc.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "SET", value: 0)
!32 = !DIEnumerator(name: "CURSOR", value: 1)
!33 = !DIEnumerator(name: "END", value: 2)
!34 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !7, file: !7, line: 70, type: !35, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !14}
!37 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!38 = !{}
!39 = !DILocalVariable(name: "path", arg: 1, scope: !34, file: !7, line: 70, type: !14)
!40 = !DILocation(line: 70, column: 42, scope: !34)
!41 = !DILocalVariable(name: "stat", scope: !34, file: !7, line: 78, type: !42, align: 8)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !7, file: !7, line: 10, size: 1152, align: 64, elements: !43, identifier: "libc.Stat")
!43 = !{!44, !46, !49, !51, !53, !56, !58, !59, !67, !68, !69, !70, !72, !74, !76, !77, !78, !79}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !42, file: !7, line: 12, baseType: !45, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !7, file: !7, line: 3, baseType: !24, align: 4)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !42, file: !7, line: 13, baseType: !47, size: 16, align: 16, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !7, file: !7, line: 4, baseType: !48, align: 2)
!48 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !42, file: !7, line: 14, baseType: !50, size: 16, align: 16, offset: 48)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !7, file: !7, line: 5, baseType: !48, align: 2)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !42, file: !7, line: 15, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !7, file: !7, line: 8, baseType: !22, align: 8)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !42, file: !7, line: 16, baseType: !54, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !7, file: !7, line: 17, baseType: !55, align: 4)
!55 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !42, file: !7, line: 17, baseType: !57, size: 32, align: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !7, file: !7, line: 18, baseType: !55, align: 4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !42, file: !7, line: 18, baseType: !45, size: 32, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !42, file: !7, line: 20, baseType: !60, size: 128, align: 64, offset: 256)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "TimeSpec", scope: !42, file: !7, line: 412, size: 128, align: 64, elements: !61, identifier: "libc.TimeSpec")
!61 = !{!62, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !60, file: !7, line: 414, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !7, file: !7, line: 64, baseType: !64, align: 8)
!64 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !60, file: !7, line: 416, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "CLong", scope: !7, file: !7, line: 23, baseType: !64, align: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !42, file: !7, line: 21, baseType: !60, size: 128, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !42, file: !7, line: 22, baseType: !60, size: 128, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !42, file: !7, line: 23, baseType: !60, size: 128, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !42, file: !7, line: 24, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !7, file: !7, line: 65, baseType: !22, align: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !42, file: !7, line: 25, baseType: !73, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !7, file: !7, line: 6, baseType: !64, align: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocksize", scope: !42, file: !7, line: 26, baseType: !75, size: 32, align: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !7, file: !7, line: 7, baseType: !24, align: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !42, file: !7, line: 27, baseType: !55, size: 32, align: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !42, file: !7, line: 28, baseType: !55, size: 32, align: 32, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !42, file: !7, line: 29, baseType: !24, size: 32, align: 32, offset: 992)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !42, file: !7, line: 30, baseType: !80, size: 128, align: 64, offset: 1024)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, align: 64, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 2, lowerBound: 0)
!83 = !DILocation(line: 78, column: 9, scope: !34)
!84 = !DILocation(line: 79, column: 34, scope: !85, inlinedAt: !87)
!85 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !86, file: !86, line: 364, scopeLine: 364, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!86 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/lib/c3/std/core")
!87 = !DILocation(line: 79, column: 11, scope: !34)
!88 = !DILocation(line: 366, column: 12, scope: !85, inlinedAt: !87)
!89 = !DILocation(line: 366, column: 26, scope: !85, inlinedAt: !87)
!90 = !DILocation(line: 367, column: 9, scope: !85, inlinedAt: !87)
!91 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !7, file: !7, line: 95, type: !35, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!92 = !DILocalVariable(name: "path", arg: 1, scope: !91, file: !7, line: 95, type: !14)
!93 = !DILocation(line: 95, column: 31, scope: !91)
!94 = !DILocalVariable(name: "stat", scope: !91, file: !7, line: 103, type: !42, align: 8)
!95 = !DILocation(line: 103, column: 9, scope: !91)
!96 = !DILocation(line: 104, column: 34, scope: !97, inlinedAt: !98)
!97 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !86, file: !86, line: 364, scopeLine: 364, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!98 = !DILocation(line: 104, column: 11, scope: !91)
!99 = !DILocation(line: 366, column: 12, scope: !97, inlinedAt: !98)
!100 = !DILocation(line: 366, column: 26, scope: !97, inlinedAt: !98)
!101 = !DILocation(line: 367, column: 9, scope: !97, inlinedAt: !98)
!102 = !DILocation(line: 104, column: 58, scope: !91)
!103 = !DILocation(line: 374, column: 52, scope: !104, inlinedAt: !106)
!104 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !105, file: !105, line: 374, scopeLine: 374, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!105 = !DIFile(filename: "libc.c3", directory: "/opt/homebrew/lib/c3/std/libc")
!106 = !DILocation(line: 104, column: 44, scope: !91)
!107 = !DILocation(line: 374, column: 71, scope: !104, inlinedAt: !106)
!108 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !7, file: !7, line: 112, type: !35, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!109 = !DILocalVariable(name: "path", arg: 1, scope: !108, file: !7, line: 112, type: !14)
!110 = !DILocation(line: 112, column: 30, scope: !108)
!111 = !DILocalVariable(name: "stat", scope: !108, file: !7, line: 115, type: !42, align: 8)
!112 = !DILocation(line: 115, column: 8, scope: !108)
!113 = !DILocation(line: 116, column: 33, scope: !114, inlinedAt: !115)
!114 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !86, file: !86, line: 364, scopeLine: 364, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!115 = !DILocation(line: 116, column: 10, scope: !108)
!116 = !DILocation(line: 366, column: 12, scope: !114, inlinedAt: !115)
!117 = !DILocation(line: 366, column: 26, scope: !114, inlinedAt: !115)
!118 = !DILocation(line: 367, column: 9, scope: !114, inlinedAt: !115)
!119 = !DILocation(line: 116, column: 57, scope: !108)
!120 = !DILocation(line: 374, column: 52, scope: !121, inlinedAt: !122)
!121 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !105, file: !105, line: 374, scopeLine: 374, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!122 = !DILocation(line: 116, column: 43, scope: !108)
!123 = !DILocation(line: 374, column: 71, scope: !121, inlinedAt: !122)
!124 = distinct !DISubprogram(name: "native_stat", linkageName: "std.io.os.native_stat", scope: !7, file: !7, line: 4, type: !125, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !128, !129, !14}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Stat*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DILocalVariable(name: "stat", arg: 1, scope: !124, file: !7, line: 4, type: !129)
!131 = !DILocation(line: 4, column: 28, scope: !124)
!132 = !DILocalVariable(name: "path", arg: 2, scope: !124, file: !7, line: 4, type: !14)
!133 = !DILocation(line: 4, column: 41, scope: !124)
!134 = !DILocalVariable(name: "current", scope: !135, file: !7, line: 592, type: !137, align: 8)
!135 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !136, file: !136, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !38)
!136 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !139, identifier: "std.core.mem.allocator.TempAllocator")
!139 = !{!140, !146, !159, !160, !161}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !138, file: !7, line: 12, baseType: !141, size: 128, align: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !142, identifier: "Allocator")
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !141, baseType: !128, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !138, file: !7, line: 13, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !148, size: 64, align: 64, dwarfAddressSpace: 0)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 22, size: 320, align: 64, elements: !149, identifier: "std.core.mem.allocator.TempAllocatorPage")
!149 = !{!150, !151, !152, !153, !154, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !148, file: !7, line: 24, baseType: !147, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !148, file: !7, line: 25, baseType: !128, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !148, file: !7, line: 26, baseType: !21, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !148, file: !7, line: 27, baseType: !21, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !148, file: !7, line: 28, baseType: !21, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !7, line: 29, baseType: !156, align: 8, offset: 320)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, align: 8, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 0, lowerBound: 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !138, file: !7, line: 14, baseType: !21, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !138, file: !7, line: 15, baseType: !21, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !7, line: 16, baseType: !156, align: 8, offset: 320)
!162 = !DILocation(line: 592, column: 17, scope: !135, inlinedAt: !163)
!163 = !DILocation(line: 6, column: 2, scope: !124)
!164 = !DILocation(line: 396, column: 6, scope: !165, inlinedAt: !167)
!165 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!166 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!167 = !DILocation(line: 592, column: 27, scope: !135, inlinedAt: !163)
!168 = !DILocation(line: 398, column: 3, scope: !169, inlinedAt: !167)
!169 = distinct !DILexicalBlock(scope: !165, file: !166, line: 397, column: 2)
!170 = !DILocation(line: 400, column: 9, scope: !165, inlinedAt: !167)
!171 = !DILocalVariable(name: "mark", scope: !135, file: !7, line: 597, type: !21, align: 8)
!172 = !DILocation(line: 597, column: 6, scope: !135, inlinedAt: !163)
!173 = !DILocation(line: 597, column: 13, scope: !135, inlinedAt: !163)
!174 = !DILocalVariable(name: "res", scope: !175, file: !7, line: 9, type: !24, align: 4)
!175 = distinct !DILexicalBlock(scope: !124, file: !7, line: 7, column: 2)
!176 = !DILocation(line: 9, column: 8, scope: !175)
!177 = !DILocation(line: 9, column: 25, scope: !175)
!178 = !DILocation(line: 9, column: 44, scope: !175)
!179 = !DILocation(line: 9, column: 14, scope: !175)
!180 = !DILocation(line: 14, column: 7, scope: !175)
!181 = !DILocation(line: 16, column: 12, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !7, line: 16, column: 4)
!183 = distinct !DILexicalBlock(scope: !175, file: !7, line: 15, column: 3)
!184 = !DILocation(line: 600, column: 17, scope: !185, inlinedAt: !163)
!185 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!186 = !DILocation(line: 600, column: 3, scope: !185, inlinedAt: !163)
!187 = !DILocation(line: 603, column: 9, scope: !185, inlinedAt: !163)
!188 = !DILocation(line: 165, column: 33, scope: !189, inlinedAt: !190)
!189 = distinct !DISubprogram(name: "unreachable", linkageName: "unreachable", scope: !86, file: !86, line: 162, scopeLine: 162, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!190 = !DILocation(line: 21, column: 6, scope: !191)
!191 = distinct !DILexicalBlock(scope: !182, file: !7, line: 21, column: 6)
!192 = !DILocation(line: 165, column: 2, scope: !189, inlinedAt: !190)
!193 = !DILocation(line: 167, column: 2, scope: !189, inlinedAt: !190)
!194 = !DILocation(line: 600, column: 17, scope: !195, inlinedAt: !163)
!195 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!196 = !DILocation(line: 600, column: 3, scope: !195, inlinedAt: !163)
!197 = !DILocation(line: 603, column: 9, scope: !195, inlinedAt: !163)
!198 = !DILocation(line: 600, column: 17, scope: !199, inlinedAt: !163)
!199 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!200 = !DILocation(line: 600, column: 3, scope: !199, inlinedAt: !163)
!201 = !DILocation(line: 603, column: 9, scope: !199, inlinedAt: !163)
!202 = !DILocation(line: 600, column: 17, scope: !203, inlinedAt: !163)
!203 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!204 = !DILocation(line: 600, column: 3, scope: !203, inlinedAt: !163)
!205 = !DILocation(line: 603, column: 9, scope: !203, inlinedAt: !163)
!206 = !DILocation(line: 600, column: 17, scope: !207, inlinedAt: !163)
!207 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!208 = !DILocation(line: 600, column: 3, scope: !207, inlinedAt: !163)
!209 = !DILocation(line: 603, column: 9, scope: !207, inlinedAt: !163)
!210 = !DILocation(line: 600, column: 17, scope: !211, inlinedAt: !163)
!211 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!212 = !DILocation(line: 600, column: 3, scope: !211, inlinedAt: !163)
!213 = !DILocation(line: 603, column: 9, scope: !211, inlinedAt: !163)
!214 = !DILocation(line: 600, column: 17, scope: !215, inlinedAt: !163)
!215 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!216 = !DILocation(line: 600, column: 3, scope: !215, inlinedAt: !163)
!217 = !DILocation(line: 603, column: 9, scope: !215, inlinedAt: !163)
!218 = !DILocation(line: 600, column: 17, scope: !219, inlinedAt: !163)
!219 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!220 = !DILocation(line: 600, column: 3, scope: !219, inlinedAt: !163)
!221 = !DILocation(line: 603, column: 9, scope: !219, inlinedAt: !163)
!222 = !DILocation(line: 600, column: 17, scope: !223, inlinedAt: !163)
!223 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!224 = !DILocation(line: 600, column: 3, scope: !223, inlinedAt: !163)
!225 = !DILocation(line: 603, column: 9, scope: !223, inlinedAt: !163)
!226 = !DILocation(line: 600, column: 17, scope: !227, inlinedAt: !163)
!227 = distinct !DILexicalBlock(scope: !135, file: !136, line: 599, column: 2)
!228 = !DILocation(line: 600, column: 3, scope: !227, inlinedAt: !163)
!229 = !DILocation(line: 603, column: 9, scope: !227, inlinedAt: !163)
!230 = distinct !DISubprogram(name: "native_file_size", linkageName: "std.io.os.native_file_size", scope: !7, file: !7, line: 63, type: !231, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!231 = !DISubroutineType(types: !232)
!232 = !{!127, !233, !14}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!234 = !DILocalVariable(name: "path", arg: 1, scope: !230, file: !7, line: 63, type: !14)
!235 = !DILocation(line: 63, column: 33, scope: !230)
!236 = !DILocalVariable(name: "stat", scope: !230, file: !7, line: 65, type: !42, align: 8)
!237 = !DILocation(line: 65, column: 7, scope: !230)
!238 = !DILocation(line: 66, column: 21, scope: !230)
!239 = !DILocation(line: 66, column: 2, scope: !230)
!240 = !DILocation(line: 67, column: 9, scope: !230)
!241 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !10, file: !10, line: 7, type: !242, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!242 = !DISubroutineType(types: !243)
!243 = !{!127, !128, !11}
!244 = !DILocalVariable(name: "dir", arg: 1, scope: !241, file: !10, line: 7, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !246, file: !246, line: 18, baseType: !11, align: 8)
!246 = !DIFile(filename: "temp_directory.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!247 = !DILocation(line: 7, column: 29, scope: !241)
!248 = !DILocation(line: 5, column: 11, scope: !249)
!249 = distinct !DILexicalBlock(scope: !241, file: !10, line: 8, column: 1)
!250 = !DILocalVariable(name: "directory", scope: !241, file: !10, line: 9, type: !251, align: 8)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !10, file: !10, line: 5, baseType: !128, align: 8)
!252 = !DILocation(line: 9, column: 9, scope: !241)
!253 = !DILocation(line: 9, column: 36, scope: !241)
!254 = !DILocation(line: 9, column: 21, scope: !241)
!255 = !DILocation(line: 11, column: 6, scope: !241)
!256 = !DILocation(line: 11, column: 25, scope: !241)
!257 = !DILocation(line: 11, column: 45, scope: !241)
!258 = !DILocation(line: 11, column: 72, scope: !241)
!259 = !DILocation(line: 10, column: 12, scope: !260)
!260 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!261 = !DILocation(line: 10, column: 39, scope: !260)
!262 = !DILocation(line: 10, column: 23, scope: !260)
!263 = !DILocation(line: 10, column: 12, scope: !264)
!264 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!265 = !DILocation(line: 10, column: 39, scope: !264)
!266 = !DILocation(line: 10, column: 23, scope: !264)
!267 = !DILocalVariable(name: "entry", scope: !241, file: !10, line: 12, type: !268, align: 8)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Posix_dirent*", baseType: !269, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !10, file: !10, line: 7, size: 8384, align: 64, elements: !270, identifier: "std.os.posix.Posix_dirent")
!270 = !{!271, !272, !273, !274, !275, !276}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !269, file: !10, line: 9, baseType: !52, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !269, file: !10, line: 10, baseType: !71, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !269, file: !10, line: 11, baseType: !48, size: 16, align: 16, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "d_namelen", scope: !269, file: !10, line: 12, baseType: !48, size: 16, align: 16, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !269, file: !10, line: 13, baseType: !19, size: 8, align: 8, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !10, line: 24, baseType: !277, size: 8192, align: 8, offset: 168)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, align: 8, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 1024, lowerBound: 0)
!280 = !DILocation(line: 12, column: 16, scope: !241)
!281 = !DILocation(line: 13, column: 2, scope: !241)
!282 = !DILocation(line: 13, column: 33, scope: !283)
!283 = distinct !DILexicalBlock(scope: !241, file: !10, line: 13, column: 2)
!284 = !DILocation(line: 13, column: 18, scope: !283)
!285 = !DILocalVariable(name: "current", scope: !286, file: !10, line: 592, type: !137, align: 8)
!286 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !136, file: !136, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !38)
!287 = !DILocation(line: 592, column: 17, scope: !286, inlinedAt: !288)
!288 = !DILocation(line: 15, column: 3, scope: !289)
!289 = distinct !DILexicalBlock(scope: !283, file: !10, line: 14, column: 2)
!290 = !DILocation(line: 396, column: 6, scope: !291, inlinedAt: !292)
!291 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!292 = !DILocation(line: 592, column: 27, scope: !286, inlinedAt: !288)
!293 = !DILocation(line: 398, column: 3, scope: !294, inlinedAt: !292)
!294 = distinct !DILexicalBlock(scope: !291, file: !166, line: 397, column: 2)
!295 = !DILocation(line: 400, column: 9, scope: !291, inlinedAt: !292)
!296 = !DILocalVariable(name: "mark", scope: !286, file: !10, line: 597, type: !21, align: 8)
!297 = !DILocation(line: 597, column: 6, scope: !286, inlinedAt: !288)
!298 = !DILocation(line: 597, column: 13, scope: !286, inlinedAt: !288)
!299 = !DILocalVariable(name: "name", scope: !300, file: !10, line: 17, type: !14, align: 8)
!300 = distinct !DILexicalBlock(scope: !289, file: !10, line: 16, column: 3)
!301 = !DILocation(line: 17, column: 11, scope: !300)
!302 = !DILocation(line: 17, column: 29, scope: !300)
!303 = !DILocation(line: 17, column: 20, scope: !300)
!304 = !DILocation(line: 18, column: 9, scope: !300)
!305 = !DILocation(line: 18, column: 17, scope: !300)
!306 = !DILocation(line: 18, column: 32, scope: !300)
!307 = !DILocation(line: 600, column: 17, scope: !308, inlinedAt: !288)
!308 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!309 = !DILocation(line: 600, column: 3, scope: !308, inlinedAt: !288)
!310 = !DILocation(line: 603, column: 9, scope: !308, inlinedAt: !288)
!311 = !DILocalVariable(name: "new_path", scope: !300, file: !10, line: 19, type: !245, align: 8)
!312 = !DILocation(line: 19, column: 9, scope: !300)
!313 = !DILocation(line: 19, column: 20, scope: !300)
!314 = !DILocation(line: 600, column: 17, scope: !315, inlinedAt: !288)
!315 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!316 = !DILocation(line: 600, column: 3, scope: !315, inlinedAt: !288)
!317 = !DILocation(line: 10, column: 12, scope: !318)
!318 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!319 = !DILocation(line: 10, column: 39, scope: !318)
!320 = !DILocation(line: 10, column: 23, scope: !318)
!321 = !DILocation(line: 20, column: 8, scope: !300)
!322 = !DILocation(line: 22, column: 5, scope: !323)
!323 = distinct !DILexicalBlock(scope: !300, file: !10, line: 21, column: 4)
!324 = !DILocation(line: 600, column: 17, scope: !325, inlinedAt: !288)
!325 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!326 = !DILocation(line: 600, column: 3, scope: !325, inlinedAt: !288)
!327 = !DILocation(line: 10, column: 12, scope: !328)
!328 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!329 = !DILocation(line: 10, column: 39, scope: !328)
!330 = !DILocation(line: 10, column: 23, scope: !328)
!331 = !DILocation(line: 600, column: 17, scope: !332, inlinedAt: !288)
!332 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!333 = !DILocation(line: 600, column: 3, scope: !332, inlinedAt: !288)
!334 = !DILocation(line: 603, column: 9, scope: !332, inlinedAt: !288)
!335 = !DILocation(line: 25, column: 21, scope: !300)
!336 = !DILocation(line: 25, column: 8, scope: !300)
!337 = !DILocation(line: 600, column: 17, scope: !338, inlinedAt: !288)
!338 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!339 = !DILocation(line: 600, column: 3, scope: !338, inlinedAt: !288)
!340 = !DILocation(line: 10, column: 12, scope: !341)
!341 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!342 = !DILocation(line: 10, column: 39, scope: !341)
!343 = !DILocation(line: 10, column: 23, scope: !341)
!344 = !DILocation(line: 600, column: 17, scope: !345, inlinedAt: !288)
!345 = distinct !DILexicalBlock(scope: !286, file: !136, line: 599, column: 2)
!346 = !DILocation(line: 600, column: 3, scope: !345, inlinedAt: !288)
!347 = !DILocation(line: 603, column: 9, scope: !345, inlinedAt: !288)
!348 = !DILocation(line: 11, column: 22, scope: !349, inlinedAt: !351)
!349 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !350, file: !350, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!350 = !DIFile(filename: "rmdir.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!351 = !DILocation(line: 32, column: 2, scope: !241)
!352 = !DILocation(line: 11, column: 8, scope: !349, inlinedAt: !351)
!353 = !DILocation(line: 11, column: 46, scope: !349, inlinedAt: !351)
!354 = !DILocation(line: 12, column: 12, scope: !355, inlinedAt: !351)
!355 = distinct !DILexicalBlock(scope: !349, file: !350, line: 12, column: 4)
!356 = !DILocation(line: 14, column: 31, scope: !357, inlinedAt: !351)
!357 = distinct !DILexicalBlock(scope: !355, file: !350, line: 14, column: 24)
!358 = !DILocation(line: 18, column: 32, scope: !359, inlinedAt: !351)
!359 = distinct !DILexicalBlock(scope: !355, file: !350, line: 18, column: 25)
!360 = !DILocation(line: 19, column: 38, scope: !361, inlinedAt: !351)
!361 = distinct !DILexicalBlock(scope: !355, file: !350, line: 19, column: 31)
!362 = !DILocation(line: 21, column: 32, scope: !363, inlinedAt: !351)
!363 = distinct !DILexicalBlock(scope: !355, file: !350, line: 21, column: 25)
!364 = !DILocation(line: 22, column: 35, scope: !365, inlinedAt: !351)
!365 = distinct !DILexicalBlock(scope: !355, file: !350, line: 22, column: 28)
!366 = !DILocation(line: 23, column: 31, scope: !367, inlinedAt: !351)
!367 = distinct !DILexicalBlock(scope: !355, file: !350, line: 23, column: 24)
!368 = !DILocation(line: 24, column: 21, scope: !369, inlinedAt: !351)
!369 = distinct !DILexicalBlock(scope: !355, file: !350, line: 24, column: 14)
!370 = !DILocation(line: 10, column: 12, scope: !371)
!371 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!372 = !DILocation(line: 10, column: 39, scope: !371)
!373 = !DILocation(line: 10, column: 23, scope: !371)
!374 = !DILocation(line: 10, column: 12, scope: !375)
!375 = distinct !DILexicalBlock(scope: !241, file: !10, line: 10, column: 8)
!376 = !DILocation(line: 10, column: 39, scope: !375)
!377 = !DILocation(line: 10, column: 23, scope: !375)
!378 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !29, file: !29, line: 8, type: !379, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!379 = !DISubroutineType(types: !380)
!380 = !{!127, !381, !14, !14}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!382 = !DILocalVariable(name: "filename", arg: 1, scope: !378, file: !29, line: 8, type: !14)
!383 = !DILocation(line: 8, column: 31, scope: !378)
!384 = !DILocalVariable(name: "mode", arg: 2, scope: !378, file: !29, line: 8, type: !14)
!385 = !DILocation(line: 8, column: 48, scope: !378)
!386 = !DILocation(line: 5, column: 11, scope: !387)
!387 = distinct !DILexicalBlock(scope: !378, file: !29, line: 9, column: 1)
!388 = !DILocation(line: 6, column: 11, scope: !387)
!389 = !DILocalVariable(name: "current", scope: !390, file: !29, line: 592, type: !137, align: 8)
!390 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !136, file: !136, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !38)
!391 = !DILocation(line: 592, column: 17, scope: !390, inlinedAt: !392)
!392 = !DILocation(line: 10, column: 2, scope: !378)
!393 = !DILocation(line: 396, column: 6, scope: !394, inlinedAt: !395)
!394 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!395 = !DILocation(line: 592, column: 27, scope: !390, inlinedAt: !392)
!396 = !DILocation(line: 398, column: 3, scope: !397, inlinedAt: !395)
!397 = distinct !DILexicalBlock(scope: !394, file: !166, line: 397, column: 2)
!398 = !DILocation(line: 400, column: 9, scope: !394, inlinedAt: !395)
!399 = !DILocalVariable(name: "mark", scope: !390, file: !29, line: 597, type: !21, align: 8)
!400 = !DILocation(line: 597, column: 6, scope: !390, inlinedAt: !392)
!401 = !DILocation(line: 597, column: 13, scope: !390, inlinedAt: !392)
!402 = !DILocalVariable(name: "file", scope: !403, file: !29, line: 15, type: !128, align: 8)
!403 = distinct !DILexicalBlock(scope: !378, file: !29, line: 11, column: 2)
!404 = !DILocation(line: 15, column: 10, scope: !403)
!405 = !DILocation(line: 15, column: 29, scope: !403)
!406 = !DILocation(line: 15, column: 52, scope: !403)
!407 = !DILocation(line: 15, column: 17, scope: !403)
!408 = !DILocation(line: 17, column: 11, scope: !403)
!409 = !DILocation(line: 90, column: 10, scope: !410, inlinedAt: !412)
!410 = distinct !DILexicalBlock(scope: !411, file: !29, line: 90, column: 2)
!411 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !29, file: !29, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!412 = !DILocation(line: 17, column: 19, scope: !403)
!413 = !DILocation(line: 92, column: 30, scope: !414, inlinedAt: !412)
!414 = distinct !DILexicalBlock(scope: !410, file: !29, line: 92, column: 23)
!415 = !DILocation(line: 93, column: 30, scope: !416, inlinedAt: !412)
!416 = distinct !DILexicalBlock(scope: !410, file: !29, line: 93, column: 23)
!417 = !DILocation(line: 94, column: 29, scope: !418, inlinedAt: !412)
!418 = distinct !DILexicalBlock(scope: !410, file: !29, line: 94, column: 22)
!419 = !DILocation(line: 95, column: 30, scope: !420, inlinedAt: !412)
!420 = distinct !DILexicalBlock(scope: !410, file: !29, line: 95, column: 23)
!421 = !DILocation(line: 96, column: 29, scope: !422, inlinedAt: !412)
!422 = distinct !DILexicalBlock(scope: !410, file: !29, line: 96, column: 22)
!423 = !DILocation(line: 97, column: 30, scope: !424, inlinedAt: !412)
!424 = distinct !DILexicalBlock(scope: !410, file: !29, line: 97, column: 23)
!425 = !DILocation(line: 98, column: 30, scope: !426, inlinedAt: !412)
!426 = distinct !DILexicalBlock(scope: !410, file: !29, line: 98, column: 23)
!427 = !DILocation(line: 99, column: 29, scope: !428, inlinedAt: !412)
!428 = distinct !DILexicalBlock(scope: !410, file: !29, line: 99, column: 22)
!429 = !DILocation(line: 100, column: 30, scope: !430, inlinedAt: !412)
!430 = distinct !DILexicalBlock(scope: !410, file: !29, line: 100, column: 23)
!431 = !DILocation(line: 101, column: 36, scope: !432, inlinedAt: !412)
!432 = distinct !DILexicalBlock(scope: !410, file: !29, line: 101, column: 29)
!433 = !DILocation(line: 102, column: 30, scope: !434, inlinedAt: !412)
!434 = distinct !DILexicalBlock(scope: !410, file: !29, line: 102, column: 23)
!435 = !DILocation(line: 103, column: 31, scope: !436, inlinedAt: !412)
!436 = distinct !DILexicalBlock(scope: !410, file: !29, line: 103, column: 24)
!437 = !DILocation(line: 104, column: 30, scope: !438, inlinedAt: !412)
!438 = distinct !DILexicalBlock(scope: !410, file: !29, line: 104, column: 23)
!439 = !DILocation(line: 105, column: 30, scope: !440, inlinedAt: !412)
!440 = distinct !DILexicalBlock(scope: !410, file: !29, line: 105, column: 23)
!441 = !DILocation(line: 106, column: 29, scope: !442, inlinedAt: !412)
!442 = distinct !DILexicalBlock(scope: !410, file: !29, line: 106, column: 22)
!443 = !DILocation(line: 107, column: 33, scope: !444, inlinedAt: !412)
!444 = distinct !DILexicalBlock(scope: !410, file: !29, line: 107, column: 26)
!445 = !DILocation(line: 108, column: 29, scope: !446, inlinedAt: !412)
!446 = distinct !DILexicalBlock(scope: !410, file: !29, line: 108, column: 22)
!447 = !DILocation(line: 109, column: 34, scope: !448, inlinedAt: !412)
!448 = distinct !DILexicalBlock(scope: !410, file: !29, line: 109, column: 27)
!449 = !DILocation(line: 110, column: 27, scope: !450, inlinedAt: !412)
!450 = distinct !DILexicalBlock(scope: !410, file: !29, line: 110, column: 20)
!451 = !DILocation(line: 111, column: 35, scope: !452, inlinedAt: !412)
!452 = distinct !DILexicalBlock(scope: !410, file: !29, line: 111, column: 28)
!453 = !DILocation(line: 112, column: 19, scope: !454, inlinedAt: !412)
!454 = distinct !DILexicalBlock(scope: !410, file: !29, line: 112, column: 12)
!455 = !DILocation(line: 600, column: 17, scope: !456, inlinedAt: !392)
!456 = distinct !DILexicalBlock(scope: !390, file: !136, line: 599, column: 2)
!457 = !DILocation(line: 600, column: 3, scope: !456, inlinedAt: !392)
!458 = !DILocation(line: 603, column: 9, scope: !456, inlinedAt: !392)
!459 = !DILocation(line: 600, column: 17, scope: !460, inlinedAt: !392)
!460 = distinct !DILexicalBlock(scope: !390, file: !136, line: 599, column: 2)
!461 = !DILocation(line: 600, column: 3, scope: !460, inlinedAt: !392)
!462 = !DILocation(line: 603, column: 9, scope: !460, inlinedAt: !392)
!463 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !29, file: !29, line: 21, type: !464, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!464 = !DISubroutineType(types: !465)
!465 = !{!127, !128, !14}
!466 = !DILocalVariable(name: "filename", arg: 1, scope: !463, file: !29, line: 21, type: !14)
!467 = !DILocation(line: 21, column: 31, scope: !463)
!468 = !DILocalVariable(name: "current", scope: !469, file: !29, line: 592, type: !137, align: 8)
!469 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !136, file: !136, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !38)
!470 = !DILocation(line: 592, column: 17, scope: !469, inlinedAt: !471)
!471 = !DILocation(line: 23, column: 2, scope: !463)
!472 = !DILocation(line: 396, column: 6, scope: !473, inlinedAt: !474)
!473 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!474 = !DILocation(line: 592, column: 27, scope: !469, inlinedAt: !471)
!475 = !DILocation(line: 398, column: 3, scope: !476, inlinedAt: !474)
!476 = distinct !DILexicalBlock(scope: !473, file: !166, line: 397, column: 2)
!477 = !DILocation(line: 400, column: 9, scope: !473, inlinedAt: !474)
!478 = !DILocalVariable(name: "mark", scope: !469, file: !29, line: 597, type: !21, align: 8)
!479 = !DILocation(line: 597, column: 6, scope: !469, inlinedAt: !471)
!480 = !DILocation(line: 597, column: 13, scope: !469, inlinedAt: !471)
!481 = !DILocalVariable(name: "result", scope: !482, file: !29, line: 28, type: !483, align: 4)
!482 = distinct !DILexicalBlock(scope: !463, file: !29, line: 24, column: 2)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !29, file: !29, line: 21, baseType: !24, align: 4)
!484 = !DILocation(line: 28, column: 9, scope: !482)
!485 = !DILocation(line: 28, column: 31, scope: !482)
!486 = !DILocation(line: 28, column: 18, scope: !482)
!487 = !DILocation(line: 30, column: 7, scope: !482)
!488 = !DILocation(line: 32, column: 12, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !29, line: 32, column: 4)
!490 = distinct !DILexicalBlock(scope: !482, file: !29, line: 31, column: 3)
!491 = !DILocation(line: 600, column: 17, scope: !492, inlinedAt: !471)
!492 = distinct !DILexicalBlock(scope: !469, file: !136, line: 599, column: 2)
!493 = !DILocation(line: 600, column: 3, scope: !492, inlinedAt: !471)
!494 = !DILocation(line: 603, column: 9, scope: !492, inlinedAt: !471)
!495 = !DILocation(line: 600, column: 17, scope: !496, inlinedAt: !471)
!496 = distinct !DILexicalBlock(scope: !469, file: !136, line: 599, column: 2)
!497 = !DILocation(line: 600, column: 3, scope: !496, inlinedAt: !471)
!498 = !DILocation(line: 603, column: 9, scope: !496, inlinedAt: !471)
!499 = !DILocation(line: 600, column: 17, scope: !500, inlinedAt: !471)
!500 = distinct !DILexicalBlock(scope: !469, file: !136, line: 599, column: 2)
!501 = !DILocation(line: 600, column: 3, scope: !500, inlinedAt: !471)
!502 = !DILocation(line: 603, column: 9, scope: !500, inlinedAt: !471)
!503 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !29, file: !29, line: 48, type: !504, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!504 = !DISubroutineType(types: !505)
!505 = !{!127, !381, !128, !14, !14}
!506 = !DILocalVariable(name: "file", arg: 1, scope: !503, file: !29, line: 48, type: !128)
!507 = !DILocation(line: 48, column: 32, scope: !503)
!508 = !DILocalVariable(name: "filename", arg: 2, scope: !503, file: !29, line: 48, type: !14)
!509 = !DILocation(line: 48, column: 45, scope: !503)
!510 = !DILocalVariable(name: "mode", arg: 3, scope: !503, file: !29, line: 48, type: !14)
!511 = !DILocation(line: 48, column: 62, scope: !503)
!512 = !DILocation(line: 45, column: 11, scope: !513)
!513 = distinct !DILexicalBlock(scope: !503, file: !29, line: 49, column: 1)
!514 = !DILocation(line: 46, column: 11, scope: !513)
!515 = !DILocalVariable(name: "current", scope: !516, file: !29, line: 592, type: !137, align: 8)
!516 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !136, file: !136, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !38)
!517 = !DILocation(line: 592, column: 17, scope: !516, inlinedAt: !518)
!518 = !DILocation(line: 50, column: 2, scope: !503)
!519 = !DILocation(line: 396, column: 6, scope: !520, inlinedAt: !521)
!520 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!521 = !DILocation(line: 592, column: 27, scope: !516, inlinedAt: !518)
!522 = !DILocation(line: 398, column: 3, scope: !523, inlinedAt: !521)
!523 = distinct !DILexicalBlock(scope: !520, file: !166, line: 397, column: 2)
!524 = !DILocation(line: 400, column: 9, scope: !520, inlinedAt: !521)
!525 = !DILocalVariable(name: "mark", scope: !516, file: !29, line: 597, type: !21, align: 8)
!526 = !DILocation(line: 597, column: 6, scope: !516, inlinedAt: !518)
!527 = !DILocation(line: 597, column: 13, scope: !516, inlinedAt: !518)
!528 = !DILocation(line: 55, column: 25, scope: !529)
!529 = distinct !DILexicalBlock(scope: !503, file: !29, line: 51, column: 2)
!530 = !DILocation(line: 55, column: 48, scope: !529)
!531 = !DILocation(line: 55, column: 67, scope: !529)
!532 = !DILocation(line: 55, column: 11, scope: !529)
!533 = !DILocation(line: 57, column: 11, scope: !529)
!534 = !DILocation(line: 90, column: 10, scope: !535, inlinedAt: !537)
!535 = distinct !DILexicalBlock(scope: !536, file: !29, line: 90, column: 2)
!536 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !29, file: !29, line: 88, scopeLine: 88, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!537 = !DILocation(line: 57, column: 19, scope: !529)
!538 = !DILocation(line: 92, column: 30, scope: !539, inlinedAt: !537)
!539 = distinct !DILexicalBlock(scope: !535, file: !29, line: 92, column: 23)
!540 = !DILocation(line: 93, column: 30, scope: !541, inlinedAt: !537)
!541 = distinct !DILexicalBlock(scope: !535, file: !29, line: 93, column: 23)
!542 = !DILocation(line: 94, column: 29, scope: !543, inlinedAt: !537)
!543 = distinct !DILexicalBlock(scope: !535, file: !29, line: 94, column: 22)
!544 = !DILocation(line: 95, column: 30, scope: !545, inlinedAt: !537)
!545 = distinct !DILexicalBlock(scope: !535, file: !29, line: 95, column: 23)
!546 = !DILocation(line: 96, column: 29, scope: !547, inlinedAt: !537)
!547 = distinct !DILexicalBlock(scope: !535, file: !29, line: 96, column: 22)
!548 = !DILocation(line: 97, column: 30, scope: !549, inlinedAt: !537)
!549 = distinct !DILexicalBlock(scope: !535, file: !29, line: 97, column: 23)
!550 = !DILocation(line: 98, column: 30, scope: !551, inlinedAt: !537)
!551 = distinct !DILexicalBlock(scope: !535, file: !29, line: 98, column: 23)
!552 = !DILocation(line: 99, column: 29, scope: !553, inlinedAt: !537)
!553 = distinct !DILexicalBlock(scope: !535, file: !29, line: 99, column: 22)
!554 = !DILocation(line: 100, column: 30, scope: !555, inlinedAt: !537)
!555 = distinct !DILexicalBlock(scope: !535, file: !29, line: 100, column: 23)
!556 = !DILocation(line: 101, column: 36, scope: !557, inlinedAt: !537)
!557 = distinct !DILexicalBlock(scope: !535, file: !29, line: 101, column: 29)
!558 = !DILocation(line: 102, column: 30, scope: !559, inlinedAt: !537)
!559 = distinct !DILexicalBlock(scope: !535, file: !29, line: 102, column: 23)
!560 = !DILocation(line: 103, column: 31, scope: !561, inlinedAt: !537)
!561 = distinct !DILexicalBlock(scope: !535, file: !29, line: 103, column: 24)
!562 = !DILocation(line: 104, column: 30, scope: !563, inlinedAt: !537)
!563 = distinct !DILexicalBlock(scope: !535, file: !29, line: 104, column: 23)
!564 = !DILocation(line: 105, column: 30, scope: !565, inlinedAt: !537)
!565 = distinct !DILexicalBlock(scope: !535, file: !29, line: 105, column: 23)
!566 = !DILocation(line: 106, column: 29, scope: !567, inlinedAt: !537)
!567 = distinct !DILexicalBlock(scope: !535, file: !29, line: 106, column: 22)
!568 = !DILocation(line: 107, column: 33, scope: !569, inlinedAt: !537)
!569 = distinct !DILexicalBlock(scope: !535, file: !29, line: 107, column: 26)
!570 = !DILocation(line: 108, column: 29, scope: !571, inlinedAt: !537)
!571 = distinct !DILexicalBlock(scope: !535, file: !29, line: 108, column: 22)
!572 = !DILocation(line: 109, column: 34, scope: !573, inlinedAt: !537)
!573 = distinct !DILexicalBlock(scope: !535, file: !29, line: 109, column: 27)
!574 = !DILocation(line: 110, column: 27, scope: !575, inlinedAt: !537)
!575 = distinct !DILexicalBlock(scope: !535, file: !29, line: 110, column: 20)
!576 = !DILocation(line: 111, column: 35, scope: !577, inlinedAt: !537)
!577 = distinct !DILexicalBlock(scope: !535, file: !29, line: 111, column: 28)
!578 = !DILocation(line: 112, column: 19, scope: !579, inlinedAt: !537)
!579 = distinct !DILexicalBlock(scope: !535, file: !29, line: 112, column: 12)
!580 = !DILocation(line: 600, column: 17, scope: !581, inlinedAt: !518)
!581 = distinct !DILexicalBlock(scope: !516, file: !136, line: 599, column: 2)
!582 = !DILocation(line: 600, column: 3, scope: !581, inlinedAt: !518)
!583 = !DILocation(line: 603, column: 9, scope: !581, inlinedAt: !518)
!584 = !DILocation(line: 600, column: 17, scope: !585, inlinedAt: !518)
!585 = distinct !DILexicalBlock(scope: !516, file: !136, line: 599, column: 2)
!586 = !DILocation(line: 600, column: 3, scope: !585, inlinedAt: !518)
!587 = !DILocation(line: 603, column: 9, scope: !585, inlinedAt: !518)
!588 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !29, file: !29, line: 61, type: !589, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!589 = !DISubroutineType(types: !590)
!590 = !{!127, !128, !128, !64, !28}
!591 = !DILocalVariable(name: "file", arg: 1, scope: !588, file: !29, line: 61, type: !128)
!592 = !DILocation(line: 61, column: 29, scope: !588)
!593 = !DILocalVariable(name: "offset", arg: 2, scope: !588, file: !29, line: 61, type: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !64)
!595 = !DILocation(line: 61, column: 39, scope: !588)
!596 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !588, file: !29, line: 61, type: !28)
!597 = !DILocation(line: 61, column: 52, scope: !588)
!598 = !DILocation(line: 63, column: 43, scope: !588)
!599 = !DILocation(line: 63, column: 6, scope: !588)
!600 = !DILocation(line: 118, column: 10, scope: !601, inlinedAt: !603)
!601 = distinct !DILexicalBlock(scope: !602, file: !29, line: 118, column: 2)
!602 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !29, file: !29, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!603 = !DILocation(line: 63, column: 70, scope: !588)
!604 = !DILocation(line: 120, column: 30, scope: !605, inlinedAt: !603)
!605 = distinct !DILexicalBlock(scope: !601, file: !29, line: 120, column: 23)
!606 = !DILocation(line: 121, column: 29, scope: !607, inlinedAt: !603)
!607 = distinct !DILexicalBlock(scope: !601, file: !29, line: 121, column: 22)
!608 = !DILocation(line: 122, column: 33, scope: !609, inlinedAt: !603)
!609 = distinct !DILexicalBlock(scope: !601, file: !29, line: 122, column: 26)
!610 = !DILocation(line: 123, column: 29, scope: !611, inlinedAt: !603)
!611 = distinct !DILexicalBlock(scope: !601, file: !29, line: 123, column: 22)
!612 = !DILocation(line: 124, column: 30, scope: !613, inlinedAt: !603)
!613 = distinct !DILexicalBlock(scope: !601, file: !29, line: 124, column: 23)
!614 = !DILocation(line: 125, column: 27, scope: !615, inlinedAt: !603)
!615 = distinct !DILexicalBlock(scope: !601, file: !29, line: 125, column: 20)
!616 = !DILocation(line: 126, column: 30, scope: !617, inlinedAt: !603)
!617 = distinct !DILexicalBlock(scope: !601, file: !29, line: 126, column: 23)
!618 = !DILocation(line: 127, column: 29, scope: !619, inlinedAt: !603)
!619 = distinct !DILexicalBlock(scope: !601, file: !29, line: 127, column: 22)
!620 = !DILocation(line: 128, column: 29, scope: !621, inlinedAt: !603)
!621 = distinct !DILexicalBlock(scope: !601, file: !29, line: 128, column: 22)
!622 = !DILocation(line: 129, column: 29, scope: !623, inlinedAt: !603)
!623 = distinct !DILexicalBlock(scope: !601, file: !29, line: 129, column: 22)
!624 = !DILocation(line: 130, column: 30, scope: !625, inlinedAt: !603)
!625 = distinct !DILexicalBlock(scope: !601, file: !29, line: 130, column: 23)
!626 = !DILocation(line: 131, column: 19, scope: !627, inlinedAt: !603)
!627 = distinct !DILexicalBlock(scope: !601, file: !29, line: 131, column: 12)
!628 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !29, file: !29, line: 67, type: !629, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!629 = !DISubroutineType(types: !630)
!630 = !{!127, !233, !128}
!631 = !DILocalVariable(name: "file", arg: 1, scope: !628, file: !29, line: 67, type: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !29, file: !29, line: 356, baseType: !128, align: 8)
!633 = !DILocation(line: 67, column: 28, scope: !628)
!634 = !DILocalVariable(name: "index", scope: !628, file: !29, line: 69, type: !64, align: 8)
!635 = !DILocation(line: 69, column: 7, scope: !628)
!636 = !DILocation(line: 69, column: 27, scope: !628)
!637 = !DILocation(line: 69, column: 15, scope: !628)
!638 = !DILocation(line: 70, column: 9, scope: !628)
!639 = !DILocation(line: 70, column: 23, scope: !628)
!640 = !DILocation(line: 118, column: 10, scope: !641, inlinedAt: !643)
!641 = distinct !DILexicalBlock(scope: !642, file: !29, line: 118, column: 2)
!642 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !29, file: !29, line: 116, scopeLine: 116, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!643 = !DILocation(line: 70, column: 35, scope: !628)
!644 = !DILocation(line: 120, column: 30, scope: !645, inlinedAt: !643)
!645 = distinct !DILexicalBlock(scope: !641, file: !29, line: 120, column: 23)
!646 = !DILocation(line: 121, column: 29, scope: !647, inlinedAt: !643)
!647 = distinct !DILexicalBlock(scope: !641, file: !29, line: 121, column: 22)
!648 = !DILocation(line: 122, column: 33, scope: !649, inlinedAt: !643)
!649 = distinct !DILexicalBlock(scope: !641, file: !29, line: 122, column: 26)
!650 = !DILocation(line: 123, column: 29, scope: !651, inlinedAt: !643)
!651 = distinct !DILexicalBlock(scope: !641, file: !29, line: 123, column: 22)
!652 = !DILocation(line: 124, column: 30, scope: !653, inlinedAt: !643)
!653 = distinct !DILexicalBlock(scope: !641, file: !29, line: 124, column: 23)
!654 = !DILocation(line: 125, column: 27, scope: !655, inlinedAt: !643)
!655 = distinct !DILexicalBlock(scope: !641, file: !29, line: 125, column: 20)
!656 = !DILocation(line: 126, column: 30, scope: !657, inlinedAt: !643)
!657 = distinct !DILexicalBlock(scope: !641, file: !29, line: 126, column: 23)
!658 = !DILocation(line: 127, column: 29, scope: !659, inlinedAt: !643)
!659 = distinct !DILexicalBlock(scope: !641, file: !29, line: 127, column: 22)
!660 = !DILocation(line: 128, column: 29, scope: !661, inlinedAt: !643)
!661 = distinct !DILexicalBlock(scope: !641, file: !29, line: 128, column: 22)
!662 = !DILocation(line: 129, column: 29, scope: !663, inlinedAt: !643)
!663 = distinct !DILexicalBlock(scope: !641, file: !29, line: 129, column: 22)
!664 = !DILocation(line: 130, column: 30, scope: !665, inlinedAt: !643)
!665 = distinct !DILexicalBlock(scope: !641, file: !29, line: 130, column: 23)
!666 = !DILocation(line: 131, column: 19, scope: !667, inlinedAt: !643)
!667 = distinct !DILexicalBlock(scope: !641, file: !29, line: 131, column: 12)
!668 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !29, file: !29, line: 73, type: !669, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!669 = !DISubroutineType(types: !670)
!670 = !{!127, !233, !128, !15}
!671 = !DILocalVariable(name: "file", arg: 1, scope: !668, file: !29, line: 73, type: !632)
!672 = !DILocation(line: 73, column: 29, scope: !668)
!673 = !DILocalVariable(name: "buffer", arg: 2, scope: !668, file: !29, line: 73, type: !15)
!674 = !DILocation(line: 73, column: 42, scope: !668)
!675 = !DILocation(line: 75, column: 22, scope: !668)
!676 = !DILocation(line: 75, column: 37, scope: !668)
!677 = !DILocation(line: 75, column: 49, scope: !668)
!678 = !DILocation(line: 75, column: 9, scope: !668)
!679 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !29, file: !29, line: 78, type: !680, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!680 = !DISubroutineType(types: !681)
!681 = !{!127, !128, !24, !128}
!682 = !DILocalVariable(name: "c", arg: 1, scope: !679, file: !29, line: 78, type: !483)
!683 = !DILocation(line: 78, column: 28, scope: !679)
!684 = !DILocalVariable(name: "stream", arg: 2, scope: !679, file: !29, line: 78, type: !632)
!685 = !DILocation(line: 78, column: 37, scope: !679)
!686 = !DILocation(line: 80, column: 21, scope: !679)
!687 = !DILocation(line: 80, column: 6, scope: !679)
!688 = !DILocation(line: 80, column: 50, scope: !679)
!689 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !29, file: !29, line: 83, type: !669, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!690 = !DILocalVariable(name: "file", arg: 1, scope: !689, file: !29, line: 83, type: !632)
!691 = !DILocation(line: 83, column: 28, scope: !689)
!692 = !DILocalVariable(name: "buffer", arg: 2, scope: !689, file: !29, line: 83, type: !15)
!693 = !DILocation(line: 83, column: 41, scope: !689)
!694 = !DILocation(line: 85, column: 21, scope: !689)
!695 = !DILocation(line: 85, column: 36, scope: !689)
!696 = !DILocation(line: 85, column: 48, scope: !689)
!697 = !DILocation(line: 85, column: 9, scope: !689)
!698 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !699, file: !699, line: 4, type: !700, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !38)
!699 = !DIFile(filename: "ls.c3", directory: "/opt/homebrew/lib/c3/std/io/os")
!700 = !DISubroutineType(types: !701)
!701 = !{!127, !702, !11, !37, !37, !14, !141}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !703, size: 64, align: 64, dwarfAddressSpace: 0)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !699, file: !699, line: 10, baseType: !704, align: 8)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !699, file: !699, line: 14, size: 320, align: 64, elements: !705, identifier: "std_collections_list$std.io.path.PathImp$.List")
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !704, file: !699, line: 16, baseType: !21, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !704, file: !699, line: 17, baseType: !21, size: 64, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !704, file: !699, line: 18, baseType: !141, size: 128, align: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !704, file: !699, line: 19, baseType: !710, size: 64, align: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !711, size: 64, align: 64, dwarfAddressSpace: 0)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !699, file: !699, line: 10, baseType: !11, align: 8)
!712 = !DILocalVariable(name: "dir", arg: 1, scope: !698, file: !699, line: 4, type: !245)
!713 = !DILocation(line: 4, column: 29, scope: !698)
!714 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !698, file: !699, line: 4, type: !37)
!715 = !DILocation(line: 4, column: 39, scope: !698)
!716 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !698, file: !699, line: 4, type: !37)
!717 = !DILocation(line: 4, column: 53, scope: !698)
!718 = !DILocalVariable(name: "mask", arg: 4, scope: !698, file: !699, line: 4, type: !14)
!719 = !DILocation(line: 4, column: 73, scope: !698)
!720 = !DILocalVariable(name: "allocator", arg: 5, scope: !698, file: !699, line: 4, type: !141)
!721 = !DILocation(line: 4, column: 89, scope: !698)
!722 = !DILocalVariable(name: "list", scope: !698, file: !699, line: 6, type: !703, align: 8)
!723 = !DILocation(line: 6, column: 11, scope: !698)
!724 = !DILocation(line: 7, column: 27, scope: !698)
!725 = !DILocation(line: 7, column: 2, scope: !698)
!726 = !DILocalVariable(name: "directory", scope: !698, file: !699, line: 8, type: !251, align: 8)
!727 = !DILocation(line: 8, column: 9, scope: !698)
!728 = !DILocation(line: 8, column: 36, scope: !698)
!729 = !DILocation(line: 8, column: 53, scope: !698)
!730 = !DILocation(line: 8, column: 70, scope: !698)
!731 = !DILocation(line: 8, column: 21, scope: !698)
!732 = !DILocation(line: 10, column: 6, scope: !698)
!733 = !DILocation(line: 10, column: 26, scope: !698)
!734 = !DILocation(line: 10, column: 72, scope: !698)
!735 = !DILocation(line: 9, column: 12, scope: !736)
!736 = distinct !DILexicalBlock(scope: !698, file: !699, line: 9, column: 8)
!737 = !DILocation(line: 9, column: 39, scope: !736)
!738 = !DILocation(line: 9, column: 23, scope: !736)
!739 = !DILocalVariable(name: "entry", scope: !698, file: !699, line: 11, type: !268, align: 8)
!740 = !DILocation(line: 11, column: 16, scope: !698)
!741 = !DILocation(line: 12, column: 2, scope: !698)
!742 = !DILocation(line: 12, column: 33, scope: !743)
!743 = distinct !DILexicalBlock(scope: !698, file: !699, line: 12, column: 2)
!744 = !DILocation(line: 12, column: 18, scope: !743)
!745 = !DILocalVariable(name: "name", scope: !746, file: !699, line: 14, type: !14, align: 8)
!746 = distinct !DILexicalBlock(scope: !743, file: !699, line: 13, column: 2)
!747 = !DILocation(line: 14, column: 10, scope: !746)
!748 = !DILocation(line: 14, column: 28, scope: !746)
!749 = !DILocation(line: 14, column: 19, scope: !746)
!750 = !DILocation(line: 15, column: 8, scope: !746)
!751 = !DILocation(line: 15, column: 16, scope: !746)
!752 = !DILocation(line: 15, column: 31, scope: !746)
!753 = !DILocation(line: 15, column: 45, scope: !746)
!754 = !DILocation(line: 16, column: 7, scope: !746)
!755 = !DILocation(line: 16, column: 40, scope: !746)
!756 = !DILocation(line: 16, column: 53, scope: !746)
!757 = !DILocation(line: 17, column: 7, scope: !746)
!758 = !DILocation(line: 17, column: 40, scope: !746)
!759 = !DILocation(line: 17, column: 49, scope: !746)
!760 = !DILocalVariable(name: "path", scope: !746, file: !699, line: 18, type: !245, align: 8)
!761 = !DILocation(line: 18, column: 8, scope: !746)
!762 = !DILocation(line: 18, column: 15, scope: !746)
!763 = !DILocation(line: 19, column: 3, scope: !746)
!764 = !DILocation(line: 9, column: 12, scope: !765)
!765 = distinct !DILexicalBlock(scope: !698, file: !699, line: 9, column: 8)
!766 = !DILocation(line: 9, column: 39, scope: !765)
!767 = !DILocation(line: 9, column: 23, scope: !765)
