; ModuleID = 'std::os::darwin'
source_filename = "std::os::darwin"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%Darwin_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

@"$ct.std.os.darwin.Darwin_Dl_info" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 32, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"$ct.std.os.darwin.Darwin_segment_command_64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@std.os.darwin.CTL_UNSPEC = weak local_unnamed_addr constant i32 0, align 4, !dbg !0
@std.os.darwin.CTL_KERN = weak local_unnamed_addr constant i32 1, align 4, !dbg !4
@std.os.darwin.CTL_VM = weak local_unnamed_addr constant i32 2, align 4, !dbg !6
@std.os.darwin.CTL_VFS = weak local_unnamed_addr constant i32 3, align 4, !dbg !8
@std.os.darwin.CTL_NET = weak local_unnamed_addr constant i32 4, align 4, !dbg !10
@std.os.darwin.CTL_DEBUG = weak local_unnamed_addr constant i32 5, align 4, !dbg !12
@std.os.darwin.CTL_HW = weak local_unnamed_addr constant i32 6, align 4, !dbg !14

!33 = distinct !DIGlobalVariable(name: "HW_USERMEM", linkageName: "std.os.darwin.HW_USERMEM", scope: !2, file: !2, line: 20, type: !3, isLocal: false, isDefinition: true, align: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "HW_PAGESIZE", linkageName: "std.os.darwin.HW_PAGESIZE", scope: !2, file: !2, line: 21, type: !3, isLocal: false, isDefinition: true, align: 4)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "HW_DISKNAMES", linkageName: "std.os.darwin.HW_DISKNAMES", scope: !2, file: !2, line: 22, type: !3, isLocal: false, isDefinition: true, align: 4)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "HW_DISKSTATS", linkageName: "std.os.darwin.HW_DISKSTATS", scope: !2, file: !2, line: 23, type: !3, isLocal: false, isDefinition: true, align: 4)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "HW_EPOCH", linkageName: "std.os.darwin.HW_EPOCH", scope: !2, file: !2, line: 24, type: !3, isLocal: false, isDefinition: true, align: 4)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "HW_FLOATINGPT", linkageName: "std.os.darwin.HW_FLOATINGPT", scope: !2, file: !2, line: 25, type: !3, isLocal: false, isDefinition: true, align: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "HW_MACHINE_ARCH", linkageName: "std.os.darwin.HW_MACHINE_ARCH", scope: !2, file: !2, line: 26, type: !3, isLocal: false, isDefinition: true, align: 4)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "HW_VECTORUNIT", linkageName: "std.os.darwin.HW_VECTORUNIT", scope: !2, file: !2, line: 27, type: !3, isLocal: false, isDefinition: true, align: 4)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "HW_BUS_FREQ", linkageName: "std.os.darwin.HW_BUS_FREQ", scope: !2, file: !2, line: 28, type: !3, isLocal: false, isDefinition: true, align: 4)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "HW_CPU_FREQ", linkageName: "std.os.darwin.HW_CPU_FREQ", scope: !2, file: !2, line: 29, type: !3, isLocal: false, isDefinition: true, align: 4)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "HW_CACHELINE", linkageName: "std.os.darwin.HW_CACHELINE", scope: !2, file: !2, line: 30, type: !3, isLocal: false, isDefinition: true, align: 4)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "HW_L1ICACHESIZE", linkageName: "std.os.darwin.HW_L1ICACHESIZE", scope: !2, file: !2, line: 31, type: !3, isLocal: false, isDefinition: true, align: 4)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "HW_L1DCACHESIZE", linkageName: "std.os.darwin.HW_L1DCACHESIZE", scope: !2, file: !2, line: 32, type: !3, isLocal: false, isDefinition: true, align: 4)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "HW_L2SETTINGS", linkageName: "std.os.darwin.HW_L2SETTINGS", scope: !2, file: !2, line: 33, type: !3, isLocal: false, isDefinition: true, align: 4)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "HW_L2CACHESIZE", linkageName: "std.os.darwin.HW_L2CACHESIZE", scope: !2, file: !2, line: 34, type: !3, isLocal: false, isDefinition: true, align: 4)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "HW_L3SETTINGS", linkageName: "std.os.darwin.HW_L3SETTINGS", scope: !2, file: !2, line: 35, type: !3, isLocal: false, isDefinition: true, align: 4)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "HW_L3CACHESIZE", linkageName: "std.os.darwin.HW_L3CACHESIZE", scope: !2, file: !2, line: 36, type: !3, isLocal: false, isDefinition: true, align: 4)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "HW_MAXID", linkageName: "std.os.darwin.HW_MAXID", scope: !2, file: !2, line: 37, type: !3, isLocal: false, isDefinition: true, align: 4)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 2, !"wchar_size", i32 4}
!71 = !{i32 4, !"PIC Level", i32 2}
!72 = !{i32 1, !"uwtable", i32 1}
!73 = !{i32 2, !"frame-pointer", i32 1}
!74 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !75, splitDebugInlining: false)
!75 = !{!0, !4, !6, !8, !10, !12, !14, !16, !18, !20, !22, !24, !26, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !48, !50, !52, !54, !56, !58, !60, !62, !64, !66}
!76 = distinct !DISubprogram(name: "executable_path", linkageName: "std.os.darwin.executable_path", scope: !2, file: !2, line: 71, type: !77, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !97)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !81, !91}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !80)
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !84, identifier: "char[]")
!84 = !{!85, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !83, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !90)
!90 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !92, identifier: "Allocator")
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!97 = !{}
!98 = !DILocalVariable(name: "allocator", arg: 1, scope: !76, file: !2, line: 71, type: !91)
!99 = !DILocation(line: 71, column: 38, scope: !76)
!100 = !DILocalVariable(name: "path", scope: !76, file: !2, line: 73, type: !101, align: 1)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32768, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 4096, lowerBound: 0)
!104 = !DILocation(line: 73, column: 13, scope: !76)
!105 = !DILocalVariable(name: "len", scope: !76, file: !2, line: 74, type: !106, align: 4)
!106 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!107 = !DILocation(line: 74, column: 7, scope: !76)
!108 = !DILocation(line: 74, column: 13, scope: !76)
!109 = !DILocation(line: 75, column: 6, scope: !76)
!110 = !DILocation(line: 75, column: 58, scope: !76)
!111 = !DILocation(line: 76, column: 31, scope: !76)
!112 = !DILocation(line: 76, column: 11, scope: !76)
!113 = distinct !DISubprogram(name: "load_address", linkageName: "std.os.darwin.load_address", scope: !2, file: !2, line: 79, type: !114, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74, retainedNodes: !97)
!114 = !DISubroutineType(types: !115)
!115 = !{!79, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "uptr*", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !90)
!118 = !DILocalVariable(name: "cmd", scope: !113, file: !2, line: 81, type: !119, align: 8)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Darwin_segment_command_64*", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_segment_command_64", scope: !2, file: !2, line: 55, size: 576, align: 64, elements: !121, identifier: "std.os.darwin.Darwin_segment_command_64")
!121 = !{!122, !123, !124, !128, !129, !130, !131, !132, !133, !134, !135}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !120, file: !2, line: 57, baseType: !106, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !120, file: !2, line: 58, baseType: !106, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !120, file: !2, line: 59, baseType: !125, size: 128, align: 8, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 16, lowerBound: 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !120, file: !2, line: 60, baseType: !90, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !120, file: !2, line: 61, baseType: !90, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !120, file: !2, line: 62, baseType: !90, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !120, file: !2, line: 63, baseType: !90, size: 64, align: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !120, file: !2, line: 64, baseType: !3, size: 32, align: 32, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !120, file: !2, line: 65, baseType: !3, size: 32, align: 32, offset: 480)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !120, file: !2, line: 66, baseType: !106, size: 32, align: 32, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !2, line: 67, baseType: !106, size: 32, align: 32, offset: 544)
!136 = !DILocation(line: 81, column: 29, scope: !113)
!137 = !DILocation(line: 81, column: 35, scope: !113)
!138 = !DILocation(line: 82, column: 6, scope: !113)
!139 = !DILocation(line: 82, column: 19, scope: !113)
!140 = !DILocalVariable(name: "path", scope: !113, file: !2, line: 83, type: !82, align: 8)
!141 = !DILocation(line: 83, column: 9, scope: !113)
!142 = !DILocation(line: 396, column: 6, scope: !143, inlinedAt: !145)
!143 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !144, file: !144, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!144 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!145 = !DILocation(line: 83, column: 41, scope: !113)
!146 = !DILocation(line: 398, column: 3, scope: !147, inlinedAt: !145)
!147 = distinct !DILexicalBlock(scope: !143, file: !144, line: 397, column: 2)
!148 = !DILocation(line: 400, column: 9, scope: !143, inlinedAt: !145)
!149 = !DILocation(line: 83, column: 16, scope: !113)
!150 = !DILocation(line: 83, column: 63, scope: !113)
!151 = !DILocalVariable(name: "dyld_count", scope: !113, file: !2, line: 84, type: !106, align: 4)
!152 = !DILocation(line: 84, column: 7, scope: !113)
!153 = !DILocation(line: 84, column: 20, scope: !113)
!154 = !DILocalVariable(name: "i", scope: !155, file: !2, line: 85, type: !106, align: 4)
!155 = distinct !DILexicalBlock(scope: !113, file: !2, line: 85, column: 2)
!156 = !DILocation(line: 85, column: 12, scope: !155)
!157 = !DILocation(line: 85, column: 16, scope: !155)
!158 = !DILocation(line: 85, column: 19, scope: !155)
!159 = !DILocation(line: 85, column: 23, scope: !155)
!160 = !DILocalVariable(name: "image_name", scope: !161, file: !2, line: 87, type: !162, align: 8)
!161 = distinct !DILexicalBlock(scope: !155, file: !2, line: 86, column: 2)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !86, align: 8)
!163 = !DILocation(line: 87, column: 11, scope: !161)
!164 = !DILocation(line: 87, column: 53, scope: !161)
!165 = !DILocation(line: 87, column: 24, scope: !161)
!166 = !DILocation(line: 88, column: 7, scope: !161)
!167 = !DILocation(line: 88, column: 20, scope: !161)
!168 = !DILocation(line: 89, column: 7, scope: !161)
!169 = !DILocation(line: 89, column: 32, scope: !161)
!170 = !DILocation(line: 89, column: 38, scope: !161)
!171 = !DILocation(line: 90, column: 10, scope: !161)
!172 = !DILocation(line: 90, column: 60, scope: !161)
!173 = !DILocation(line: 90, column: 23, scope: !161)
!174 = !DILocation(line: 85, column: 35, scope: !155)
!175 = !DILocation(line: 92, column: 9, scope: !113)
!176 = distinct !DISubprogram(name: "backtrace_load_element", linkageName: "std.os.darwin.backtrace_load_element", scope: !2, file: !2, line: 96, type: !177, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74, retainedNodes: !97)
!177 = !DISubroutineType(types: !178)
!178 = !{!79, !179, !82, !94, !94, !91}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !181, identifier: "std.os.backtrace.Backtrace")
!181 = !{!182, !183, !184, !185, !186, !187, !188}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !180, file: !2, line: 17, baseType: !117, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !180, file: !2, line: 18, baseType: !82, size: 128, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !180, file: !2, line: 19, baseType: !82, size: 128, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !180, file: !2, line: 20, baseType: !82, size: 128, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !180, file: !2, line: 21, baseType: !106, size: 32, align: 32, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !180, file: !2, line: 22, baseType: !91, size: 128, align: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !180, file: !2, line: 23, baseType: !189, size: 8, align: 8, offset: 640)
!189 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!190 = !DILocalVariable(name: "execpath", arg: 1, scope: !176, file: !2, line: 96, type: !82)
!191 = !DILocation(line: 96, column: 45, scope: !176)
!192 = !DILocalVariable(name: "buffer", arg: 2, scope: !176, file: !2, line: 96, type: !94)
!193 = !DILocation(line: 96, column: 61, scope: !176)
!194 = !DILocalVariable(name: "load_address", arg: 3, scope: !176, file: !2, line: 96, type: !94)
!195 = !DILocation(line: 96, column: 75, scope: !176)
!196 = !DILocalVariable(name: "allocator", arg: 4, scope: !176, file: !2, line: 96, type: !91)
!197 = !DILocation(line: 96, column: 99, scope: !176)
!198 = !DILocalVariable(name: "current", scope: !199, file: !2, line: 592, type: !201, align: 8)
!199 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !200, file: !200, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74, retainedNodes: !97)
!200 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !203, identifier: "std.core.mem.allocator.TempAllocator")
!203 = !{!204, !205, !218, !219, !220}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !202, file: !2, line: 12, baseType: !91, size: 128, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !202, file: !2, line: 13, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !208, identifier: "std.core.mem.allocator.TempAllocatorPage")
!208 = !{!209, !210, !211, !212, !213, !214}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !207, file: !2, line: 24, baseType: !206, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !207, file: !2, line: 25, baseType: !94, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !207, file: !2, line: 26, baseType: !89, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !207, file: !2, line: 27, baseType: !89, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !207, file: !2, line: 28, baseType: !89, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !2, line: 29, baseType: !215, align: 8, offset: 320)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, align: 8, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 0, lowerBound: 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !202, file: !2, line: 14, baseType: !89, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !202, file: !2, line: 15, baseType: !89, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !2, line: 16, baseType: !215, align: 8, offset: 320)
!221 = !DILocation(line: 592, column: 17, scope: !199, inlinedAt: !222)
!222 = !DILocation(line: 98, column: 2, scope: !176)
!223 = !DILocation(line: 396, column: 6, scope: !224, inlinedAt: !225)
!224 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !144, file: !144, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!225 = !DILocation(line: 592, column: 27, scope: !199, inlinedAt: !222)
!226 = !DILocation(line: 398, column: 3, scope: !227, inlinedAt: !225)
!227 = distinct !DILexicalBlock(scope: !224, file: !144, line: 397, column: 2)
!228 = !DILocation(line: 400, column: 9, scope: !224, inlinedAt: !225)
!229 = !DILocalVariable(name: "original", scope: !199, file: !2, line: 594, type: !201, align: 8)
!230 = !DILocation(line: 594, column: 18, scope: !199, inlinedAt: !222)
!231 = !DILocation(line: 594, column: 29, scope: !199, inlinedAt: !222)
!232 = !DILocation(line: 595, column: 7, scope: !199, inlinedAt: !222)
!233 = !DILocation(line: 595, column: 18, scope: !199, inlinedAt: !222)
!234 = !DILocation(line: 595, column: 45, scope: !199, inlinedAt: !222)
!235 = !DILocalVariable(name: "mark", scope: !199, file: !2, line: 597, type: !89, align: 8)
!236 = !DILocation(line: 597, column: 6, scope: !199, inlinedAt: !222)
!237 = !DILocation(line: 597, column: 13, scope: !199, inlinedAt: !222)
!238 = !DILocation(line: 100, column: 7, scope: !239)
!239 = distinct !DILexicalBlock(scope: !176, file: !2, line: 99, column: 2)
!240 = !DILocalVariable(name: "buf", scope: !241, file: !2, line: 102, type: !86, align: 8)
!241 = distinct !DILexicalBlock(scope: !239, file: !2, line: 101, column: 3)
!242 = !DILocation(line: 102, column: 10, scope: !241)
!243 = !DILocation(line: 102, column: 16, scope: !241)
!244 = !DILocalVariable(name: "s", scope: !241, file: !2, line: 103, type: !82, align: 8)
!245 = !DILocation(line: 103, column: 11, scope: !241)
!246 = !DILocation(line: 103, column: 49, scope: !241)
!247 = !DILocation(line: 104, column: 7, scope: !241)
!248 = !DILocation(line: 104, column: 15, scope: !241)
!249 = !DILocation(line: 104, column: 21, scope: !241)
!250 = !DILocation(line: 104, column: 31, scope: !241)
!251 = !DILocation(line: 104, column: 40, scope: !241)
!252 = !DILocation(line: 104, column: 75, scope: !241)
!253 = !DILocation(line: 105, column: 27, scope: !241)
!254 = !DILocation(line: 105, column: 5, scope: !241)
!255 = !DILocation(line: 106, column: 27, scope: !241)
!256 = !DILocation(line: 106, column: 36, scope: !241)
!257 = !DILocation(line: 106, column: 5, scope: !241)
!258 = !DILocation(line: 107, column: 6, scope: !241)
!259 = !DILocation(line: 103, column: 15, scope: !241)
!260 = !DILocation(line: 600, column: 17, scope: !261, inlinedAt: !222)
!261 = distinct !DILexicalBlock(scope: !199, file: !200, line: 599, column: 2)
!262 = !DILocation(line: 600, column: 3, scope: !261, inlinedAt: !222)
!263 = !DILocation(line: 602, column: 39, scope: !261, inlinedAt: !222)
!264 = !DILocation(line: 603, column: 9, scope: !261, inlinedAt: !222)
!265 = !DILocalVariable(name: "parts", scope: !241, file: !2, line: 108, type: !266, align: 8)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !267, identifier: "String[]")
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !266, baseType: !81, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !266, baseType: !89, size: 64, align: 64, offset: 64)
!270 = !DILocation(line: 108, column: 13, scope: !241)
!271 = !DILocation(line: 312, column: 76, scope: !272, inlinedAt: !274)
!272 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !273, file: !273, line: 312, scopeLine: 312, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!273 = !DIFile(filename: "string.c3", directory: "/opt/homebrew/lib/c3/std/core")
!274 = !DILocation(line: 108, column: 21, scope: !241)
!275 = !DILocation(line: 109, column: 8, scope: !241)
!276 = !DILocalVariable(name: "path_parts", scope: !277, file: !2, line: 111, type: !266, align: 8)
!277 = distinct !DILexicalBlock(scope: !241, file: !2, line: 110, column: 4)
!278 = !DILocation(line: 111, column: 14, scope: !277)
!279 = !DILocation(line: 111, column: 27, scope: !277)
!280 = !DILocation(line: 111, column: 33, scope: !277)
!281 = !DILocation(line: 312, column: 76, scope: !282, inlinedAt: !279)
!282 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !273, file: !273, line: 312, scopeLine: 312, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!283 = !DILocation(line: 113, column: 17, scope: !277)
!284 = !DILocation(line: 114, column: 18, scope: !277)
!285 = !DILocation(line: 114, column: 24, scope: !277)
!286 = !DILocation(line: 114, column: 32, scope: !277)
!287 = !DILocation(line: 115, column: 21, scope: !277)
!288 = !DILocation(line: 115, column: 27, scope: !277)
!289 = !DILocation(line: 115, column: 30, scope: !277)
!290 = !DILocation(line: 115, column: 33, scope: !277)
!291 = !DILocation(line: 116, column: 14, scope: !277)
!292 = !DILocation(line: 116, column: 25, scope: !277)
!293 = !DILocation(line: 116, column: 28, scope: !277)
!294 = !DILocation(line: 117, column: 14, scope: !277)
!295 = !DILocation(line: 117, column: 25, scope: !277)
!296 = !DILocation(line: 117, column: 28, scope: !277)
!297 = !DILocation(line: 117, column: 31, scope: !277)
!298 = !DILocation(line: 600, column: 17, scope: !299, inlinedAt: !222)
!299 = distinct !DILexicalBlock(scope: !199, file: !200, line: 599, column: 2)
!300 = !DILocation(line: 600, column: 3, scope: !299, inlinedAt: !222)
!301 = !DILocation(line: 602, column: 39, scope: !299, inlinedAt: !222)
!302 = !DILocation(line: 603, column: 9, scope: !299, inlinedAt: !222)
!303 = !DILocation(line: 118, column: 19, scope: !277)
!304 = !DILocation(line: 600, column: 17, scope: !305, inlinedAt: !222)
!305 = distinct !DILexicalBlock(scope: !199, file: !200, line: 599, column: 2)
!306 = !DILocation(line: 600, column: 3, scope: !305, inlinedAt: !222)
!307 = !DILocation(line: 602, column: 39, scope: !305, inlinedAt: !222)
!308 = !DILocation(line: 603, column: 9, scope: !305, inlinedAt: !222)
!309 = !DILocalVariable(name: "info", scope: !239, file: !2, line: 122, type: !310, align: 8)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "Darwin_Dl_info", scope: !2, file: !2, line: 47, size: 256, align: 64, elements: !311, identifier: "std.os.darwin.Darwin_Dl_info")
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !310, file: !2, line: 49, baseType: !162, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !310, file: !2, line: 50, baseType: !94, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !310, file: !2, line: 51, baseType: !162, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !310, file: !2, line: 52, baseType: !94, size: 64, align: 64, offset: 192)
!316 = !DILocation(line: 122, column: 18, scope: !239)
!317 = !DILocation(line: 123, column: 7, scope: !239)
!318 = !DILocation(line: 123, column: 43, scope: !239)
!319 = !DILocation(line: 123, column: 18, scope: !239)
!320 = !DILocation(line: 600, column: 17, scope: !321, inlinedAt: !222)
!321 = distinct !DILexicalBlock(scope: !199, file: !200, line: 599, column: 2)
!322 = !DILocation(line: 600, column: 3, scope: !321, inlinedAt: !222)
!323 = !DILocation(line: 602, column: 39, scope: !321, inlinedAt: !222)
!324 = !DILocation(line: 603, column: 9, scope: !321, inlinedAt: !222)
!325 = !DILocation(line: 125, column: 15, scope: !239)
!326 = !DILocation(line: 126, column: 16, scope: !239)
!327 = !DILocation(line: 126, column: 33, scope: !239)
!328 = !DILocation(line: 126, column: 53, scope: !239)
!329 = !DILocation(line: 126, column: 66, scope: !239)
!330 = !DILocation(line: 127, column: 39, scope: !239)
!331 = !DILocation(line: 127, column: 19, scope: !239)
!332 = !DILocation(line: 128, column: 12, scope: !239)
!333 = !DILocation(line: 129, column: 12, scope: !239)
!334 = !DILocation(line: 130, column: 17, scope: !239)
!335 = !DILocation(line: 600, column: 17, scope: !336, inlinedAt: !222)
!336 = distinct !DILexicalBlock(scope: !199, file: !200, line: 599, column: 2)
!337 = !DILocation(line: 600, column: 3, scope: !336, inlinedAt: !222)
!338 = !DILocation(line: 602, column: 39, scope: !336, inlinedAt: !222)
!339 = !DILocation(line: 603, column: 9, scope: !336, inlinedAt: !222)
!340 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.darwin.symbolize_backtrace", scope: !2, file: !2, line: 135, type: !341, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !97)
!341 = !DISubroutineType(types: !342)
!342 = !{!79, !343, !353, !91}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BacktraceList*", baseType: !344, size: 64, align: 64, dwarfAddressSpace: 0)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 94, baseType: !345, align: 8)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !346, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !2, line: 16, baseType: !89, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !345, file: !2, line: 17, baseType: !89, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !345, file: !2, line: 18, baseType: !91, size: 128, align: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !345, file: !2, line: 19, baseType: !351, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !352, size: 64, align: 64, dwarfAddressSpace: 0)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !180, align: 8)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !354, identifier: "void*[]")
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !353, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !353, baseType: !89, size: 64, align: 64, offset: 64)
!358 = !DILocalVariable(name: "backtrace", arg: 1, scope: !340, file: !2, line: 135, type: !353)
!359 = !DILocation(line: 135, column: 47, scope: !340)
!360 = !DILocalVariable(name: "allocator", arg: 2, scope: !340, file: !2, line: 135, type: !91)
!361 = !DILocation(line: 135, column: 68, scope: !340)
!362 = !DILocalVariable(name: "load_addr", scope: !340, file: !2, line: 137, type: !94, align: 8)
!363 = !DILocation(line: 137, column: 8, scope: !340)
!364 = !DILocation(line: 137, column: 28, scope: !340)
!365 = !DILocalVariable(name: "list", scope: !340, file: !2, line: 138, type: !344, align: 8)
!366 = !DILocation(line: 138, column: 16, scope: !340)
!367 = !DILocation(line: 139, column: 16, scope: !340)
!368 = !DILocation(line: 139, column: 31, scope: !340)
!369 = !DILocation(line: 139, column: 2, scope: !340)
!370 = !DILocalVariable(name: "current", scope: !371, file: !2, line: 592, type: !201, align: 8)
!371 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !200, file: !200, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74, retainedNodes: !97)
!372 = !DILocation(line: 592, column: 17, scope: !371, inlinedAt: !373)
!373 = !DILocation(line: 148, column: 2, scope: !340)
!374 = !DILocation(line: 396, column: 6, scope: !375, inlinedAt: !376)
!375 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !144, file: !144, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!376 = !DILocation(line: 592, column: 27, scope: !371, inlinedAt: !373)
!377 = !DILocation(line: 398, column: 3, scope: !378, inlinedAt: !376)
!378 = distinct !DILexicalBlock(scope: !375, file: !144, line: 397, column: 2)
!379 = !DILocation(line: 400, column: 9, scope: !375, inlinedAt: !376)
!380 = !DILocalVariable(name: "original", scope: !371, file: !2, line: 594, type: !201, align: 8)
!381 = !DILocation(line: 594, column: 18, scope: !371, inlinedAt: !373)
!382 = !DILocation(line: 594, column: 29, scope: !371, inlinedAt: !373)
!383 = !DILocation(line: 595, column: 7, scope: !371, inlinedAt: !373)
!384 = !DILocation(line: 595, column: 18, scope: !371, inlinedAt: !373)
!385 = !DILocation(line: 595, column: 45, scope: !371, inlinedAt: !373)
!386 = !DILocalVariable(name: "mark", scope: !371, file: !2, line: 597, type: !89, align: 8)
!387 = !DILocation(line: 597, column: 6, scope: !371, inlinedAt: !373)
!388 = !DILocation(line: 597, column: 13, scope: !371, inlinedAt: !373)
!389 = !DILocalVariable(name: "execpath", scope: !390, file: !2, line: 150, type: !82, align: 8)
!390 = distinct !DILexicalBlock(scope: !340, file: !2, line: 149, column: 2)
!391 = !DILocation(line: 150, column: 10, scope: !390)
!392 = !DILocation(line: 396, column: 6, scope: !393, inlinedAt: !394)
!393 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !144, file: !144, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !74)
!394 = !DILocation(line: 150, column: 37, scope: !390)
!395 = !DILocation(line: 398, column: 3, scope: !396, inlinedAt: !394)
!396 = distinct !DILexicalBlock(scope: !393, file: !144, line: 397, column: 2)
!397 = !DILocation(line: 400, column: 9, scope: !393, inlinedAt: !394)
!398 = !DILocation(line: 150, column: 21, scope: !390)
!399 = !DILocation(line: 600, column: 17, scope: !400, inlinedAt: !373)
!400 = distinct !DILexicalBlock(scope: !371, file: !200, line: 599, column: 2)
!401 = !DILocation(line: 600, column: 3, scope: !400, inlinedAt: !373)
!402 = !DILocation(line: 602, column: 39, scope: !400, inlinedAt: !373)
!403 = !DILocation(line: 142, column: 20, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !2, line: 142, column: 3)
!405 = distinct !DILexicalBlock(scope: !340, file: !2, line: 141, column: 2)
!406 = !DILocalVariable(name: ".temp", scope: !404, file: !2, line: 142, type: !89, align: 8)
