; ModuleID = 'std::core::machoruntime'
source_filename = "std::core::machoruntime"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"DynamicMethod[]" = type { ptr, i64 }
%"Callback[]" = type { ptr, i64 }

@"$ct.std.core.machoruntime.SegmentCommand64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 72, i64 0, i64 11, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.LoadCommand" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 8, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.Section64" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 80, i64 0, i64 12, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 28, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.machoruntime.MachHeader64" = linkonce global %.introspect { i8 10, i64 ptrtoint (ptr @"$ct.std.core.machoruntime.MachHeader" to i64), ptr null, i64 32, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"std.core.machoruntime.MachoSearch$NOT_FOUND" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.machoruntime.MachoSearch" to i64), %"char[]" { ptr @.fault, i64 9 }, i64 1 }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LC_SEGMENT_64", linkageName: "std.core.machoruntime.LC_SEGMENT_64", scope: !2, file: !2, line: 57, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "macho_runtime.c3", directory: "/opt/homebrew/lib/c3/std/core/private")
!3 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "runtime_state", linkageName: "std.core.machoruntime.runtime_state", scope: !2, file: !2, line: 158, type: !6, isLocal: true, isDefinition: true, align: 4)
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "StartupState", scope: !2, file: !2, line: 147, baseType: !7, size: 32, align: 32, elements: !8)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "NOT_STARTED", value: 0)
!10 = !DIEnumerator(name: "INIT", value: 1)
!11 = !DIEnumerator(name: "RUN_CTORS", value: 2)
!12 = !DIEnumerator(name: "READ_DYLIB", value: 3)
!13 = !DIEnumerator(name: "RUN_DYLIB_CTORS", value: 4)
!14 = !DIEnumerator(name: "RUN_DTORS", value: 5)
!15 = !DIEnumerator(name: "SHUTDOWN", value: 6)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "ctor_first", linkageName: "std.core.machoruntime.ctor_first", scope: !2, file: !2, line: 160, type: !18, isLocal: true, isDefinition: true, align: 8)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Callback*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Callback", scope: !2, file: !2, line: 130, size: 192, align: 64, elements: !20, identifier: "std.core.machoruntime.Callback")
!20 = !{!21, !23, !28}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !19, file: !2, line: 132, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "xtor", scope: !19, file: !2, line: 133, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallbackFn", scope: !2, file: !2, line: 129, baseType: !25, align: 8)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CallbackFn", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DISubroutineType(types: !27)
!27 = !{null}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !2, line: 134, baseType: !18, size: 64, align: 64, offset: 128)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dtor_first", linkageName: "std.core.machoruntime.dtor_first", scope: !2, file: !2, line: 161, type: !18, isLocal: true, isDefinition: true, align: 8)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 2, !"wchar_size", i32 4}
!34 = !{i32 4, !"PIC Level", i32 2}
!35 = !{i32 1, !"uwtable", i32 1}
!36 = !{i32 2, !"frame-pointer", i32 1}
!37 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, globals: !39, splitDebugInlining: false)
!38 = !{!6}
!39 = !{!0, !4, !16, !29}
!40 = distinct !DISubprogram(name: "name_cmp", linkageName: "std.core.machoruntime.name_cmp", scope: !2, file: !2, line: 63, type: !41, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45}
!43 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[16]*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 128, align: 8, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 16, lowerBound: 0)
!49 = !{}
!50 = !DILocalVariable(name: "a", arg: 1, scope: !40, file: !2, line: 63, type: !44)
!51 = !DILocation(line: 63, column: 24, scope: !40)
!52 = !DILocalVariable(name: "b", arg: 2, scope: !40, file: !2, line: 63, type: !45)
!53 = !DILocation(line: 63, column: 37, scope: !40)
!54 = !DILocalVariable(name: "i", scope: !55, file: !2, line: 65, type: !56, align: 8)
!55 = distinct !DILexicalBlock(scope: !40, file: !2, line: 65, column: 2)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !57)
!57 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!58 = !DILocation(line: 65, column: 11, scope: !55)
!59 = !DILocation(line: 65, column: 15, scope: !55)
!60 = !DILocation(line: 65, column: 18, scope: !55)
!61 = !DILocation(line: 67, column: 7, scope: !62)
!62 = distinct !DILexicalBlock(scope: !55, file: !2, line: 66, column: 2)
!63 = !DILocation(line: 67, column: 9, scope: !62)
!64 = !DILocation(line: 67, column: 17, scope: !62)
!65 = !DILocation(line: 67, column: 20, scope: !62)
!66 = !DILocation(line: 67, column: 31, scope: !62)
!67 = !DILocation(line: 68, column: 7, scope: !62)
!68 = !DILocation(line: 68, column: 9, scope: !62)
!69 = !DILocation(line: 68, column: 28, scope: !62)
!70 = !DILocation(line: 65, column: 26, scope: !55)
!71 = !DILocation(line: 70, column: 9, scope: !40)
!72 = distinct !DISubprogram(name: "find_segment", linkageName: "std.core.machoruntime.find_segment", scope: !2, file: !2, line: 73, type: !73, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !77, !92, !44}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !76)
!76 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SegmentCommand64**", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SegmentCommand64*", baseType: !79, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "SegmentCommand64", scope: !2, file: !2, line: 3, size: 576, align: 64, elements: !80, identifier: "std.core.machoruntime.SegmentCommand64")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !79, file: !2, line: 5, baseType: !22, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !79, file: !2, line: 6, baseType: !22, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !79, file: !2, line: 7, baseType: !46, size: 128, align: 8, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "vmaddr", scope: !79, file: !2, line: 8, baseType: !57, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vmsize", scope: !79, file: !2, line: 9, baseType: !57, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fileoff", scope: !79, file: !2, line: 10, baseType: !57, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !79, file: !2, line: 11, baseType: !57, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "maxprot", scope: !79, file: !2, line: 12, baseType: !22, size: 32, align: 32, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "initprot", scope: !79, file: !2, line: 13, baseType: !22, size: 32, align: 32, offset: 480)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nsects", scope: !79, file: !2, line: 14, baseType: !22, size: 32, align: 32, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !2, line: 15, baseType: !22, size: 32, align: 32, offset: 544)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "MachHeader*", baseType: !93, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "MachHeader", scope: !2, file: !2, line: 40, size: 224, align: 32, elements: !94, identifier: "std.core.machoruntime.MachHeader")
!94 = !{!95, !96, !97, !98, !99, !100, !101}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !93, file: !2, line: 42, baseType: !22, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cputype", scope: !93, file: !2, line: 43, baseType: !22, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cpusubtype", scope: !93, file: !2, line: 44, baseType: !22, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !93, file: !2, line: 45, baseType: !22, size: 32, align: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ncmds", scope: !93, file: !2, line: 46, baseType: !22, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofcmds", scope: !93, file: !2, line: 47, baseType: !22, size: 32, align: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !2, line: 48, baseType: !22, size: 32, align: 32, offset: 192)
!102 = !DILocalVariable(name: "header", arg: 1, scope: !72, file: !2, line: 73, type: !92)
!103 = !DILocation(line: 73, column: 48, scope: !72)
!104 = !DILocalVariable(name: "segname", arg: 2, scope: !72, file: !2, line: 73, type: !44)
!105 = !DILocation(line: 73, column: 62, scope: !72)
!106 = !DILocalVariable(name: "command", scope: !72, file: !2, line: 75, type: !107, align: 8)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "LoadCommand*", baseType: !108, size: 64, align: 64, dwarfAddressSpace: 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "LoadCommand", scope: !2, file: !2, line: 18, size: 64, align: 32, elements: !109, identifier: "std.core.machoruntime.LoadCommand")
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !108, file: !2, line: 20, baseType: !22, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cmdsize", scope: !108, file: !2, line: 21, baseType: !22, size: 32, align: 32, offset: 32)
!112 = !DILocation(line: 75, column: 15, scope: !72)
!113 = !DILocation(line: 75, column: 32, scope: !72)
!114 = !DILocation(line: 75, column: 41, scope: !72)
!115 = !DILocalVariable(name: "i", scope: !116, file: !2, line: 76, type: !22, align: 4)
!116 = distinct !DILexicalBlock(scope: !72, file: !2, line: 76, column: 2)
!117 = !DILocation(line: 76, column: 12, scope: !116)
!118 = !DILocation(line: 76, column: 16, scope: !116)
!119 = !DILocation(line: 76, column: 19, scope: !116)
!120 = !DILocation(line: 76, column: 23, scope: !116)
!121 = !DILocation(line: 78, column: 7, scope: !122)
!122 = distinct !DILexicalBlock(scope: !116, file: !2, line: 77, column: 2)
!123 = !DILocalVariable(name: "segment", scope: !124, file: !2, line: 80, type: !78, align: 8)
!124 = distinct !DILexicalBlock(scope: !122, file: !2, line: 79, column: 3)
!125 = !DILocation(line: 80, column: 22, scope: !124)
!126 = !DILocation(line: 80, column: 51, scope: !124)
!127 = !DILocation(line: 81, column: 27, scope: !124)
!128 = !DILocation(line: 81, column: 8, scope: !124)
!129 = !DILocation(line: 81, column: 52, scope: !124)
!130 = !DILocation(line: 83, column: 20, scope: !122)
!131 = !DILocation(line: 83, column: 30, scope: !122)
!132 = !DILocation(line: 76, column: 37, scope: !116)
!133 = !DILocation(line: 85, column: 9, scope: !72)
!134 = distinct !DISubprogram(name: "find_section", linkageName: "std.core.machoruntime.find_section", scope: !2, file: !2, line: 87, type: !135, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!135 = !DISubroutineType(types: !136)
!136 = !{!75, !137, !78, !44}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Section64**", baseType: !138, size: 64, align: 64, dwarfAddressSpace: 0)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Section64*", baseType: !139, size: 64, align: 64, dwarfAddressSpace: 0)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Section64", scope: !2, file: !2, line: 24, size: 640, align: 64, elements: !140, identifier: "std.core.machoruntime.Section64")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sectname", scope: !139, file: !2, line: 26, baseType: !46, size: 128, align: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "segname", scope: !139, file: !2, line: 27, baseType: !46, size: 128, align: 8, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !139, file: !2, line: 28, baseType: !57, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !2, line: 29, baseType: !57, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !139, file: !2, line: 30, baseType: !22, size: 32, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !139, file: !2, line: 31, baseType: !22, size: 32, align: 32, offset: 416)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reloff", scope: !139, file: !2, line: 32, baseType: !22, size: 32, align: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nreloc", scope: !139, file: !2, line: 33, baseType: !22, size: 32, align: 32, offset: 480)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !139, file: !2, line: 34, baseType: !22, size: 32, align: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !139, file: !2, line: 35, baseType: !22, size: 32, align: 32, offset: 544)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !139, file: !2, line: 36, baseType: !22, size: 32, align: 32, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !139, file: !2, line: 37, baseType: !22, size: 32, align: 32, offset: 608)
!153 = !DILocalVariable(name: "command", arg: 1, scope: !134, file: !2, line: 87, type: !78)
!154 = !DILocation(line: 87, column: 47, scope: !134)
!155 = !DILocalVariable(name: "sectname", arg: 2, scope: !134, file: !2, line: 87, type: !44)
!156 = !DILocation(line: 87, column: 62, scope: !134)
!157 = !DILocalVariable(name: "section", scope: !134, file: !2, line: 89, type: !138, align: 8)
!158 = !DILocation(line: 89, column: 13, scope: !134)
!159 = !DILocation(line: 89, column: 30, scope: !134)
!160 = !DILocation(line: 89, column: 40, scope: !134)
!161 = !DILocalVariable(name: "i", scope: !162, file: !2, line: 90, type: !22, align: 4)
!162 = distinct !DILexicalBlock(scope: !134, file: !2, line: 90, column: 2)
!163 = !DILocation(line: 90, column: 12, scope: !162)
!164 = !DILocation(line: 90, column: 16, scope: !162)
!165 = !DILocation(line: 90, column: 19, scope: !162)
!166 = !DILocation(line: 90, column: 23, scope: !162)
!167 = !DILocation(line: 92, column: 27, scope: !168)
!168 = distinct !DILexicalBlock(scope: !162, file: !2, line: 91, column: 2)
!169 = !DILocation(line: 92, column: 7, scope: !168)
!170 = !DILocation(line: 92, column: 53, scope: !168)
!171 = !DILocation(line: 93, column: 3, scope: !168)
!172 = !DILocation(line: 90, column: 39, scope: !162)
!173 = !DILocation(line: 95, column: 9, scope: !134)
!174 = distinct !DISubprogram(name: "runtime_startup", linkageName: "__c3_runtime_startup", scope: !2, file: !2, line: 163, type: !26, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !49)
!175 = !DILocation(line: 165, column: 6, scope: !174)
!176 = !DILocation(line: 165, column: 42, scope: !174)
!177 = !DILocation(line: 166, column: 18, scope: !174)
!178 = !DILocation(line: 167, column: 2, scope: !174)
!179 = !DILocation(line: 168, column: 9, scope: !174)
!180 = !DILocation(line: 169, column: 18, scope: !174)
!181 = !DILocalVariable(name: "ctor", scope: !174, file: !2, line: 170, type: !18, align: 8)
!182 = !DILocation(line: 170, column: 12, scope: !174)
!183 = !DILocation(line: 170, column: 19, scope: !174)
!184 = !DILocation(line: 171, column: 2, scope: !174)
!185 = !DILocation(line: 171, column: 9, scope: !186)
!186 = distinct !DILexicalBlock(scope: !174, file: !2, line: 171, column: 2)
!187 = !DILocation(line: 173, column: 3, scope: !188)
!188 = distinct !DILexicalBlock(scope: !186, file: !2, line: 172, column: 2)
!189 = !DILocation(line: 174, column: 10, scope: !188)
!190 = !DILocation(line: 176, column: 9, scope: !174)
!191 = !DILocation(line: 177, column: 18, scope: !174)
!192 = !DILocation(line: 178, column: 15, scope: !174)
!193 = distinct !DISubprogram(name: "runtime_finalize", linkageName: "__c3_runtime_finalize", scope: !2, file: !2, line: 181, type: !26, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !49)
!194 = !DILocation(line: 183, column: 6, scope: !193)
!195 = !DILocation(line: 183, column: 41, scope: !193)
!196 = !DILocation(line: 184, column: 18, scope: !193)
!197 = !DILocalVariable(name: "dtor", scope: !193, file: !2, line: 185, type: !18, align: 8)
!198 = !DILocation(line: 185, column: 12, scope: !193)
!199 = !DILocation(line: 185, column: 19, scope: !193)
!200 = !DILocation(line: 186, column: 2, scope: !193)
!201 = !DILocation(line: 186, column: 9, scope: !202)
!202 = distinct !DILexicalBlock(scope: !193, file: !2, line: 186, column: 2)
!203 = !DILocation(line: 188, column: 3, scope: !204)
!204 = distinct !DILexicalBlock(scope: !202, file: !2, line: 187, column: 2)
!205 = !DILocation(line: 189, column: 10, scope: !204)
!206 = !DILocation(line: 191, column: 9, scope: !193)
!207 = !DILocation(line: 192, column: 18, scope: !193)
!208 = distinct !DISubprogram(name: "append_xxlizer", linkageName: "std.core.machoruntime.append_xxlizer", scope: !2, file: !2, line: 195, type: !209, scopeLine: 195, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !18}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Callback**", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!212 = !DILocalVariable(name: "ref", arg: 1, scope: !208, file: !2, line: 195, type: !211)
!213 = !DILocation(line: 195, column: 35, scope: !208)
!214 = !DILocalVariable(name: "cb", arg: 2, scope: !208, file: !2, line: 195, type: !18)
!215 = !DILocation(line: 195, column: 50, scope: !208)
!216 = !DILocation(line: 197, column: 2, scope: !208)
!217 = !DILocalVariable(name: "current", scope: !218, file: !2, line: 197, type: !18, align: 8)
!218 = distinct !DILexicalBlock(scope: !208, file: !2, line: 197, column: 2)
!219 = !DILocation(line: 197, column: 19, scope: !218)
!220 = !DILocation(line: 197, column: 30, scope: !218)
!221 = !DILocation(line: 197, column: 35, scope: !218)
!222 = !DILocation(line: 199, column: 7, scope: !223)
!223 = distinct !DILexicalBlock(scope: !218, file: !2, line: 198, column: 2)
!224 = !DILocation(line: 199, column: 26, scope: !223)
!225 = !DILocation(line: 201, column: 4, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !2, line: 200, column: 3)
!227 = !DILocation(line: 201, column: 14, scope: !226)
!228 = !DILocation(line: 202, column: 4, scope: !226)
!229 = !DILocation(line: 204, column: 10, scope: !223)
!230 = !DILocation(line: 206, column: 3, scope: !208)
!231 = !DILocation(line: 206, column: 9, scope: !208)
!232 = distinct !DISubprogram(name: "dl_reg_callback", linkageName: "std.core.machoruntime.dl_reg_callback", scope: !2, file: !2, line: 220, type: !233, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !92, !76}
!235 = !DILocalVariable(name: "mh", arg: 1, scope: !232, file: !2, line: 220, type: !92)
!236 = !DILocation(line: 220, column: 37, scope: !232)
!237 = !DILocalVariable(name: "vmaddr_slide", arg: 2, scope: !232, file: !2, line: 220, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !76)
!239 = !DILocation(line: 220, column: 45, scope: !232)
!240 = !DILocalVariable(name: "size", scope: !232, file: !2, line: 222, type: !56, align: 8)
!241 = !DILocation(line: 222, column: 6, scope: !232)
!242 = !DILocation(line: 222, column: 13, scope: !232)
!243 = !DILocation(line: 223, column: 9, scope: !232)
!244 = !DILocation(line: 223, column: 34, scope: !232)
!245 = !DILocalVariable(name: "section", scope: !246, file: !2, line: 101, type: !138, align: 8)
!246 = distinct !DISubprogram(name: "find_segment_section_body", linkageName: "find_segment_section_body", scope: !2, file: !2, line: 98, scopeLine: 98, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!247 = !DILocation(line: 101, column: 14, scope: !246, inlinedAt: !248)
!248 = !DILocation(line: 224, column: 17, scope: !249)
!249 = distinct !DILexicalBlock(scope: !232, file: !2, line: 224, column: 2)
!250 = !DILocation(line: 101, column: 37, scope: !246, inlinedAt: !248)
!251 = !DILocation(line: 101, column: 24, scope: !246, inlinedAt: !248)
!252 = !DILocation(line: 102, column: 12, scope: !246, inlinedAt: !248)
!253 = !DILocation(line: 104, column: 10, scope: !254, inlinedAt: !248)
!254 = distinct !DILexicalBlock(scope: !246, file: !2, line: 103, column: 2)
!255 = !DILocalVariable(name: "ptr", scope: !246, file: !2, line: 106, type: !256, align: 8)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DynamicMethod*", baseType: !257, size: 64, align: 64, dwarfAddressSpace: 0)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicMethod", scope: !2, file: !2, line: 136, size: 192, align: 64, elements: !258, identifier: "std.core.machoruntime.DynamicMethod")
!258 = !{!259, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fn_ptr", scope: !257, file: !2, line: 138, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sel", scope: !257, file: !2, line: 139, baseType: !44, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !2, line: 140, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !2, line: 140, size: 64, align: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !2, line: 142, baseType: !256, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !2, line: 143, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TypeId*", baseType: !268, size: 64, align: 64, dwarfAddressSpace: 0)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !2, file: !2, line: 209, size: 384, align: 64, elements: !269, identifier: "std.core.machoruntime.TypeId")
!269 = !{!270, !271, !272, !273, !274, !275, !276}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !2, line: 211, baseType: !3, size: 8, align: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "parentof", scope: !268, file: !2, line: 212, baseType: !267, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dtable", scope: !268, file: !2, line: 213, baseType: !256, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sizeof", scope: !268, file: !2, line: 214, baseType: !56, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !268, file: !2, line: 215, baseType: !267, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !268, file: !2, line: 216, baseType: !56, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "additional", scope: !268, file: !2, line: 217, baseType: !277, align: 64, offset: 384)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, align: 64, elements: !279)
!278 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!279 = !{!280}
!280 = !DISubrange(count: 0, lowerBound: 0)
!281 = !DILocation(line: 106, column: 9, scope: !246, inlinedAt: !248)
!282 = !DILocation(line: 106, column: 22, scope: !246, inlinedAt: !248)
!283 = !DILocation(line: 106, column: 31, scope: !246, inlinedAt: !248)
!284 = !DILocation(line: 107, column: 9, scope: !246, inlinedAt: !248)
!285 = !DILocation(line: 107, column: 14, scope: !246, inlinedAt: !248)
!286 = !DILocalVariable(name: ".temp", scope: !249, file: !2, line: 224, type: !56, align: 8)
!287 = !DILocalVariable(name: "dm", scope: !288, file: !2, line: 224, type: !256, align: 8)
!288 = distinct !DILexicalBlock(scope: !249, file: !2, line: 225, column: 2)
!289 = !DILocation(line: 224, column: 12, scope: !288)
!290 = !DILocation(line: 224, column: 17, scope: !288)
!291 = !DILocalVariable(name: "type", scope: !292, file: !2, line: 226, type: !267, align: 8)
!292 = distinct !DILexicalBlock(scope: !288, file: !2, line: 225, column: 2)
!293 = !DILocation(line: 226, column: 11, scope: !292)
!294 = !DILocation(line: 226, column: 18, scope: !292)
!295 = !DILocation(line: 227, column: 3, scope: !292)
!296 = !DILocation(line: 227, column: 13, scope: !292)
!297 = !DILocation(line: 228, column: 3, scope: !292)
!298 = !DILocation(line: 228, column: 17, scope: !292)
!299 = !DILocalVariable(name: "m", scope: !292, file: !2, line: 229, type: !256, align: 8)
!300 = !DILocation(line: 229, column: 18, scope: !292)
!301 = !DILocation(line: 229, column: 22, scope: !292)
!302 = !DILocation(line: 230, column: 3, scope: !292)
!303 = !DILocation(line: 230, column: 10, scope: !304)
!304 = distinct !DILexicalBlock(scope: !292, file: !2, line: 230, column: 3)
!305 = !DILocation(line: 232, column: 8, scope: !306)
!306 = distinct !DILexicalBlock(scope: !304, file: !2, line: 231, column: 3)
!307 = !DILocalVariable(name: "section", scope: !308, file: !2, line: 101, type: !138, align: 8)
!308 = distinct !DISubprogram(name: "find_segment_section_body", linkageName: "find_segment_section_body", scope: !2, file: !2, line: 98, scopeLine: 98, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !49)
!309 = !DILocation(line: 101, column: 14, scope: !308, inlinedAt: !310)
!310 = !DILocation(line: 235, column: 17, scope: !311)
!311 = distinct !DILexicalBlock(scope: !232, file: !2, line: 235, column: 2)
!312 = !DILocation(line: 101, column: 37, scope: !308, inlinedAt: !310)
!313 = !DILocation(line: 101, column: 24, scope: !308, inlinedAt: !310)
!314 = !DILocation(line: 102, column: 12, scope: !308, inlinedAt: !310)
!315 = !DILocation(line: 104, column: 10, scope: !316, inlinedAt: !310)
!316 = distinct !DILexicalBlock(scope: !308, file: !2, line: 103, column: 2)
!317 = !DILocalVariable(name: "ptr", scope: !308, file: !2, line: 106, type: !18, align: 8)
!318 = !DILocation(line: 106, column: 9, scope: !308, inlinedAt: !310)
!319 = !DILocation(line: 106, column: 22, scope: !308, inlinedAt: !310)
!320 = !DILocation(line: 106, column: 31, scope: !308, inlinedAt: !310)
!321 = !DILocation(line: 107, column: 9, scope: !308, inlinedAt: !310)
!322 = !DILocation(line: 107, column: 14, scope: !308, inlinedAt: !310)
!323 = !DILocalVariable(name: ".temp", scope: !311, file: !2, line: 235, type: !56, align: 8)
!324 = !DILocalVariable(name: "cb", scope: !325, file: !2, line: 235, type: !18, align: 8)
!325 = distinct !DILexicalBlock(scope: !311, file: !2, line: 236, column: 2)
!326 = !DILocation(line: 235, column: 12, scope: !325)
!327 = !DILocation(line: 235, column: 17, scope: !325)
!328 = !DILocation(line: 237, column: 31, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !2, line: 236, column: 2)
!330 = !DILocation(line: 237, column: 3, scope: !329)
