; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%"char[]" = type { ptr, i64 }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion = type { <4 x float> }
%Quaternion.5 = type { <4 x double> }

@.panic_msg = internal constant [44 x i8] c"Dereference of null pointer, 'v1' was null.\00", align 1
@.file = internal constant [15 x i8] c"math_vector.c3\00", align 1
@.func = internal constant [16 x i8] c"ortho_normalize\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@.panic_msg.1 = internal constant [18 x i8] c"Division by zero.\00", align 1
@.file.2 = internal constant [8 x i8] c"math.c3\00", align 1
@.panic_msg.3 = internal constant [44 x i8] c"Dereference of null pointer, 'v2' was null.\00", align 1
@.func.4 = internal constant [17 x i8] c"ortho_normalized\00", align 1
@.func.5 = internal constant [8 x i8] c"towards\00", align 1
@.func.6 = internal constant [11 x i8] c"barycenter\00", align 1
@.func.7 = internal constant [12 x i8] c"rotate_axis\00", align 1


!566 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!567 = !DILocation(line: 693, column: 82, scope: !566, inlinedAt: !561)
!568 = !DILocalVariable(name: "d11", scope: !537, file: !7, line: 230, type: !158, align: 8)
!569 = !DILocation(line: 230, column: 6, scope: !537, inlinedAt: !539)
!570 = !DILocation(line: 708, column: 64, scope: !571, inlinedAt: !572)
!571 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!572 = !DILocation(line: 230, column: 12, scope: !537, inlinedAt: !539)
!573 = !DILocation(line: 708, column: 68, scope: !571, inlinedAt: !572)
!574 = !DILocation(line: 693, column: 85, scope: !575, inlinedAt: !570)
!575 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!576 = !DILocation(line: 693, column: 82, scope: !575, inlinedAt: !570)
!577 = !DILocalVariable(name: "d20", scope: !537, file: !7, line: 231, type: !158, align: 8)
!578 = !DILocation(line: 231, column: 6, scope: !537, inlinedAt: !539)
!579 = !DILocation(line: 708, column: 64, scope: !580, inlinedAt: !581)
!580 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!581 = !DILocation(line: 231, column: 12, scope: !537, inlinedAt: !539)
!582 = !DILocation(line: 708, column: 68, scope: !580, inlinedAt: !581)
!583 = !DILocation(line: 693, column: 85, scope: !584, inlinedAt: !579)
!584 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!585 = !DILocation(line: 693, column: 82, scope: !584, inlinedAt: !579)
!586 = !DILocalVariable(name: "d21", scope: !537, file: !7, line: 232, type: !158, align: 8)
!587 = !DILocation(line: 232, column: 6, scope: !537, inlinedAt: !539)
!588 = !DILocation(line: 708, column: 64, scope: !589, inlinedAt: !590)
!589 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!590 = !DILocation(line: 232, column: 12, scope: !537, inlinedAt: !539)
!591 = !DILocation(line: 708, column: 68, scope: !589, inlinedAt: !590)
!592 = !DILocation(line: 693, column: 85, scope: !593, inlinedAt: !588)
!593 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!594 = !DILocation(line: 693, column: 82, scope: !593, inlinedAt: !588)
!595 = !DILocalVariable(name: "denom", scope: !537, file: !7, line: 233, type: !158, align: 8)
!596 = !DILocation(line: 233, column: 6, scope: !537, inlinedAt: !539)
!597 = !DILocation(line: 233, column: 14, scope: !537, inlinedAt: !539)
!598 = !DILocation(line: 233, column: 20, scope: !537, inlinedAt: !539)
!599 = !DILocation(line: 233, column: 26, scope: !537, inlinedAt: !539)
!600 = !DILocation(line: 233, column: 32, scope: !537, inlinedAt: !539)
!601 = !DILocalVariable(name: "y", scope: !537, file: !7, line: 234, type: !158, align: 8)
!602 = !DILocation(line: 234, column: 6, scope: !537, inlinedAt: !539)
!603 = !DILocation(line: 234, column: 11, scope: !537, inlinedAt: !539)
!604 = !DILocation(line: 234, column: 17, scope: !537, inlinedAt: !539)
!605 = !DILocation(line: 234, column: 23, scope: !537, inlinedAt: !539)
!606 = !DILocation(line: 234, column: 29, scope: !537, inlinedAt: !539)
!607 = !DILocation(line: 234, column: 36, scope: !537, inlinedAt: !539)
!608 = !DILocalVariable(name: "z", scope: !537, file: !7, line: 235, type: !158, align: 8)
!609 = !DILocation(line: 235, column: 6, scope: !537, inlinedAt: !539)
!610 = !DILocation(line: 235, column: 11, scope: !537, inlinedAt: !539)
!611 = !DILocation(line: 235, column: 17, scope: !537, inlinedAt: !539)
!612 = !DILocation(line: 235, column: 23, scope: !537, inlinedAt: !539)
!613 = !DILocation(line: 235, column: 29, scope: !537, inlinedAt: !539)
!614 = !DILocation(line: 235, column: 36, scope: !537, inlinedAt: !539)
!615 = !DILocation(line: 236, column: 26, scope: !537, inlinedAt: !539)
!616 = !DILocation(line: 236, column: 22, scope: !537, inlinedAt: !539)
!617 = !DILocation(line: 236, column: 30, scope: !537, inlinedAt: !539)
!618 = !DILocation(line: 236, column: 9, scope: !537, inlinedAt: !539)
!619 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !7, file: !7, line: 57, type: !620, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!620 = !DISubroutineType(types: !621)
!621 = !{!62, !63, !622}
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 512, align: 32, elements: !623, identifier: "std_math_matrix$float$.Matrix4x4")
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !622, file: !7, line: 33, baseType: !625, size: 512, align: 32)
!625 = !DICompositeType(tag: DW_TAG_union_type, scope: !622, file: !7, line: 33, size: 512, align: 32, elements: !626)
!626 = !{!627, !647}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !7, line: 35, baseType: !628, size: 512, align: 32)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !625, file: !7, line: 35, size: 512, align: 32, elements: !629)
!629 = !{!630, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 107, baseType: !13, align: 4)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !628, file: !7, line: 37, baseType: !631, size: 32, align: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !628, file: !7, line: 38, baseType: !631, size: 32, align: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !628, file: !7, line: 39, baseType: !631, size: 32, align: 32, offset: 352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !628, file: !7, line: 40, baseType: !631, size: 32, align: 32, offset: 480)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !625, file: !7, line: 42, baseType: !648, size: 512, align: 32)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, align: 32, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 16, lowerBound: 0)
!651 = !DILocalVariable(name: "self", arg: 1, scope: !619, file: !7, line: 57, type: !63)
!652 = !DILocation(line: 57, column: 26, scope: !619)
!653 = !DILocalVariable(name: "mat", arg: 2, scope: !619, file: !7, line: 57, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !7, file: !7, line: 107, baseType: !622, align: 4)
!655 = !DILocation(line: 57, column: 41, scope: !619)
!656 = !DILocation(line: 149, column: 3, scope: !657, inlinedAt: !658)
!657 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!658 = !DILocation(line: 57, column: 49, scope: !619)
!659 = !DILocation(line: 149, column: 13, scope: !657, inlinedAt: !658)
!660 = !DILocation(line: 149, column: 15, scope: !657, inlinedAt: !658)
!661 = !DILocation(line: 149, column: 20, scope: !657, inlinedAt: !658)
!662 = !DILocation(line: 149, column: 30, scope: !657, inlinedAt: !658)
!663 = !DILocation(line: 149, column: 32, scope: !657, inlinedAt: !658)
!664 = !DILocation(line: 149, column: 37, scope: !657, inlinedAt: !658)
!665 = !DILocation(line: 149, column: 47, scope: !657, inlinedAt: !658)
!666 = !DILocation(line: 149, column: 49, scope: !657, inlinedAt: !658)
!667 = !DILocation(line: 149, column: 54, scope: !657, inlinedAt: !658)
!668 = !DILocation(line: 148, column: 9, scope: !657, inlinedAt: !658)
!669 = !DILocation(line: 150, column: 3, scope: !657, inlinedAt: !658)
!670 = !DILocation(line: 150, column: 13, scope: !657, inlinedAt: !658)
!671 = !DILocation(line: 150, column: 15, scope: !657, inlinedAt: !658)
!672 = !DILocation(line: 150, column: 20, scope: !657, inlinedAt: !658)
!673 = !DILocation(line: 150, column: 30, scope: !657, inlinedAt: !658)
!674 = !DILocation(line: 150, column: 32, scope: !657, inlinedAt: !658)
!675 = !DILocation(line: 150, column: 37, scope: !657, inlinedAt: !658)
!676 = !DILocation(line: 150, column: 47, scope: !657, inlinedAt: !658)
!677 = !DILocation(line: 150, column: 49, scope: !657, inlinedAt: !658)
!678 = !DILocation(line: 150, column: 54, scope: !657, inlinedAt: !658)
!679 = !DILocation(line: 151, column: 3, scope: !657, inlinedAt: !658)
!680 = !DILocation(line: 151, column: 13, scope: !657, inlinedAt: !658)
!681 = !DILocation(line: 151, column: 15, scope: !657, inlinedAt: !658)
!682 = !DILocation(line: 151, column: 20, scope: !657, inlinedAt: !658)
!683 = !DILocation(line: 151, column: 30, scope: !657, inlinedAt: !658)
!684 = !DILocation(line: 151, column: 32, scope: !657, inlinedAt: !658)
!685 = !DILocation(line: 151, column: 37, scope: !657, inlinedAt: !658)
!686 = !DILocation(line: 151, column: 47, scope: !657, inlinedAt: !658)
!687 = !DILocation(line: 151, column: 49, scope: !657, inlinedAt: !658)
!688 = !DILocation(line: 151, column: 54, scope: !657, inlinedAt: !658)
!689 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !7, file: !7, line: 58, type: !690, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!690 = !DISubroutineType(types: !691)
!691 = !{!202, !203, !692}
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !7, file: !7, line: 31, size: 1024, align: 64, elements: !693, identifier: "std_math_matrix$double$.Matrix4x4")
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !7, line: 33, baseType: !695, size: 1024, align: 64)
!695 = !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !7, line: 33, size: 1024, align: 64, elements: !696)
!696 = !{!697, !717}
!697 = !DIDerivedType(tag: DW_TAG_member, scope: !695, file: !7, line: 35, baseType: !698, size: 1024, align: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !695, file: !7, line: 35, size: 1024, align: 64, elements: !699)
!699 = !{!700, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 108, baseType: !158, align: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !698, file: !7, line: 37, baseType: !701, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !698, file: !7, line: 38, baseType: !701, size: 64, align: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !698, file: !7, line: 39, baseType: !701, size: 64, align: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !698, file: !7, line: 40, baseType: !701, size: 64, align: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !695, file: !7, line: 42, baseType: !718, size: 1024, align: 64)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 1024, align: 64, elements: !649)
!719 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !7, line: 58, type: !203)
!720 = !DILocation(line: 58, column: 24, scope: !689)
!721 = !DILocalVariable(name: "mat", arg: 2, scope: !689, file: !7, line: 58, type: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !7, file: !7, line: 108, baseType: !692, align: 8)
!723 = !DILocation(line: 58, column: 38, scope: !689)
!724 = !DILocation(line: 149, column: 3, scope: !725, inlinedAt: !726)
!725 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !7, file: !7, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!726 = !DILocation(line: 58, column: 46, scope: !689)
!727 = !DILocation(line: 149, column: 13, scope: !725, inlinedAt: !726)
!728 = !DILocation(line: 149, column: 15, scope: !725, inlinedAt: !726)
!729 = !DILocation(line: 149, column: 20, scope: !725, inlinedAt: !726)
!730 = !DILocation(line: 149, column: 30, scope: !725, inlinedAt: !726)
!731 = !DILocation(line: 149, column: 32, scope: !725, inlinedAt: !726)
!732 = !DILocation(line: 149, column: 37, scope: !725, inlinedAt: !726)
!733 = !DILocation(line: 149, column: 47, scope: !725, inlinedAt: !726)
!734 = !DILocation(line: 149, column: 49, scope: !725, inlinedAt: !726)
!735 = !DILocation(line: 149, column: 54, scope: !725, inlinedAt: !726)
!736 = !DILocation(line: 148, column: 9, scope: !725, inlinedAt: !726)
!737 = !DILocation(line: 150, column: 3, scope: !725, inlinedAt: !726)
!738 = !DILocation(line: 150, column: 13, scope: !725, inlinedAt: !726)
!739 = !DILocation(line: 150, column: 15, scope: !725, inlinedAt: !726)
!740 = !DILocation(line: 150, column: 20, scope: !725, inlinedAt: !726)
!741 = !DILocation(line: 150, column: 30, scope: !725, inlinedAt: !726)
!742 = !DILocation(line: 150, column: 32, scope: !725, inlinedAt: !726)
!743 = !DILocation(line: 150, column: 37, scope: !725, inlinedAt: !726)
!744 = !DILocation(line: 150, column: 47, scope: !725, inlinedAt: !726)
!745 = !DILocation(line: 150, column: 49, scope: !725, inlinedAt: !726)
!746 = !DILocation(line: 150, column: 54, scope: !725, inlinedAt: !726)
!747 = !DILocation(line: 151, column: 3, scope: !725, inlinedAt: !726)
!748 = !DILocation(line: 151, column: 13, scope: !725, inlinedAt: !726)
!749 = !DILocation(line: 151, column: 15, scope: !725, inlinedAt: !726)
!750 = !DILocation(line: 151, column: 20, scope: !725, inlinedAt: !726)
!751 = !DILocation(line: 151, column: 30, scope: !725, inlinedAt: !726)
!752 = !DILocation(line: 151, column: 32, scope: !725, inlinedAt: !726)
!753 = !DILocation(line: 151, column: 37, scope: !725, inlinedAt: !726)
!754 = !DILocation(line: 151, column: 47, scope: !725, inlinedAt: !726)
!755 = !DILocation(line: 151, column: 49, scope: !725, inlinedAt: !726)
!756 = !DILocation(line: 151, column: 54, scope: !725, inlinedAt: !726)
!757 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !7, file: !7, line: 60, type: !758, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!758 = !DISubroutineType(types: !759)
!759 = !{!13, !63, !63}
!760 = !DILocalVariable(name: "self", arg: 1, scope: !757, file: !7, line: 60, type: !63)
!761 = !DILocation(line: 60, column: 22, scope: !757)
!762 = !DILocalVariable(name: "v2", arg: 2, scope: !757, file: !7, line: 60, type: !62)
!763 = !DILocation(line: 60, column: 34, scope: !757)
!764 = !DILocalVariable(name: "len", scope: !765, file: !7, line: 158, type: !13, align: 4)
!765 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!766 = !DILocation(line: 158, column: 6, scope: !765, inlinedAt: !767)
!767 = !DILocation(line: 60, column: 41, scope: !757)
!768 = !DILocation(line: 158, column: 12, scope: !765, inlinedAt: !767)
!769 = !DILocation(line: 665, column: 60, scope: !770, inlinedAt: !771)
!770 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!771 = !DILocation(line: 666, column: 55, scope: !772, inlinedAt: !768)
!772 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !33, file: !33, line: 666, scopeLine: 666, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!773 = !DILocation(line: 665, column: 64, scope: !770, inlinedAt: !771)
!774 = !DILocation(line: 650, column: 81, scope: !775, inlinedAt: !769)
!775 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!776 = !DILocation(line: 650, column: 78, scope: !775, inlinedAt: !769)
!777 = !DILocalVariable(name: "dot", scope: !765, file: !7, line: 159, type: !13, align: 4)
!778 = !DILocation(line: 159, column: 6, scope: !765, inlinedAt: !767)
!779 = !DILocation(line: 665, column: 60, scope: !780, inlinedAt: !781)
!780 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!781 = !DILocation(line: 159, column: 12, scope: !765, inlinedAt: !767)
!782 = !DILocation(line: 665, column: 64, scope: !780, inlinedAt: !781)
!783 = !DILocation(line: 650, column: 81, scope: !784, inlinedAt: !779)
!784 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!785 = !DILocation(line: 650, column: 78, scope: !784, inlinedAt: !779)
!786 = !DILocation(line: 176, column: 21, scope: !787, inlinedAt: !788)
!787 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !33, file: !33, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!788 = !DILocation(line: 160, column: 9, scope: !765, inlinedAt: !767)
!789 = !DILocation(line: 176, column: 10, scope: !787, inlinedAt: !788)
!790 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !7, file: !7, line: 61, type: !791, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!791 = !DISubroutineType(types: !792)
!792 = !{!158, !203, !203}
!793 = !DILocalVariable(name: "self", arg: 1, scope: !790, file: !7, line: 61, type: !203)
!794 = !DILocation(line: 61, column: 22, scope: !790)
!795 = !DILocalVariable(name: "v2", arg: 2, scope: !790, file: !7, line: 61, type: !202)
!796 = !DILocation(line: 61, column: 33, scope: !790)
!797 = !DILocalVariable(name: "len", scope: !798, file: !7, line: 158, type: !158, align: 8)
!798 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !7, file: !7, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!799 = !DILocation(line: 158, column: 6, scope: !798, inlinedAt: !800)
!800 = !DILocation(line: 61, column: 40, scope: !790)
!801 = !DILocation(line: 158, column: 12, scope: !798, inlinedAt: !800)
!802 = !DILocation(line: 708, column: 64, scope: !803, inlinedAt: !804)
!803 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!804 = !DILocation(line: 709, column: 58, scope: !805, inlinedAt: !801)
!805 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !33, file: !33, line: 709, scopeLine: 709, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!806 = !DILocation(line: 708, column: 68, scope: !803, inlinedAt: !804)
!807 = !DILocation(line: 693, column: 85, scope: !808, inlinedAt: !802)
!808 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!809 = !DILocation(line: 693, column: 82, scope: !808, inlinedAt: !802)
!810 = !DILocalVariable(name: "dot", scope: !798, file: !7, line: 159, type: !158, align: 8)
!811 = !DILocation(line: 159, column: 6, scope: !798, inlinedAt: !800)
!812 = !DILocation(line: 708, column: 64, scope: !813, inlinedAt: !814)
!813 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!814 = !DILocation(line: 159, column: 12, scope: !798, inlinedAt: !800)
!815 = !DILocation(line: 708, column: 68, scope: !813, inlinedAt: !814)
!816 = !DILocation(line: 693, column: 85, scope: !817, inlinedAt: !812)
!817 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!818 = !DILocation(line: 693, column: 82, scope: !817, inlinedAt: !812)
!819 = !DILocation(line: 178, column: 20, scope: !820, inlinedAt: !821)
!820 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !33, file: !33, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!821 = !DILocation(line: 160, column: 9, scope: !798, inlinedAt: !800)
!822 = !DILocation(line: 178, column: 10, scope: !820, inlinedAt: !821)
!823 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !7, file: !7, line: 63, type: !60, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!824 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !7, line: 63, type: !63)
!825 = !DILocation(line: 63, column: 24, scope: !823)
!826 = !DILocalVariable(name: "n", arg: 2, scope: !823, file: !7, line: 63, type: !62)
!827 = !DILocation(line: 63, column: 36, scope: !823)
!828 = !DILocalVariable(name: "r", arg: 3, scope: !823, file: !7, line: 63, type: !13)
!829 = !DILocation(line: 63, column: 45, scope: !823)
!830 = !DILocalVariable(name: "dot", scope: !831, file: !7, line: 241, type: !13, align: 4)
!831 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!832 = !DILocation(line: 241, column: 6, scope: !831, inlinedAt: !833)
!833 = !DILocation(line: 63, column: 51, scope: !823)
!834 = !DILocation(line: 665, column: 60, scope: !835, inlinedAt: !836)
!835 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!836 = !DILocation(line: 241, column: 12, scope: !831, inlinedAt: !833)
!837 = !DILocation(line: 665, column: 64, scope: !835, inlinedAt: !836)
!838 = !DILocation(line: 650, column: 81, scope: !839, inlinedAt: !834)
!839 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!840 = !DILocation(line: 650, column: 78, scope: !839, inlinedAt: !834)
!841 = !DILocalVariable(name: "d", scope: !831, file: !7, line: 242, type: !13, align: 4)
!842 = !DILocation(line: 242, column: 6, scope: !831, inlinedAt: !833)
!843 = !DILocation(line: 242, column: 14, scope: !831, inlinedAt: !833)
!844 = !DILocation(line: 242, column: 18, scope: !831, inlinedAt: !833)
!845 = !DILocation(line: 242, column: 27, scope: !831, inlinedAt: !833)
!846 = !DILocation(line: 242, column: 33, scope: !831, inlinedAt: !833)
!847 = !DILocation(line: 242, column: 23, scope: !831, inlinedAt: !833)
!848 = !DILocation(line: 242, column: 10, scope: !831, inlinedAt: !833)
!849 = !DILocation(line: 244, column: 9, scope: !831, inlinedAt: !833)
!850 = !DILocation(line: 244, column: 17, scope: !831, inlinedAt: !833)
!851 = !DILocation(line: 244, column: 21, scope: !831, inlinedAt: !833)
!852 = !DILocation(line: 244, column: 25, scope: !831, inlinedAt: !833)
!853 = !DILocation(line: 244, column: 30, scope: !831, inlinedAt: !833)
!854 = !DILocation(line: 244, column: 34, scope: !831, inlinedAt: !833)
!855 = !DILocation(line: 26, column: 10, scope: !856, inlinedAt: !857)
!856 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !51, file: !51, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!857 = !DILocation(line: 537, column: 25, scope: !858, inlinedAt: !859)
!858 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !33, file: !33, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!859 = !DILocation(line: 244, column: 40, scope: !831, inlinedAt: !833)
!860 = !DILocation(line: 244, column: 57, scope: !831, inlinedAt: !833)
!861 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !7, file: !7, line: 64, type: !200, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!862 = !DILocalVariable(name: "self", arg: 1, scope: !861, file: !7, line: 64, type: !203)
!863 = !DILocation(line: 64, column: 22, scope: !861)
!864 = !DILocalVariable(name: "n", arg: 2, scope: !861, file: !7, line: 64, type: !202)
!865 = !DILocation(line: 64, column: 33, scope: !861)
!866 = !DILocalVariable(name: "r", arg: 3, scope: !861, file: !7, line: 64, type: !158)
!867 = !DILocation(line: 64, column: 43, scope: !861)
!868 = !DILocalVariable(name: "dot", scope: !869, file: !7, line: 241, type: !158, align: 8)
!869 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !7, file: !7, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !16)
!870 = !DILocation(line: 241, column: 6, scope: !869, inlinedAt: !871)
!871 = !DILocation(line: 64, column: 49, scope: !861)
!872 = !DILocation(line: 708, column: 64, scope: !873, inlinedAt: !874)
!873 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !33, file: !33, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!874 = !DILocation(line: 241, column: 12, scope: !869, inlinedAt: !871)
!875 = !DILocation(line: 708, column: 68, scope: !873, inlinedAt: !874)
!876 = !DILocation(line: 693, column: 85, scope: !877, inlinedAt: !872)
!877 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !33, file: !33, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!878 = !DILocation(line: 693, column: 82, scope: !877, inlinedAt: !872)
!879 = !DILocalVariable(name: "d", scope: !869, file: !7, line: 242, type: !158, align: 8)
!880 = !DILocation(line: 242, column: 6, scope: !869, inlinedAt: !871)
!881 = !DILocation(line: 242, column: 14, scope: !869, inlinedAt: !871)
!882 = !DILocation(line: 242, column: 18, scope: !869, inlinedAt: !871)
!883 = !DILocation(line: 242, column: 27, scope: !869, inlinedAt: !871)
!884 = !DILocation(line: 242, column: 33, scope: !869, inlinedAt: !871)
!885 = !DILocation(line: 242, column: 23, scope: !869, inlinedAt: !871)
!886 = !DILocation(line: 242, column: 10, scope: !869, inlinedAt: !871)
!887 = !DILocation(line: 244, column: 9, scope: !869, inlinedAt: !871)
!888 = !DILocation(line: 244, column: 17, scope: !869, inlinedAt: !871)
!889 = !DILocation(line: 244, column: 21, scope: !869, inlinedAt: !871)
!890 = !DILocation(line: 244, column: 25, scope: !869, inlinedAt: !871)
!891 = !DILocation(line: 244, column: 30, scope: !869, inlinedAt: !871)
!892 = !DILocation(line: 244, column: 34, scope: !869, inlinedAt: !871)
!893 = !DILocation(line: 26, column: 10, scope: !894, inlinedAt: !895)
!894 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !51, file: !51, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!895 = !DILocation(line: 537, column: 25, scope: !896, inlinedAt: !897)
!896 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !33, file: !33, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!897 = !DILocation(line: 244, column: 40, scope: !869, inlinedAt: !871)
!898 = !DILocation(line: 244, column: 57, scope: !869, inlinedAt: !871)
!899 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !7, file: !7, line: 72, type: !900, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!900 = !DISubroutineType(types: !901)
!901 = !{!62, !63, !902}
!902 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 128, align: 128, elements: !903, identifier: "std_math_quaternion$float$.Quaternion")
!903 = !{!904, !912}
!904 = !DIDerivedType(tag: DW_TAG_member, scope: !902, file: !7, line: 5, baseType: !905, size: 128, align: 128)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !902, file: !7, line: 5, size: 128, align: 128, elements: !906)
!906 = !{!907, !909, !910, !911}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !905, file: !7, line: 7, baseType: !908, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 98, baseType: !13, align: 4)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !905, file: !7, line: 7, baseType: !908, size: 32, align: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !905, file: !7, line: 7, baseType: !908, size: 32, align: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !905, file: !7, line: 7, baseType: !908, size: 32, align: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !902, file: !7, line: 9, baseType: !110, size: 128, align: 128)
!913 = !DILocalVariable(name: "self", arg: 1, scope: !899, file: !7, line: 72, type: !63)
!914 = !DILocation(line: 72, column: 28, scope: !899)
!915 = !DILocalVariable(name: "q", arg: 2, scope: !899, file: !7, line: 72, type: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !7, file: !7, line: 98, baseType: !902, align: 16)
!917 = !DILocation(line: 72, column: 46, scope: !899)
!918 = !DILocation(line: 173, column: 3, scope: !919, inlinedAt: !920)
!919 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!920 = !DILocation(line: 72, column: 52, scope: !899)
!921 = !DILocation(line: 173, column: 5, scope: !919, inlinedAt: !920)
!922 = !DILocation(line: 173, column: 11, scope: !919, inlinedAt: !920)
!923 = !DILocation(line: 173, column: 17, scope: !919, inlinedAt: !920)
!924 = !DILocation(line: 173, column: 23, scope: !919, inlinedAt: !920)
!925 = !DILocation(line: 173, column: 29, scope: !919, inlinedAt: !920)
!926 = !DILocation(line: 173, column: 35, scope: !919, inlinedAt: !920)
!927 = !DILocation(line: 173, column: 41, scope: !919, inlinedAt: !920)
!928 = !DILocation(line: 173, column: 47, scope: !919, inlinedAt: !920)
!929 = !DILocation(line: 173, column: 53, scope: !919, inlinedAt: !920)
!930 = !DILocation(line: 174, column: 6, scope: !919, inlinedAt: !920)
!931 = !DILocation(line: 174, column: 8, scope: !919, inlinedAt: !920)
!932 = !DILocation(line: 174, column: 18, scope: !919, inlinedAt: !920)
!933 = !DILocation(line: 174, column: 14, scope: !919, inlinedAt: !920)
!934 = !DILocation(line: 174, column: 24, scope: !919, inlinedAt: !920)
!935 = !DILocation(line: 174, column: 34, scope: !919, inlinedAt: !920)
!936 = !DILocation(line: 174, column: 30, scope: !919, inlinedAt: !920)
!937 = !DILocation(line: 174, column: 40, scope: !919, inlinedAt: !920)
!938 = !DILocation(line: 175, column: 6, scope: !919, inlinedAt: !920)
!939 = !DILocation(line: 175, column: 8, scope: !919, inlinedAt: !920)
!940 = !DILocation(line: 175, column: 18, scope: !919, inlinedAt: !920)
!941 = !DILocation(line: 175, column: 14, scope: !919, inlinedAt: !920)
!942 = !DILocation(line: 175, column: 24, scope: !919, inlinedAt: !920)
!943 = !DILocation(line: 175, column: 34, scope: !919, inlinedAt: !920)
!944 = !DILocation(line: 175, column: 30, scope: !919, inlinedAt: !920)
!945 = !DILocation(line: 175, column: 40, scope: !919, inlinedAt: !920)
!946 = !DILocation(line: 172, column: 9, scope: !919, inlinedAt: !920)
!947 = !DILocation(line: 176, column: 3, scope: !919, inlinedAt: !920)
!948 = !DILocation(line: 176, column: 5, scope: !919, inlinedAt: !920)
!949 = !DILocation(line: 176, column: 15, scope: !919, inlinedAt: !920)
!950 = !DILocation(line: 176, column: 11, scope: !919, inlinedAt: !920)
!951 = !DILocation(line: 176, column: 21, scope: !919, inlinedAt: !920)
!952 = !DILocation(line: 176, column: 31, scope: !919, inlinedAt: !920)
!953 = !DILocation(line: 176, column: 27, scope: !919, inlinedAt: !920)
!954 = !DILocation(line: 176, column: 37, scope: !919, inlinedAt: !920)
!955 = !DILocation(line: 177, column: 6, scope: !919, inlinedAt: !920)
!956 = !DILocation(line: 177, column: 8, scope: !919, inlinedAt: !920)
!957 = !DILocation(line: 177, column: 14, scope: !919, inlinedAt: !920)
!958 = !DILocation(line: 177, column: 20, scope: !919, inlinedAt: !920)
!959 = !DILocation(line: 177, column: 26, scope: !919, inlinedAt: !920)
!960 = !DILocation(line: 177, column: 32, scope: !919, inlinedAt: !920)
!961 = !DILocation(line: 177, column: 38, scope: !919, inlinedAt: !920)
!962 = !DILocation(line: 177, column: 44, scope: !919, inlinedAt: !920)
!963 = !DILocation(line: 177, column: 50, scope: !919, inlinedAt: !920)
!964 = !DILocation(line: 177, column: 56, scope: !919, inlinedAt: !920)
!965 = !DILocation(line: 178, column: 6, scope: !919, inlinedAt: !920)
!966 = !DILocation(line: 178, column: 8, scope: !919, inlinedAt: !920)
!967 = !DILocation(line: 178, column: 19, scope: !919, inlinedAt: !920)
!968 = !DILocation(line: 178, column: 14, scope: !919, inlinedAt: !920)
!969 = !DILocation(line: 178, column: 25, scope: !919, inlinedAt: !920)
!970 = !DILocation(line: 178, column: 35, scope: !919, inlinedAt: !920)
!971 = !DILocation(line: 178, column: 31, scope: !919, inlinedAt: !920)
!972 = !DILocation(line: 178, column: 41, scope: !919, inlinedAt: !920)
!973 = !DILocation(line: 179, column: 3, scope: !919, inlinedAt: !920)
!974 = !DILocation(line: 179, column: 5, scope: !919, inlinedAt: !920)
!975 = !DILocation(line: 179, column: 16, scope: !919, inlinedAt: !920)
!976 = !DILocation(line: 179, column: 11, scope: !919, inlinedAt: !920)
!977 = !DILocation(line: 179, column: 22, scope: !919, inlinedAt: !920)
!978 = !DILocation(line: 179, column: 32, scope: !919, inlinedAt: !920)
!979 = !DILocation(line: 179, column: 28, scope: !919, inlinedAt: !920)
!980 = !DILocation(line: 179, column: 38, scope: !919, inlinedAt: !920)
!981 = !DILocation(line: 180, column: 6, scope: !919, inlinedAt: !920)
!982 = !DILocation(line: 180, column: 8, scope: !919, inlinedAt: !920)
!983 = !DILocation(line: 180, column: 18, scope: !919, inlinedAt: !920)
!984 = !DILocation(line: 180, column: 14, scope: !919, inlinedAt: !920)
!985 = !DILocation(line: 180, column: 24, scope: !919, inlinedAt: !920)
!986 = !DILocation(line: 180, column: 34, scope: !919, inlinedAt: !920)
!987 = !DILocation(line: 180, column: 30, scope: !919, inlinedAt: !920)
!988 = !DILocation(line: 180, column: 40, scope: !919, inlinedAt: !920)
!989 = !DILocation(line: 181, column: 6, scope: !919, inlinedAt: !920)
!990 = !DILocation(line: 181, column: 8, scope: !919, inlinedAt: !920)
!991 = !DILocation(line: 181, column: 14, scope: !919, inlinedAt: !920)
!992 = !DILocation(line: 181, column: 20, scope: !919, inlinedAt: !920)
!993 = !DILocation(line: 181, column: 26, scope: !919, inlinedAt: !920)
!994 = !DILocation(line: 181, column: 32, scope: !919, inlinedAt: !920)
!995 = !DILocation(line: 181, column: 38, scope: !919, inlinedAt: !920)
!996 = !DILocation(line: 181, column: 44, scope: !919, inlinedAt: !920)
!997 = !DILocation(line: 181, column: 50, scope: !919, inlinedAt: !920)
!998 = !DILocation(line: 181, column: 56, scope: !919, inlinedAt: !920)
!999 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !7, file: !7, line: 73, type: !1000, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !16)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!202, !203, !1002}
!1002 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !7, file: !7, line: 3, size: 256, align: 128, elements: !1003, identifier: "std_math_quaternion$double$.Quaternion")
!1003 = !{!1004, !1012}
!1004 = !DIDerivedType(tag: DW_TAG_member, scope: !1002, file: !7, line: 5, baseType: !1005, size: 256, align: 128)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !1002, file: !7, line: 5, size: 256, align: 128, elements: !1006)
!1006 = !{!1007, !1009, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1005, file: !7, line: 7, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !7, file: !7, line: 99, baseType: !158, align: 8)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !1005, file: !7, line: 7, baseType: !1008, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1005, file: !7, line: 7, baseType: !1008, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1005, file: !7, line: 7, baseType: !1008, size: 64, align: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1002, file: !7, line: 9, baseType: !248, size: 256, align: 128)
!1013 = !DILocalVariable(name: "self", arg: 1, scope: !999, file: !7, line: 73, type: !203)
!1014 = !DILocation(line: 73, column: 26, scope: !999)
!1015 = !DILocalVariable(name: "q", arg: 2, scope: !999, file: !7, line: 73, type: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !7, file: !7, line: 99, baseType: !1002, align: 16)
!1017 = !DILocation(line: 73, column: 43, scope: !999)
!1018 = !DILocation(line: 173, column: 3, scope: !1019, inlinedAt: !1020)
!1019 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !7, file: !7, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!1020 = !DILocation(line: 73, column: 49, scope: !999)
!1021 = !DILocation(line: 173, column: 5, scope: !1019, inlinedAt: !1020)
!1022 = !DILocation(line: 173, column: 11, scope: !1019, inlinedAt: !1020)
!1023 = !DILocation(line: 173, column: 17, scope: !1019, inlinedAt: !1020)
!1024 = !DILocation(line: 173, column: 23, scope: !1019, inlinedAt: !1020)
!1025 = !DILocation(line: 173, column: 29, scope: !1019, inlinedAt: !1020)
!1026 = !DILocation(line: 173, column: 35, scope: !1019, inlinedAt: !1020)
!1027 = !DILocation(line: 173, column: 41, scope: !1019, inlinedAt: !1020)
!1028 = !DILocation(line: 173, column: 47, scope: !1019, inlinedAt: !1020)
!1029 = !DILocation(line: 173, column: 53, scope: !1019, inlinedAt: !1020)
!1030 = !DILocation(line: 174, column: 6, scope: !1019, inlinedAt: !1020)
!1031 = !DILocation(line: 174, column: 8, scope: !1019, inlinedAt: !1020)
!1032 = !DILocation(line: 174, column: 18, scope: !1019, inlinedAt: !1020)
!1033 = !DILocation(line: 174, column: 14, scope: !1019, inlinedAt: !1020)
!1034 = !DILocation(line: 174, column: 24, scope: !1019, inlinedAt: !1020)
!1035 = !DILocation(line: 174, column: 34, scope: !1019, inlinedAt: !1020)
!1036 = !DILocation(line: 174, column: 30, scope: !1019, inlinedAt: !1020)
!1037 = !DILocation(line: 174, column: 40, scope: !1019, inlinedAt: !1020)
!1038 = !DILocation(line: 175, column: 6, scope: !1019, inlinedAt: !1020)
!1039 = !DILocation(line: 175, column: 8, scope: !1019, inlinedAt: !1020)
!1040 = !DILocation(line: 175, column: 18, scope: !1019, inlinedAt: !1020)
!1041 = !DILocation(line: 175, column: 14, scope: !1019, inlinedAt: !1020)
!1042 = !DILocation(line: 175, column: 24, scope: !1019, inlinedAt: !1020)
!1043 = !DILocation(line: 175, column: 34, scope: !1019, inlinedAt: !1020)
!1044 = !DILocation(line: 175, column: 30, scope: !1019, inlinedAt: !1020)
!1045 = !DILocation(line: 175, column: 40, scope: !1019, inlinedAt: !1020)
!1046 = !DILocation(line: 172, column: 9, scope: !1019, inlinedAt: !1020)
!1047 = !DILocation(line: 176, column: 3, scope: !1019, inlinedAt: !1020)
!1048 = !DILocation(line: 176, column: 5, scope: !1019, inlinedAt: !1020)
!1049 = !DILocation(line: 176, column: 15, scope: !1019, inlinedAt: !1020)
!1050 = !DILocation(line: 176, column: 11, scope: !1019, inlinedAt: !1020)
!1051 = !DILocation(line: 176, column: 21, scope: !1019, inlinedAt: !1020)
!1052 = !DILocation(line: 176, column: 31, scope: !1019, inlinedAt: !1020)
!1053 = !DILocation(line: 176, column: 27, scope: !1019, inlinedAt: !1020)
!1054 = !DILocation(line: 176, column: 37, scope: !1019, inlinedAt: !1020)
!1055 = !DILocation(line: 177, column: 6, scope: !1019, inlinedAt: !1020)
!1056 = !DILocation(line: 177, column: 8, scope: !1019, inlinedAt: !1020)
!1057 = !DILocation(line: 177, column: 14, scope: !1019, inlinedAt: !1020)
!1058 = !DILocation(line: 177, column: 20, scope: !1019, inlinedAt: !1020)
!1059 = !DILocation(line: 177, column: 26, scope: !1019, inlinedAt: !1020)
!1060 = !DILocation(line: 177, column: 32, scope: !1019, inlinedAt: !1020)
