; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

@"std.encoding.json.JsonParsingError$EOF" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.encoding.json.JsonParsingError" to i64), %"char[]" { ptr @.fault, i64 3 }, i64 1 }, align 8
@.fault = internal constant [4 x i8] c"EOF\00", align 1
@"std.encoding.json.JsonParsingError$UNEXPECTED_CHARACTER" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.encoding.json.JsonParsingError" to i64), %"char[]" { ptr @.fault.1, i64 20 }, i64 2 }, align 8
@.fault.1 = internal constant [21 x i8] c"UNEXPECTED_CHARACTER\00", align 1
@"std.encoding.json.JsonParsingError$INVALID_ESCAPE_SEQUENCE" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.encoding.json.JsonParsingError" to i64), %"char[]" { ptr @.fault.2, i64 23 }, i64 3 }, align 8
@.fault.2 = internal constant [24 x i8] c"INVALID_ESCAPE_SEQUENCE\00", align 1

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, splitDebugInlining: false)
!7 = !DIFile(filename: "json.c3", directory: "/opt/homebrew/lib/c3/std/encoding")
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !10, file: !7, line: 47, baseType: !36, size: 32, align: 32, elements: !37)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !7, file: !7, line: 64, size: 576, align: 64, elements: !11, identifier: "std.encoding.json.JsonContext")
!11 = !{!12, !14, !21, !26, !27, !31, !33, !35}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !10, file: !7, line: 66, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !10, file: !7, line: 67, baseType: !15, size: 128, align: 64, offset: 64)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !16, identifier: "InStream")
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !15, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !10, file: !7, line: 68, baseType: !22, size: 128, align: 64, offset: 192)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !18, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !20, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !10, file: !7, line: 69, baseType: !9, size: 32, align: 32, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !10, file: !7, line: 70, baseType: !28, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !7, file: !7, line: 4, baseType: !29, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !7, file: !7, line: 5, baseType: null, align: 1)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !10, file: !7, line: 71, baseType: !32, size: 64, align: 64, offset: 448)
!32 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !10, file: !7, line: 72, baseType: !34, size: 8, align: 8, offset: 512)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, scope: !10, file: !7, line: 73, baseType: !34, size: 8, align: 8, offset: 520)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!38 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!39 = !DIEnumerator(name: "LBRACE", value: 1)
!40 = !DIEnumerator(name: "LBRACKET", value: 2)
!41 = !DIEnumerator(name: "COMMA", value: 3)
!42 = !DIEnumerator(name: "COLON", value: 4)
!43 = !DIEnumerator(name: "RBRACE", value: 5)
!44 = !DIEnumerator(name: "RBRACKET", value: 6)
!45 = !DIEnumerator(name: "STRING", value: 7)
!46 = !DIEnumerator(name: "NUMBER", value: 8)
!47 = !DIEnumerator(name: "TRUE", value: 9)
!48 = !DIEnumerator(name: "FALSE", value: 10)
!49 = !DIEnumerator(name: "NULL", value: 11)
!50 = !DIEnumerator(name: "EOF", value: 12)
!51 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !7, file: !7, line: 18, type: !52, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !56, !71, !22}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !57, size: 64, align: 64, dwarfAddressSpace: 0)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !7, file: !7, line: 11, size: 640, align: 128, elements: !59, identifier: "std.collections.object.Object")
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !7, line: 13, baseType: !20, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !58, file: !7, line: 14, baseType: !22, size: 128, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, scope: !58, file: !7, line: 15, baseType: !63, size: 384, align: 128, offset: 256)
!63 = !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !7, line: 15, size: 384, align: 128, elements: !64)
!64 = !{!65, !67, !68, !70, !79, !80, !90}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !63, file: !7, line: 17, baseType: !66, size: 128, align: 128)
!66 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !63, file: !7, line: 18, baseType: !32, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !63, file: !7, line: 19, baseType: !69, size: 8, align: 8)
!69 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !63, file: !7, line: 20, baseType: !71, size: 128, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !73, identifier: "char[]")
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !72, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !72, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !78)
!78 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !63, file: !7, line: 21, baseType: !18, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !63, file: !7, line: 22, baseType: !81, size: 320, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !7, file: !7, line: 466, baseType: !82, align: 8)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !7, file: !7, line: 14, size: 320, align: 64, elements: !83, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !7, line: 16, baseType: !77, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !82, file: !7, line: 17, baseType: !77, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !82, file: !7, line: 18, baseType: !22, size: 128, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !82, file: !7, line: 19, baseType: !88, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !7, file: !7, line: 466, baseType: !57, align: 8)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !63, file: !7, line: 23, baseType: !91, size: 384, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !7, file: !7, line: 465, baseType: !92, align: 8)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !7, file: !7, line: 10, size: 384, align: 64, elements: !93, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!93 = !{!94, !109, !110, !111, !112}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !92, file: !7, line: 12, baseType: !95, size: 128, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !96, identifier: "Entry*[]")
!96 = !{!97, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !95, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !99, size: 64, align: 64, dwarfAddressSpace: 0)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !7, file: !7, line: 502, size: 320, align: 64, elements: !101, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!101 = !{!102, !103, !105, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !100, file: !7, line: 504, baseType: !13, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !7, line: 505, baseType: !104, size: 128, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !7, file: !7, line: 465, baseType: !71, align: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !7, line: 506, baseType: !106, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !7, file: !7, line: 465, baseType: !57, align: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !7, line: 507, baseType: !99, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, baseType: !77, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !92, file: !7, line: 13, baseType: !22, size: 128, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !92, file: !7, line: 14, baseType: !13, size: 32, align: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !92, file: !7, line: 15, baseType: !13, size: 32, align: 32, offset: 288)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !92, file: !7, line: 16, baseType: !113, size: 32, align: 32, offset: 320)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !{}
!115 = !DILocalVariable(name: "s", arg: 1, scope: !51, file: !7, line: 18, type: !71)
!116 = !DILocation(line: 18, column: 33, scope: !51)
!117 = !DILocalVariable(name: "allocator", arg: 2, scope: !51, file: !7, line: 18, type: !22)
!118 = !DILocation(line: 18, column: 46, scope: !51)
!119 = !DILocation(line: 20, column: 33, scope: !51)
!120 = !DILocation(line: 20, column: 15, scope: !51)
!121 = !DILocation(line: 20, column: 9, scope: !51)
!122 = distinct !DISubprogram(name: "temp_parse_string", linkageName: "std.encoding.json.temp_parse_string", scope: !7, file: !7, line: 23, type: !123, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!123 = !DISubroutineType(types: !124)
!124 = !{!54, !56, !71}
!125 = !DILocalVariable(name: "s", arg: 1, scope: !122, file: !7, line: 23, type: !71)
!126 = !DILocation(line: 23, column: 38, scope: !122)
!127 = !DILocation(line: 25, column: 33, scope: !122)
!128 = !DILocation(line: 25, column: 15, scope: !122)
!129 = !DILocation(line: 396, column: 6, scope: !130, inlinedAt: !132)
!130 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !131, file: !131, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!131 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!132 = !DILocation(line: 25, column: 37, scope: !122)
!133 = !DILocation(line: 398, column: 3, scope: !134, inlinedAt: !132)
!134 = distinct !DILexicalBlock(scope: !130, file: !131, line: 397, column: 2)
!135 = !DILocation(line: 400, column: 9, scope: !130, inlinedAt: !132)
!136 = !DILocation(line: 25, column: 9, scope: !122)
!137 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !7, file: !7, line: 28, type: !138, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!138 = !DISubroutineType(types: !139)
!139 = !{!54, !56, !15, !22}
!140 = !DILocalVariable(name: "s", arg: 1, scope: !137, file: !7, line: 28, type: !15)
!141 = !DILocation(line: 28, column: 28, scope: !137)
!142 = !DILocalVariable(name: "allocator", arg: 2, scope: !137, file: !7, line: 28, type: !22)
!143 = !DILocation(line: 28, column: 41, scope: !137)
!144 = !DILocalVariable(name: "buffer", scope: !145, file: !7, line: 537, type: !147, align: 1)
!145 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !146, file: !146, line: 535, scopeLine: 535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!146 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 4096, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 512, lowerBound: 0)
!150 = !DILocation(line: 537, column: 14, scope: !145, inlinedAt: !151)
!151 = !DILocation(line: 30, column: 2, scope: !137)
!152 = !DILocalVariable(name: "allocator", scope: !145, file: !7, line: 538, type: !153, align: 8)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !7, file: !7, line: 3, size: 384, align: 64, elements: !154, identifier: "std.core.mem.allocator.OnStackAllocator")
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !153, file: !7, line: 5, baseType: !22, size: 128, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !7, line: 6, baseType: !72, size: 128, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !153, file: !7, line: 7, baseType: !77, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !153, file: !7, line: 8, baseType: !159, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !160, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !7, file: !7, line: 12, size: 192, align: 64, elements: !161, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!161 = !{!162, !163, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !160, file: !7, line: 14, baseType: !69, size: 8, align: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !7, line: 15, baseType: !159, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !7, line: 16, baseType: !18, size: 64, align: 64, offset: 128)
!165 = !DILocation(line: 538, column: 19, scope: !145, inlinedAt: !151)
!166 = !DILocation(line: 539, column: 18, scope: !145, inlinedAt: !151)
!167 = !DILocation(line: 539, column: 2, scope: !145, inlinedAt: !151)
!168 = !DILocalVariable(name: "mem", scope: !137, file: !7, line: 30, type: !22, align: 8)
!169 = !DILocation(line: 30, column: 28, scope: !137)
!170 = !DILocation(line: 541, column: 8, scope: !171, inlinedAt: !151)
!171 = distinct !DILexicalBlock(scope: !145, file: !146, line: 541, column: 2)
!172 = !DILocalVariable(name: "context", scope: !173, file: !7, line: 32, type: !10, align: 8)
!173 = distinct !DILexicalBlock(scope: !137, file: !7, line: 31, column: 2)
!174 = !DILocation(line: 32, column: 15, scope: !173)
!175 = !DILocation(line: 32, column: 73, scope: !173)
!176 = !DILocation(line: 32, column: 42, scope: !173)
!177 = !DILocation(line: 32, column: 89, scope: !173)
!178 = !DILocation(line: 32, column: 105, scope: !173)
!179 = !DILocalVariable(name: "current", scope: !180, file: !7, line: 592, type: !181, align: 8)
!180 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !146, file: !146, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !182, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !7, file: !7, line: 10, size: 320, align: 64, elements: !183, identifier: "std.core.mem.allocator.TempAllocator")
!183 = !{!184, !185, !198, !199, !200}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !182, file: !7, line: 12, baseType: !22, size: 128, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !182, file: !7, line: 13, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !187, size: 64, align: 64, dwarfAddressSpace: 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !7, file: !7, line: 22, size: 320, align: 64, elements: !188, identifier: "std.core.mem.allocator.TempAllocatorPage")
!188 = !{!189, !190, !191, !192, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !187, file: !7, line: 24, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !187, file: !7, line: 25, baseType: !18, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !187, file: !7, line: 26, baseType: !77, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !7, line: 27, baseType: !77, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !187, file: !7, line: 28, baseType: !77, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !7, line: 29, baseType: !195, align: 8, offset: 320)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 0, lowerBound: 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !182, file: !7, line: 14, baseType: !77, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !182, file: !7, line: 15, baseType: !77, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !7, line: 16, baseType: !195, align: 8, offset: 320)
!201 = !DILocation(line: 592, column: 17, scope: !180, inlinedAt: !202)
!202 = !DILocation(line: 33, column: 3, scope: !173)
!203 = !DILocation(line: 396, column: 6, scope: !204, inlinedAt: !205)
!204 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !131, file: !131, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!205 = !DILocation(line: 592, column: 27, scope: !180, inlinedAt: !202)
!206 = !DILocation(line: 398, column: 3, scope: !207, inlinedAt: !205)
!207 = distinct !DILexicalBlock(scope: !204, file: !131, line: 397, column: 2)
!208 = !DILocation(line: 400, column: 9, scope: !204, inlinedAt: !205)
!209 = !DILocalVariable(name: "original", scope: !180, file: !7, line: 594, type: !181, align: 8)
!210 = !DILocation(line: 594, column: 18, scope: !180, inlinedAt: !202)
!211 = !DILocation(line: 594, column: 29, scope: !180, inlinedAt: !202)
!212 = !DILocation(line: 595, column: 7, scope: !180, inlinedAt: !202)
!213 = !DILocation(line: 595, column: 18, scope: !180, inlinedAt: !202)
!214 = !DILocation(line: 595, column: 45, scope: !180, inlinedAt: !202)
!215 = !DILocalVariable(name: "mark", scope: !180, file: !7, line: 597, type: !77, align: 8)
!216 = !DILocation(line: 597, column: 6, scope: !180, inlinedAt: !202)
!217 = !DILocation(line: 597, column: 13, scope: !180, inlinedAt: !202)
!218 = !DILocation(line: 35, column: 11, scope: !219)
!219 = distinct !DILexicalBlock(scope: !173, file: !7, line: 34, column: 3)
!220 = !DILocation(line: 600, column: 17, scope: !221, inlinedAt: !202)
!221 = distinct !DILexicalBlock(scope: !180, file: !146, line: 599, column: 2)
!222 = !DILocation(line: 600, column: 3, scope: !221, inlinedAt: !202)
!223 = !DILocation(line: 602, column: 39, scope: !221, inlinedAt: !202)
!224 = !DILocation(line: 540, column: 8, scope: !225, inlinedAt: !151)
!225 = distinct !DILexicalBlock(scope: !145, file: !146, line: 540, column: 8)
!226 = !DILocation(line: 600, column: 17, scope: !227, inlinedAt: !202)
!227 = distinct !DILexicalBlock(scope: !180, file: !146, line: 599, column: 2)
!228 = !DILocation(line: 600, column: 3, scope: !227, inlinedAt: !202)
!229 = !DILocation(line: 602, column: 39, scope: !227, inlinedAt: !202)
!230 = !DILocation(line: 540, column: 8, scope: !231, inlinedAt: !151)
!231 = distinct !DILexicalBlock(scope: !145, file: !146, line: 540, column: 8)
!232 = distinct !DISubprogram(name: "temp_parse", linkageName: "std.encoding.json.temp_parse", scope: !7, file: !7, line: 40, type: !233, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !114)
!233 = !DISubroutineType(types: !234)
!234 = !{!54, !56, !15}
!235 = !DILocalVariable(name: "s", arg: 1, scope: !232, file: !7, line: 40, type: !15)
!236 = !DILocation(line: 40, column: 33, scope: !232)
!237 = !DILocation(line: 396, column: 6, scope: !238, inlinedAt: !239)
!238 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !131, file: !131, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!239 = !DILocation(line: 42, column: 18, scope: !232)
!240 = !DILocation(line: 398, column: 3, scope: !241, inlinedAt: !239)
!241 = distinct !DILexicalBlock(scope: !238, file: !131, line: 397, column: 2)
!242 = !DILocation(line: 400, column: 9, scope: !238, inlinedAt: !239)
!243 = !DILocation(line: 42, column: 9, scope: !232)
!244 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !7, file: !7, line: 81, type: !245, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6, retainedNodes: !114)
!245 = !DISubroutineType(types: !246)
!246 = !{!54, !56, !247, !9}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
