; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

@"std.core.builtin.IteratorResult$NO_MORE_ELEMENT" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.builtin.IteratorResult" to i64), %"char[]" { ptr @.fault, i64 15 }, i64 1 }, align 8
@.fault = internal constant [16 x i8] c"NO_MORE_ELEMENT\00", align 1
@"$ct.std.core.builtin.IteratorResult" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"std.core.builtin.SearchResult$MISSING" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.builtin.SearchResult" to i64), %"char[]" { ptr @.fault.1, i64 7 }, i64 1 }, align 8
@.fault.1 = internal constant [8 x i8] c"MISSING\00", align 1
@"$ct.std.core.builtin.SearchResult" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"std.core.builtin.CastResult$TYPE_MISMATCH" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.builtin.CastResult" to i64), %"char[]" { ptr @.fault.2, i64 13 }, i64 1 }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 115, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "builtin.c3", directory: "/opt/homebrew/lib/c3/std/core")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 136, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 134, baseType: !7, align: 8)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10, !19}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !12, identifier: "char[]")
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !18)
!18 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 418, type: !22, isLocal: false, isDefinition: true, align: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 417, baseType: !23, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 422, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "old_bus_error", linkageName: "std.core.builtin.old_bus_error", scope: !2, file: !2, line: 713, type: !29, isLocal: false, isDefinition: true, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalFunction", scope: !2, file: !2, line: 39, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SignalFunction", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !26}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "old_segmentation_fault", linkageName: "std.core.builtin.old_segmentation_fault", scope: !2, file: !2, line: 714, type: !29, isLocal: false, isDefinition: true, align: 8)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 2, !"wchar_size", i32 4}
!38 = !{i32 4, !"PIC Level", i32 2}
!39 = !{i32 1, !"uwtable", i32 1}
!40 = !{i32 2, !"frame-pointer", i32 1}
!41 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !42, splitDebugInlining: false)
!42 = !{!0, !4, !20, !24, !27, !33}
!43 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 138, type: !44, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !41, retainedNodes: !56)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !10, !10, !10, !19, !46}
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !47, identifier: "any[]")
!47 = !{!48, !55}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !51, identifier: "any")
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !50, baseType: !23, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, baseType: !17, size: 64, align: 64, offset: 64)
!56 = !{}
!57 = !DILocalVariable(name: "fmt", arg: 1, scope: !43, file: !2, line: 138, type: !10)
!58 = !DILocation(line: 138, column: 23, scope: !43)
!59 = !DILocalVariable(name: "file", arg: 2, scope: !43, file: !2, line: 138, type: !10)
!60 = !DILocation(line: 138, column: 35, scope: !43)
!61 = !DILocalVariable(name: "function", arg: 3, scope: !43, file: !2, line: 138, type: !10)
!62 = !DILocation(line: 138, column: 48, scope: !43)
!63 = !DILocalVariable(name: "line", arg: 4, scope: !43, file: !2, line: 138, type: !19)
!64 = !DILocation(line: 138, column: 63, scope: !43)
!65 = !DILocalVariable(name: "args", arg: 5, scope: !43, file: !2, line: 138, type: !46)
!66 = !DILocation(line: 138, column: 69, scope: !43)
!67 = !DILocation(line: 140, column: 6, scope: !43)
!68 = !DILocation(line: 208, column: 15, scope: !69, inlinedAt: !71)
!69 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !70, file: !70, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!70 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/lib/c3/std/io")
!71 = !DILocation(line: 142, column: 3, scope: !72)
!72 = distinct !DILexicalBlock(scope: !43, file: !2, line: 141, column: 2)
!73 = !DILocation(line: 118, column: 24, scope: !74, inlinedAt: !75)
!74 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !70, file: !70, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!75 = !DILocation(line: 208, column: 3, scope: !69, inlinedAt: !71)
!76 = !DILocation(line: 218, column: 16, scope: !77, inlinedAt: !78)
!77 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !70, file: !70, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!78 = !DILocation(line: 143, column: 3, scope: !72)
!79 = !DILocalVariable(name: "len", scope: !80, file: !2, line: 174, type: !17, align: 8)
!80 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !70, file: !70, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !56)
!81 = !DILocation(line: 174, column: 6, scope: !80, inlinedAt: !82)
!82 = !DILocation(line: 218, column: 3, scope: !77, inlinedAt: !78)
!83 = !DILocation(line: 118, column: 24, scope: !84, inlinedAt: !85)
!84 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !70, file: !70, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!85 = !DILocation(line: 174, column: 12, scope: !80, inlinedAt: !82)
!86 = !DILocation(line: 175, column: 17, scope: !80, inlinedAt: !82)
!87 = !DILocation(line: 175, column: 2, scope: !80, inlinedAt: !82)
!88 = !DILocation(line: 180, column: 4, scope: !80, inlinedAt: !82)
!89 = !DILocation(line: 182, column: 9, scope: !80, inlinedAt: !82)
!90 = !DILocation(line: 144, column: 9, scope: !72)
!91 = !DILocation(line: 146, column: 13, scope: !43)
!92 = !DILocalVariable(name: "buffer", scope: !93, file: !2, line: 537, type: !95, align: 1)
!93 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !94, file: !94, line: 535, scopeLine: 535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !56)
!94 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 512, lowerBound: 0)
!98 = !DILocation(line: 537, column: 14, scope: !93, inlinedAt: !99)
!99 = !DILocation(line: 147, column: 2, scope: !43)
!100 = !DILocalVariable(name: "allocator", scope: !93, file: !2, line: 538, type: !101, align: 8)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !102, identifier: "std.core.mem.allocator.OnStackAllocator")
!102 = !{!103, !108, !109, !110}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !101, file: !2, line: 5, baseType: !104, size: 128, align: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !105, identifier: "Allocator")
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !104, baseType: !23, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, baseType: !54, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !2, line: 6, baseType: !11, size: 128, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !101, file: !2, line: 7, baseType: !17, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !101, file: !2, line: 8, baseType: !111, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !113, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !112, file: !2, line: 14, baseType: !3, size: 8, align: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !2, line: 15, baseType: !111, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !2, line: 16, baseType: !23, size: 64, align: 64, offset: 128)
!117 = !DILocation(line: 538, column: 19, scope: !93, inlinedAt: !99)
!118 = !DILocation(line: 539, column: 18, scope: !93, inlinedAt: !99)
!119 = !DILocation(line: 539, column: 2, scope: !93, inlinedAt: !99)
!120 = !DILocalVariable(name: "allocator", scope: !43, file: !2, line: 147, type: !104, align: 8)
!121 = !DILocation(line: 147, column: 28, scope: !43)
!122 = !DILocation(line: 541, column: 8, scope: !123, inlinedAt: !99)
!123 = distinct !DILexicalBlock(scope: !93, file: !94, line: 541, column: 2)
!124 = !DILocalVariable(name: "s", scope: !125, file: !2, line: 149, type: !126, align: 8)
!125 = distinct !DILexicalBlock(scope: !43, file: !2, line: 148, column: 2)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !127, align: 8)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !128, size: 64, align: 64, dwarfAddressSpace: 0)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!129 = !DILocation(line: 149, column: 11, scope: !125)
!130 = !DILocation(line: 150, column: 25, scope: !125)
!131 = !DILocation(line: 150, column: 3, scope: !125)
!132 = !DILocation(line: 151, column: 3, scope: !125)
!133 = !DILocation(line: 152, column: 14, scope: !125)
!134 = !DILocation(line: 153, column: 3, scope: !125)
!135 = !DILocation(line: 153, column: 9, scope: !125)
!136 = !DILocation(line: 153, column: 39, scope: !125)
!137 = !DILocation(line: 540, column: 8, scope: !138, inlinedAt: !99)
!138 = distinct !DILexicalBlock(scope: !93, file: !94, line: 540, column: 8)
!139 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 65, type: !140, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !41, retainedNodes: !56)
!140 = !DISubroutineType(types: !141)
!141 = !{!3, !10, !26}
!142 = !DILocalVariable(name: "message", arg: 1, scope: !139, file: !2, line: 65, type: !10)
!143 = !DILocation(line: 65, column: 32, scope: !139)
!144 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !139, file: !2, line: 65, type: !26)
!145 = !DILocation(line: 65, column: 45, scope: !139)
!146 = !DILocalVariable(name: "current", scope: !147, file: !2, line: 592, type: !148, align: 8)
!147 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !94, file: !94, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !56)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !150, identifier: "std.core.mem.allocator.TempAllocator")
!150 = !{!151, !152, !165, !166, !167}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !149, file: !2, line: 12, baseType: !104, size: 128, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !149, file: !2, line: 13, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !155, identifier: "std.core.mem.allocator.TempAllocatorPage")
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !154, file: !2, line: 24, baseType: !153, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !154, file: !2, line: 25, baseType: !23, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !154, file: !2, line: 26, baseType: !17, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !2, line: 27, baseType: !17, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !154, file: !2, line: 28, baseType: !17, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !2, line: 29, baseType: !162, align: 8, offset: 320)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, align: 8, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 0, lowerBound: 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !149, file: !2, line: 14, baseType: !17, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !149, file: !2, line: 15, baseType: !17, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !2, line: 16, baseType: !162, align: 8, offset: 320)
!168 = !DILocation(line: 592, column: 17, scope: !147, inlinedAt: !169)
!169 = !DILocation(line: 67, column: 2, scope: !139)
!170 = !DILocation(line: 396, column: 6, scope: !171, inlinedAt: !173)
!171 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !172, file: !172, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!172 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!173 = !DILocation(line: 592, column: 27, scope: !147, inlinedAt: !169)
!174 = !DILocation(line: 398, column: 3, scope: !175, inlinedAt: !173)
!175 = distinct !DILexicalBlock(scope: !171, file: !172, line: 397, column: 2)
!176 = !DILocation(line: 400, column: 9, scope: !171, inlinedAt: !173)
!177 = !DILocalVariable(name: "mark", scope: !147, file: !2, line: 597, type: !17, align: 8)
!178 = !DILocation(line: 597, column: 6, scope: !147, inlinedAt: !169)
!179 = !DILocation(line: 597, column: 13, scope: !147, inlinedAt: !169)
!180 = !DILocalVariable(name: "buffer", scope: !181, file: !2, line: 69, type: !182, align: 8)
!181 = distinct !DILexicalBlock(scope: !139, file: !2, line: 68, column: 2)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 64, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 256, lowerBound: 0)
!185 = !DILocation(line: 69, column: 14, scope: !181)
!186 = !DILocalVariable(name: "backtraces", scope: !181, file: !2, line: 70, type: !187, align: 8)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !188, identifier: "void*[]")
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !187, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !187, baseType: !17, size: 64, align: 64, offset: 64)
!192 = !DILocation(line: 70, column: 11, scope: !181)
!193 = !DILocation(line: 70, column: 52, scope: !181)
!194 = !DILocation(line: 70, column: 24, scope: !181)
!195 = !DILocation(line: 71, column: 3, scope: !181)
!196 = !DILocalVariable(name: "backtrace", scope: !181, file: !2, line: 72, type: !197, align: 8)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !198, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!198 = !{!199, !200, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !2, line: 16, baseType: !17, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !197, file: !2, line: 17, baseType: !17, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !197, file: !2, line: 18, baseType: !104, size: 128, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !197, file: !2, line: 19, baseType: !203, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !205, align: 8)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !206, identifier: "std.os.backtrace.Backtrace")
!206 = !{!207, !209, !210, !211, !212, !213, !214}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !205, file: !2, line: 17, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !18)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !205, file: !2, line: 18, baseType: !10, size: 128, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !205, file: !2, line: 19, baseType: !10, size: 128, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !205, file: !2, line: 20, baseType: !10, size: 128, align: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !205, file: !2, line: 21, baseType: !19, size: 32, align: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !205, file: !2, line: 22, baseType: !104, size: 128, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !205, file: !2, line: 23, baseType: !3, size: 8, align: 8, offset: 640)
!215 = !DILocation(line: 72, column: 18, scope: !181)
!216 = !DILocation(line: 396, column: 6, scope: !217, inlinedAt: !218)
!217 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !172, file: !172, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!218 = !DILocation(line: 72, column: 73, scope: !181)
!219 = !DILocation(line: 398, column: 3, scope: !220, inlinedAt: !218)
!220 = distinct !DILexicalBlock(scope: !217, file: !172, line: 397, column: 2)
!221 = !DILocation(line: 400, column: 9, scope: !217, inlinedAt: !218)
!222 = !DILocation(line: 72, column: 30, scope: !181)
!223 = !DILocation(line: 73, column: 13, scope: !181)
!224 = !DILocation(line: 600, column: 17, scope: !225, inlinedAt: !169)
!225 = distinct !DILexicalBlock(scope: !147, file: !94, line: 599, column: 2)
!226 = !DILocation(line: 600, column: 3, scope: !225, inlinedAt: !169)
!227 = !DILocation(line: 603, column: 9, scope: !225, inlinedAt: !169)
!228 = !DILocation(line: 74, column: 7, scope: !181)
!229 = !DILocation(line: 74, column: 26, scope: !181)
!230 = !DILocation(line: 600, column: 17, scope: !231, inlinedAt: !169)
!231 = distinct !DILexicalBlock(scope: !147, file: !94, line: 599, column: 2)
!232 = !DILocation(line: 600, column: 3, scope: !231, inlinedAt: !169)
!233 = !DILocation(line: 603, column: 9, scope: !231, inlinedAt: !169)
!234 = !DILocation(line: 208, column: 15, scope: !235, inlinedAt: !236)
!235 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !70, file: !70, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!236 = !DILocation(line: 75, column: 3, scope: !181)
!237 = !DILocation(line: 118, column: 24, scope: !238, inlinedAt: !239)
!238 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !70, file: !70, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!239 = !DILocation(line: 208, column: 3, scope: !235, inlinedAt: !236)
!240 = !DILocation(line: 208, column: 15, scope: !241, inlinedAt: !242)
!241 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !70, file: !70, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!242 = !DILocation(line: 76, column: 3, scope: !181)
!243 = !DILocation(line: 118, column: 24, scope: !244, inlinedAt: !245)
!244 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !70, file: !70, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!245 = !DILocation(line: 208, column: 3, scope: !241, inlinedAt: !242)
!246 = !DILocation(line: 218, column: 16, scope: !247, inlinedAt: !248)
!247 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !70, file: !70, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!248 = !DILocation(line: 77, column: 3, scope: !181)
!249 = !DILocalVariable(name: "len", scope: !250, file: !2, line: 174, type: !17, align: 8)
!250 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !70, file: !70, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !56)
!251 = !DILocation(line: 174, column: 6, scope: !250, inlinedAt: !252)
!252 = !DILocation(line: 218, column: 3, scope: !247, inlinedAt: !248)
!253 = !DILocation(line: 118, column: 24, scope: !254, inlinedAt: !255)
!254 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !70, file: !70, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41)
!255 = !DILocation(line: 174, column: 12, scope: !250, inlinedAt: !252)
!256 = !DILocation(line: 175, column: 17, scope: !250, inlinedAt: !252)
!257 = !DILocation(line: 175, column: 2, scope: !250, inlinedAt: !252)
