; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"fn void()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }
%"TestUnit[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%TestContext = type { [25 x i64] }

@"$ct.std.core.runtime.BenchmarkUnit" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.runtime.TestUnit" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.runtime.TestContext" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 200, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.runtime.AnyRaw" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 16, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.runtime.SliceRaw" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 16, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS = weak local_unnamed_addr constant i32 3, align 4, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !2, file: !2, line: 25, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "runtime_benchmark.c3", directory: "/opt/homebrew/lib/c3/std/core")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !2, file: !2, line: 26, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !2, file: !2, line: 28, type: !8, isLocal: true, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !2, file: !2, line: 29, type: !8, isLocal: true, isDefinition: true, align: 4)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !13, file: !13, line: 47, type: !14, isLocal: true, isDefinition: true, align: 8)
!13 = !DIFile(filename: "runtime_test.c3", directory: "/opt/homebrew/lib/c3/std/core")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !13, file: !13, line: 28, size: 1600, align: 64, elements: !16, identifier: "std.core.runtime.TestContext")
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !15, file: !13, line: 30, baseType: !18, size: 1600, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !13, file: !13, line: 36, baseType: !19, align: 8)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1600, align: 64, elements: !21)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !{!22}
!22 = !DISubrange(count: 25, lowerBound: 0)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 2, !"wchar_size", i32 4}
!26 = !{i32 4, !"PIC Level", i32 2}
!27 = !{i32 1, !"uwtable", i32 1}
!28 = !{i32 2, !"frame-pointer", i32 1}
!29 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !30, splitDebugInlining: false)
!30 = !{!0, !4, !6, !9, !11}
!31 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !2, file: !2, line: 13, type: !32, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !55}
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !35, identifier: "BenchmarkUnit[]")
!35 = !{!36, !54}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !34, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !2, file: !2, line: 7, size: 192, align: 64, elements: !39, identifier: "std.core.runtime.BenchmarkUnit")
!39 = !{!40, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !2, line: 9, baseType: !41, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !43, identifier: "char[]")
!43 = !{!44, !47}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !38, file: !2, line: 10, baseType: !50, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !2, file: !2, line: 5, baseType: !51, align: 8)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, baseType: !48, size: 64, align: 64, offset: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !56, identifier: "Allocator")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!61 = !{}
!62 = !DILocalVariable(name: "allocator", arg: 1, scope: !31, file: !2, line: 13, type: !55)
!63 = !DILocation(line: 13, column: 58, scope: !31)
!64 = !DILocalVariable(name: "fns", scope: !31, file: !2, line: 15, type: !65, align: 8)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !66, identifier: "BenchmarkFn[]")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !65, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, baseType: !48, size: 64, align: 64, offset: 64)
!70 = !DILocation(line: 15, column: 16, scope: !31)
!71 = !DILocation(line: 15, column: 22, scope: !31)
!72 = !DILocalVariable(name: "names", scope: !31, file: !2, line: 16, type: !73, align: 8)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !74, identifier: "String[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !48, size: 64, align: 64, offset: 64)
!78 = !DILocation(line: 16, column: 11, scope: !31)
!79 = !DILocation(line: 16, column: 19, scope: !31)
!80 = !DILocalVariable(name: "benchmarks", scope: !31, file: !2, line: 17, type: !34, align: 8)
!81 = !DILocation(line: 17, column: 18, scope: !31)
!82 = !DILocation(line: 17, column: 80, scope: !31)
!83 = !DILocation(line: 286, column: 55, scope: !84, inlinedAt: !86)
!84 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !85, file: !85, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!85 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!86 = !DILocation(line: 269, column: 9, scope: !87, inlinedAt: !88)
!87 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !85, file: !85, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!88 = !DILocation(line: 17, column: 31, scope: !31)
!89 = !DILocation(line: 286, column: 40, scope: !84, inlinedAt: !86)
!90 = !DILocation(line: 62, column: 6, scope: !91, inlinedAt: !92)
!91 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !85, file: !85, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!92 = !DILocation(line: 286, column: 18, scope: !84, inlinedAt: !86)
!93 = !DILocation(line: 62, column: 20, scope: !91, inlinedAt: !92)
!94 = !DILocation(line: 28, column: 71, scope: !95, inlinedAt: !96)
!95 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !85, file: !85, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!96 = !DILocation(line: 68, column: 10, scope: !91, inlinedAt: !92)
!97 = !DILocation(line: 286, column: 67, scope: !84, inlinedAt: !86)
!98 = !DILocation(line: 18, column: 26, scope: !99)
!99 = distinct !DILexicalBlock(scope: !31, file: !2, line: 18, column: 2)
!100 = !DILocalVariable(name: ".temp", scope: !99, file: !2, line: 18, type: !48, align: 8)
!101 = !DILocation(line: 18, column: 11, scope: !99)
!102 = !DILocalVariable(name: "i", scope: !103, file: !2, line: 18, type: !48, align: 8)
!103 = distinct !DILexicalBlock(scope: !99, file: !2, line: 19, column: 2)
!104 = !DILocation(line: 18, column: 11, scope: !103)
!105 = !DILocalVariable(name: "benchmark", scope: !103, file: !2, line: 18, type: !51, align: 8)
!106 = !DILocation(line: 18, column: 14, scope: !103)
!107 = !DILocation(line: 18, column: 26, scope: !103)
!108 = !DILocation(line: 20, column: 3, scope: !109)
!109 = distinct !DILexicalBlock(scope: !103, file: !2, line: 19, column: 2)
!110 = !DILocation(line: 20, column: 14, scope: !109)
!111 = !DILocation(line: 20, column: 21, scope: !109)
!112 = !DILocation(line: 20, column: 27, scope: !109)
!113 = !DILocation(line: 20, column: 31, scope: !109)
!114 = !DILocation(line: 20, column: 35, scope: !109)
!115 = !DILocation(line: 22, column: 9, scope: !31)
!116 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !2, file: !2, line: 31, type: !117, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !8}
!119 = !DILocalVariable(name: "value", arg: 1, scope: !116, file: !2, line: 31, type: !8)
!120 = !DILocation(line: 31, column: 46, scope: !116)
!121 = !DILocation(line: 33, column: 35, scope: !116)
!122 = distinct !DISubprogram(name: "set_benchmark_max_iterations", linkageName: "std.core.runtime.set_benchmark_max_iterations", scope: !2, file: !2, line: 36, type: !117, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!123 = !DILocalVariable(name: "value", arg: 1, scope: !122, file: !2, line: 36, type: !8)
!124 = !DILocation(line: 36, column: 43, scope: !122)
!125 = !DILocation(line: 38, column: 12, scope: !122)
!126 = !DILocation(line: 39, column: 32, scope: !122)
!127 = distinct !DISubprogram(name: "default_benchmark_runner", linkageName: "std.core.runtime.default_benchmark_runner", scope: !2, file: !2, line: 171, type: !128, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !73}
!130 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!131 = !DILocalVariable(name: "args", arg: 1, scope: !127, file: !2, line: 171, type: !73)
!132 = !DILocation(line: 171, column: 43, scope: !127)
!133 = !DILocalVariable(name: "current", scope: !134, file: !2, line: 592, type: !136, align: 8)
!134 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !135, file: !135, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !61)
!135 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !137, size: 64, align: 64, dwarfAddressSpace: 0)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !138, identifier: "std.core.mem.allocator.TempAllocator")
!138 = !{!139, !140, !153, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !137, file: !2, line: 12, baseType: !55, size: 128, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !137, file: !2, line: 13, baseType: !141, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !143, identifier: "std.core.mem.allocator.TempAllocatorPage")
!143 = !{!144, !145, !146, !147, !148, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !142, file: !2, line: 24, baseType: !141, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !142, file: !2, line: 25, baseType: !58, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !142, file: !2, line: 26, baseType: !48, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !142, file: !2, line: 27, baseType: !48, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !142, file: !2, line: 28, baseType: !48, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !2, line: 29, baseType: !150, align: 8, offset: 320)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 0, lowerBound: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !137, file: !2, line: 14, baseType: !48, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !137, file: !2, line: 15, baseType: !48, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !2, line: 16, baseType: !150, align: 8, offset: 320)
!156 = !DILocation(line: 592, column: 17, scope: !134, inlinedAt: !157)
!157 = !DILocation(line: 173, column: 2, scope: !127)
!158 = !DILocation(line: 396, column: 6, scope: !159, inlinedAt: !160)
!159 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !85, file: !85, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!160 = !DILocation(line: 592, column: 27, scope: !134, inlinedAt: !157)
!161 = !DILocation(line: 398, column: 3, scope: !162, inlinedAt: !160)
!162 = distinct !DILexicalBlock(scope: !159, file: !85, line: 397, column: 2)
!163 = !DILocation(line: 400, column: 9, scope: !159, inlinedAt: !160)
!164 = !DILocalVariable(name: "mark", scope: !134, file: !2, line: 597, type: !48, align: 8)
!165 = !DILocation(line: 597, column: 6, scope: !134, inlinedAt: !157)
!166 = !DILocation(line: 597, column: 13, scope: !134, inlinedAt: !157)
!167 = !DILocation(line: 396, column: 6, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !85, file: !85, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!169 = !DILocation(line: 175, column: 53, scope: !170)
!170 = distinct !DILexicalBlock(scope: !127, file: !2, line: 174, column: 2)
!171 = !DILocation(line: 398, column: 3, scope: !172, inlinedAt: !169)
!172 = distinct !DILexicalBlock(scope: !168, file: !85, line: 397, column: 2)
!173 = !DILocation(line: 400, column: 9, scope: !168, inlinedAt: !169)
!174 = !DILocation(line: 175, column: 25, scope: !170)
!175 = !DILocation(line: 175, column: 10, scope: !170)
!176 = !DILocation(line: 600, column: 17, scope: !177, inlinedAt: !157)
!177 = distinct !DILexicalBlock(scope: !134, file: !135, line: 599, column: 2)
!178 = !DILocation(line: 600, column: 3, scope: !177, inlinedAt: !157)
!179 = !DILocation(line: 603, column: 9, scope: !177, inlinedAt: !157)
!180 = distinct !DISubprogram(name: "run_benchmarks", linkageName: "std.core.runtime.run_benchmarks", scope: !2, file: !2, line: 115, type: !181, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!181 = !DISubroutineType(types: !182)
!182 = !{!130, !34}
!183 = !DILocalVariable(name: "benchmarks", arg: 1, scope: !180, file: !2, line: 115, type: !34)
!184 = !DILocation(line: 115, column: 40, scope: !180)
!185 = !DILocalVariable(name: "max_name", scope: !180, file: !2, line: 117, type: !48, align: 8)
!186 = !DILocation(line: 117, column: 6, scope: !180)
!187 = !DILocation(line: 119, column: 19, scope: !188)
!188 = distinct !DILexicalBlock(scope: !180, file: !2, line: 119, column: 2)
!189 = !DILocalVariable(name: ".temp", scope: !188, file: !2, line: 119, type: !48, align: 8)
!190 = !DILocalVariable(name: "unit", scope: !191, file: !2, line: 119, type: !37, align: 8)
!191 = distinct !DILexicalBlock(scope: !188, file: !2, line: 120, column: 2)
!192 = !DILocation(line: 119, column: 12, scope: !191)
!193 = !DILocation(line: 119, column: 19, scope: !191)
!194 = !DILocation(line: 121, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !191, file: !2, line: 120, column: 2)
!196 = !DILocation(line: 121, column: 18, scope: !195)
!197 = !DILocation(line: 121, column: 44, scope: !195)
!198 = !DILocalVariable(name: "len", scope: !180, file: !2, line: 124, type: !48, align: 8)
!199 = !DILocation(line: 124, column: 6, scope: !180)
!200 = !DILocation(line: 124, column: 12, scope: !180)
!201 = !DILocalVariable(name: "name", scope: !180, file: !2, line: 126, type: !202, align: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !203, align: 8)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !204, size: 64, align: 64, dwarfAddressSpace: 0)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!205 = !DILocation(line: 126, column: 10, scope: !180)
!206 = !DILocation(line: 126, column: 17, scope: !180)
!207 = !DILocation(line: 127, column: 26, scope: !180)
!208 = !DILocation(line: 127, column: 2, scope: !180)
!209 = !DILocation(line: 397, column: 22, scope: !210, inlinedAt: !212)
!210 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !211, file: !211, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!211 = !DIFile(filename: "dstring.c3", directory: "/opt/homebrew/lib/c3/std/core")
!212 = !DILocation(line: 128, column: 2, scope: !180)
!213 = !DILocation(line: 397, column: 4, scope: !210, inlinedAt: !212)
!214 = !DILocation(line: 129, column: 26, scope: !180)
!215 = !DILocation(line: 129, column: 32, scope: !180)
!216 = !DILocation(line: 129, column: 2, scope: !180)
!217 = !DILocation(line: 200, column: 16, scope: !218, inlinedAt: !220)
!218 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !219, file: !219, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!219 = !DIFile(filename: "io.c3", directory: "/opt/homebrew/lib/c3/std/io")
!220 = !DILocation(line: 131, column: 2, scope: !180)
!221 = !DILocalVariable(name: "len", scope: !222, file: !2, line: 174, type: !48, align: 8)
!222 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !219, file: !219, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29, retainedNodes: !61)
!223 = !DILocation(line: 174, column: 6, scope: !222, inlinedAt: !224)
!224 = !DILocation(line: 200, column: 3, scope: !218, inlinedAt: !220)
!225 = !DILocation(line: 120, column: 35, scope: !226, inlinedAt: !227)
!226 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !219, file: !219, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!227 = !DILocation(line: 174, column: 12, scope: !222, inlinedAt: !224)
!228 = !DILocation(line: 120, column: 25, scope: !226, inlinedAt: !227)
!229 = !DILocation(line: 175, column: 17, scope: !222, inlinedAt: !224)
!230 = !DILocation(line: 175, column: 2, scope: !222, inlinedAt: !224)
!231 = !DILocation(line: 180, column: 4, scope: !222, inlinedAt: !224)
!232 = !DILocation(line: 182, column: 9, scope: !222, inlinedAt: !224)
!233 = !DILocation(line: 133, column: 2, scope: !180)
!234 = !DILocalVariable(name: "sys_clock_started", scope: !180, file: !2, line: 135, type: !235, align: 8)
!235 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!236 = !DILocation(line: 135, column: 7, scope: !180)
!237 = !DILocalVariable(name: "sys_clock_finished", scope: !180, file: !2, line: 136, type: !235, align: 8)
!238 = !DILocation(line: 136, column: 7, scope: !180)
!239 = !DILocalVariable(name: "sys_clocks", scope: !180, file: !2, line: 137, type: !235, align: 8)
!240 = !DILocation(line: 137, column: 7, scope: !180)
!241 = !DILocalVariable(name: "clock", scope: !180, file: !2, line: 138, type: !242, align: 8)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Clock", scope: !2, file: !2, line: 6, baseType: !20, align: 8)
!243 = !DILocation(line: 138, column: 8, scope: !180)
!244 = !DILocation(line: 140, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !180, file: !2, line: 140, column: 2)
!246 = !DILocalVariable(name: ".temp", scope: !245, file: !2, line: 140, type: !48, align: 8)
!247 = !DILocalVariable(name: "unit", scope: !248, file: !2, line: 140, type: !38, align: 8)
!248 = distinct !DILexicalBlock(scope: !245, file: !2, line: 141, column: 2)
!249 = !DILocation(line: 140, column: 10, scope: !248)
!250 = !DILocation(line: 140, column: 17, scope: !248)
!251 = !DILocation(line: 143, column: 36, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !2, line: 141, column: 2)
!253 = !DILocation(line: 143, column: 3, scope: !252)
!254 = !DILocation(line: 144, column: 27, scope: !252)
!255 = !DILocation(line: 144, column: 38, scope: !252)
!256 = !DILocation(line: 144, column: 3, scope: !252)
!257 = !DILocation(line: 145, column: 21, scope: !252)
!258 = !DILocation(line: 145, column: 3, scope: !252)
!259 = !DILocalVariable(name: "i", scope: !260, file: !2, line: 147, type: !8, align: 4)
!260 = distinct !DILexicalBlock(scope: !252, file: !2, line: 147, column: 3)
!261 = !DILocation(line: 147, column: 13, scope: !260)
!262 = !DILocation(line: 147, column: 17, scope: !260)
!263 = !DILocation(line: 147, column: 20, scope: !260)
!264 = !DILocation(line: 147, column: 24, scope: !260)
!265 = !DILocation(line: 149, column: 4, scope: !266)
!266 = distinct !DILexicalBlock(scope: !260, file: !2, line: 148, column: 3)
!267 = !DILocation(line: 147, column: 53, scope: !260)
!268 = !DILocation(line: 152, column: 11, scope: !252)
!269 = !DILocation(line: 153, column: 23, scope: !252)
!270 = !DILocalVariable(name: "i", scope: !271, file: !2, line: 155, type: !8, align: 4)
!271 = distinct !DILexicalBlock(scope: !252, file: !2, line: 155, column: 3)
!272 = !DILocation(line: 155, column: 13, scope: !271)
!273 = !DILocation(line: 155, column: 17, scope: !271)
!274 = !DILocation(line: 155, column: 20, scope: !271)
!275 = !DILocation(line: 155, column: 24, scope: !271)
!276 = !DILocation(line: 157, column: 4, scope: !277)
!277 = distinct !DILexicalBlock(scope: !271, file: !2, line: 156, column: 3)
!278 = !DILocation(line: 155, column: 50, scope: !271)
!279 = !DILocation(line: 160, column: 24, scope: !252)
!280 = !DILocalVariable(name: "nano_seconds", scope: !252, file: !2, line: 161, type: !281, align: 8)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "NanoDuration", scope: !2, file: !2, line: 7, baseType: !235, align: 8)
!282 = !DILocation(line: 161, column: 16, scope: !252)
!283 = !DILocation(line: 161, column: 31, scope: !252)
!284 = !DILocation(line: 162, column: 16, scope: !252)
!285 = !DILocation(line: 162, column: 37, scope: !252)
!286 = !DILocation(line: 164, column: 57, scope: !252)
!287 = !DILocation(line: 164, column: 78, scope: !252)
!288 = !DILocation(line: 164, column: 105, scope: !252)
!289 = !DILocation(line: 164, column: 124, scope: !252)
!290 = !DILocation(line: 164, column: 3, scope: !252)
!291 = !DILocation(line: 142, column: 9, scope: !292)
!292 = distinct !DILexicalBlock(scope: !252, file: !2, line: 142, column: 9)
!293 = !DILocation(line: 167, column: 41, scope: !180)
!294 = !DILocation(line: 167, column: 57, scope: !180)
!295 = !DILocation(line: 167, column: 84, scope: !180)
!296 = !DILocation(line: 167, column: 2, scope: !180)
!297 = !DILocation(line: 168, column: 9, scope: !180)
!298 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !13, file: !13, line: 16, type: !299, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !55}
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !302, identifier: "TestUnit[]")
!302 = !{!303, !311}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !301, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !305, size: 64, align: 64, dwarfAddressSpace: 0)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !13, file: !13, line: 10, size: 192, align: 64, elements: !306, identifier: "std.core.runtime.TestUnit")
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !13, line: 12, baseType: !41, size: 128, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !305, file: !13, line: 13, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !13, file: !13, line: 8, baseType: !310, align: 8)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !301, baseType: !48, size: 64, align: 64, offset: 64)
!312 = !DILocalVariable(name: "allocator", arg: 1, scope: !298, file: !13, line: 16, type: !55)
!313 = !DILocation(line: 16, column: 48, scope: !298)
!314 = !DILocalVariable(name: "fns", scope: !298, file: !13, line: 18, type: !315, align: 8)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !316, identifier: "TestFn[]")
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !315, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !309, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !315, baseType: !48, size: 64, align: 64, offset: 64)
!320 = !DILocation(line: 18, column: 11, scope: !298)
!321 = !DILocation(line: 18, column: 17, scope: !298)
!322 = !DILocalVariable(name: "names", scope: !298, file: !13, line: 19, type: !73, align: 8)
!323 = !DILocation(line: 19, column: 11, scope: !298)
!324 = !DILocation(line: 19, column: 19, scope: !298)
!325 = !DILocalVariable(name: "tests", scope: !298, file: !13, line: 20, type: !301, align: 8)
!326 = !DILocation(line: 20, column: 13, scope: !298)
!327 = !DILocation(line: 20, column: 65, scope: !298)
!328 = !DILocation(line: 286, column: 55, scope: !329, inlinedAt: !330)
!329 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !85, file: !85, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!330 = !DILocation(line: 269, column: 9, scope: !331, inlinedAt: !332)
!331 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !85, file: !85, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!332 = !DILocation(line: 20, column: 21, scope: !298)
!333 = !DILocation(line: 286, column: 40, scope: !329, inlinedAt: !330)
!334 = !DILocation(line: 62, column: 6, scope: !335, inlinedAt: !336)
!335 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !85, file: !85, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!336 = !DILocation(line: 286, column: 18, scope: !329, inlinedAt: !330)
!337 = !DILocation(line: 62, column: 20, scope: !335, inlinedAt: !336)
!338 = !DILocation(line: 28, column: 71, scope: !339, inlinedAt: !340)
!339 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !85, file: !85, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !29)
!340 = !DILocation(line: 68, column: 10, scope: !335, inlinedAt: !336)
!341 = !DILocation(line: 286, column: 67, scope: !329, inlinedAt: !330)
!342 = !DILocation(line: 21, column: 21, scope: !343)
!343 = distinct !DILexicalBlock(scope: !298, file: !13, line: 21, column: 2)
!344 = !DILocalVariable(name: ".temp", scope: !343, file: !13, line: 21, type: !48, align: 8)
!345 = !DILocation(line: 21, column: 11, scope: !343)
!346 = !DILocalVariable(name: "i", scope: !347, file: !13, line: 21, type: !48, align: 8)
!347 = distinct !DILexicalBlock(scope: !343, file: !13, line: 22, column: 2)
!348 = !DILocation(line: 21, column: 11, scope: !347)
!349 = !DILocalVariable(name: "test", scope: !347, file: !13, line: 21, type: !310, align: 8)
!350 = !DILocation(line: 21, column: 14, scope: !347)
!351 = !DILocation(line: 21, column: 21, scope: !347)
!352 = !DILocation(line: 23, column: 3, scope: !353)
!353 = distinct !DILexicalBlock(scope: !347, file: !13, line: 22, column: 2)
!354 = !DILocation(line: 23, column: 9, scope: !353)
!355 = !DILocation(line: 23, column: 16, scope: !353)
!356 = !DILocation(line: 23, column: 22, scope: !353)
!357 = !DILocation(line: 23, column: 26, scope: !353)
!358 = !DILocation(line: 23, column: 30, scope: !353)
!359 = !DILocation(line: 25, column: 9, scope: !298)
!360 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !13, file: !13, line: 34, type: !361, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !29, retainedNodes: !61)
!361 = !DISubroutineType(types: !362)
!362 = !{!3, !305, !305}
!363 = !DILocalVariable(name: "a", arg: 1, scope: !360, file: !13, line: 34, type: !305)
!364 = !DILocation(line: 34, column: 31, scope: !360)
!365 = !DILocalVariable(name: "b", arg: 2, scope: !360, file: !13, line: 34, type: !305)
!366 = !DILocation(line: 34, column: 43, scope: !360)
!367 = !DILocalVariable(name: "an", scope: !360, file: !13, line: 36, type: !48, align: 8)
!368 = !DILocation(line: 36, column: 6, scope: !360)
