; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%TempState = type { ptr, ptr, i64 }
%"any[]" = type { ptr, i64 }

@"$ct.std.core.mem.TempState" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, align 8
@.enum.NOT_ATOMIC = internal constant [11 x i8] c"NOT_ATOMIC\00", align 1
@.enum.UNORDERED = internal constant [10 x i8] c"UNORDERED\00", align 1
@.enum.RELAXED = internal constant [8 x i8] c"RELAXED\00", align 1
@.enum.ACQUIRE = internal constant [8 x i8] c"ACQUIRE\00", align 1
@.enum.RELEASE = internal constant [8 x i8] c"RELEASE\00", align 1
@.enum.ACQUIRE_RELEASE = internal constant [16 x i8] c"ACQUIRE_RELEASE\00", align 1
@.enum.SEQ_CONSISTENT = internal constant [15 x i8] c"SEQ_CONSISTENT\00", align 1
@"$ct.int" = linkonce global %.introspect { i8 2, i64 0, ptr null, i64 4, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 9, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 2, !"wchar_size", i32 4}
!10 = !{i32 4, !"PIC Level", i32 2}
!11 = !{i32 1, !"uwtable", i32 1}
!12 = !{i32 2, !"frame-pointer", i32 1}
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !14, splitDebugInlining: false)
!14 = !{!0, !4}
!15 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 281, type: !16, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19, !19}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !19)
!19 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!20 = !{}
!21 = !DILocalVariable(name: "offset", arg: 1, scope: !15, file: !2, line: 281, type: !18)
!22 = !DILocation(line: 281, column: 27, scope: !15)
!23 = !DILocalVariable(name: "alignment", arg: 2, scope: !15, file: !2, line: 281, type: !18)
!24 = !DILocation(line: 281, column: 39, scope: !15)
!25 = !DILocation(line: 1021, column: 9, scope: !26, inlinedAt: !28)
!26 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !27, file: !27, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!27 = !DIFile(filename: "math.c3", directory: "/opt/homebrew/lib/c3/std/math")
!28 = !DILocation(line: 279, column: 11, scope: !29)
!29 = distinct !DILexicalBlock(scope: !15, file: !2, line: 282, column: 1)
!30 = !DILocation(line: 1021, column: 20, scope: !26, inlinedAt: !28)
!31 = !DILocation(line: 1021, column: 25, scope: !26, inlinedAt: !28)
!32 = !DILocation(line: 283, column: 9, scope: !15)
!33 = !DILocation(line: 283, column: 23, scope: !15)
!34 = !DILocation(line: 283, column: 32, scope: !15)
!35 = !DILocation(line: 283, column: 49, scope: !15)
!36 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 294, type: !37, scopeLine: 294, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !40, !19}
!39 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DILocalVariable(name: "ptr", arg: 1, scope: !36, file: !2, line: 294, type: !40)
!42 = !DILocation(line: 294, column: 30, scope: !36)
!43 = !DILocalVariable(name: "alignment", arg: 2, scope: !36, file: !2, line: 294, type: !18)
!44 = !DILocation(line: 294, column: 39, scope: !36)
!45 = !DILocation(line: 1021, column: 9, scope: !46, inlinedAt: !47)
!46 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !27, file: !27, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!47 = !DILocation(line: 292, column: 11, scope: !48)
!48 = distinct !DILexicalBlock(scope: !36, file: !2, line: 295, column: 1)
!49 = !DILocation(line: 1021, column: 20, scope: !46, inlinedAt: !47)
!50 = !DILocation(line: 1021, column: 25, scope: !46, inlinedAt: !47)
!51 = !DILocation(line: 296, column: 10, scope: !36)
!52 = !DILocation(line: 296, column: 23, scope: !36)
!53 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 565, type: !54, scopeLine: 565, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !59}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempState", scope: !2, file: !2, line: 556, size: 192, align: 64, elements: !57, identifier: "std.core.mem.TempState")
!57 = !{!58, !85, !86}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !56, file: !2, line: 558, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !61, identifier: "std.core.mem.allocator.TempAllocator")
!61 = !{!62, !68, !82, !83, !84}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !60, file: !2, line: 12, baseType: !63, size: 128, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !64, identifier: "Allocator")
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !63, baseType: !40, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !60, file: !2, line: 13, baseType: !69, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !71, identifier: "std.core.mem.allocator.TempAllocatorPage")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !70, file: !2, line: 24, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !70, file: !2, line: 25, baseType: !40, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !70, file: !2, line: 26, baseType: !18, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !2, line: 27, baseType: !18, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !70, file: !2, line: 28, baseType: !18, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !2, line: 29, baseType: !78, align: 8, offset: 320)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, align: 8, elements: !80)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !{!81}
!81 = !DISubrange(count: 0, lowerBound: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !60, file: !2, line: 14, baseType: !18, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !60, file: !2, line: 15, baseType: !18, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !2, line: 16, baseType: !78, align: 8, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !56, file: !2, line: 559, baseType: !59, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !56, file: !2, line: 560, baseType: !18, size: 64, align: 64, offset: 128)
!87 = !DILocalVariable(name: "other", arg: 1, scope: !53, file: !2, line: 565, type: !59)
!88 = !DILocation(line: 565, column: 39, scope: !53)
!89 = !DILocalVariable(name: "current", scope: !53, file: !2, line: 567, type: !59, align: 8)
!90 = !DILocation(line: 567, column: 17, scope: !53)
!91 = !DILocation(line: 396, column: 6, scope: !92, inlinedAt: !94)
!92 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !93, file: !93, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!93 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!94 = !DILocation(line: 567, column: 27, scope: !53)
!95 = !DILocation(line: 398, column: 3, scope: !96, inlinedAt: !94)
!96 = distinct !DILexicalBlock(scope: !92, file: !93, line: 397, column: 2)
!97 = !DILocation(line: 400, column: 9, scope: !92, inlinedAt: !94)
!98 = !DILocalVariable(name: "old", scope: !53, file: !2, line: 568, type: !59, align: 8)
!99 = !DILocation(line: 568, column: 17, scope: !53)
!100 = !DILocation(line: 568, column: 23, scope: !53)
!101 = !DILocation(line: 569, column: 6, scope: !53)
!102 = !DILocation(line: 569, column: 15, scope: !53)
!103 = !DILocation(line: 571, column: 13, scope: !104)
!104 = distinct !DILexicalBlock(scope: !53, file: !2, line: 570, column: 2)
!105 = !DILocation(line: 573, column: 11, scope: !53)
!106 = !DILocation(line: 573, column: 16, scope: !53)
!107 = !DILocation(line: 573, column: 25, scope: !53)
!108 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 579, type: !109, scopeLine: 579, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !56}
!111 = !DILocalVariable(name: "old_state", arg: 1, scope: !108, file: !2, line: 579, type: !56)
!112 = !DILocation(line: 579, column: 28, scope: !108)
!113 = !DILocation(line: 581, column: 9, scope: !108)
!114 = !DILocation(line: 581, column: 45, scope: !108)
!115 = !DILocation(line: 582, column: 9, scope: !108)
!116 = !DILocation(line: 582, column: 35, scope: !108)
!117 = !DILocation(line: 583, column: 2, scope: !108)
!118 = !DILocation(line: 583, column: 26, scope: !108)
!119 = !DILocation(line: 584, column: 37, scope: !108)
!120 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 650, type: !121, scopeLine: 650, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !20)
!121 = !DISubroutineType(types: !122)
!122 = !{!40, !19}
!123 = !DILocalVariable(name: "size", arg: 1, scope: !120, file: !2, line: 650, type: !18)
!124 = !DILocation(line: 650, column: 21, scope: !120)
!125 = !DILocation(line: 62, column: 6, scope: !126, inlinedAt: !127)
!126 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !93, file: !93, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!127 = !DILocation(line: 57, column: 9, scope: !128, inlinedAt: !129)
!128 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !93, file: !93, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!129 = !DILocation(line: 652, column: 9, scope: !120)
!130 = !DILocation(line: 62, column: 20, scope: !126, inlinedAt: !127)
!131 = !DILocation(line: 28, column: 71, scope: !132, inlinedAt: !133)
!132 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !93, file: !93, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!133 = !DILocation(line: 68, column: 10, scope: !126, inlinedAt: !127)
