; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@std.core.mem.allocator.thread_temp_allocator = extern_weak thread_local global ptr, align 8
@"std.core.builtin.SearchResult$MISSING" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.builtin.SearchResult" to i64), %"char[]" { ptr @.fault, i64 7 }, i64 1 }, align 8
@.fault = internal constant [8 x i8] c"MISSING\00", align 1
@"$ct.std.core.builtin.SearchResult" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.core.mem.allocator.TempAllocator" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 40, i64 0, i64 5, [0 x i64] zeroinitializer }, align 8
@.func.1 = internal constant [8 x i8] c"set_var\00", align 1
@std.core.mem.allocator.thread_allocator = extern_weak thread_local global %any, align 8
@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIR", linkageName: "new_get_config_dir.DIR", scope: !2, file: !2, line: 103, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "/opt/homebrew/lib/c3/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 2, !"wchar_size", i32 4}
!15 = !{i32 4, !"PIC Level", i32 2}
!16 = !{i32 1, !"uwtable", i32 1}
!17 = !{i32 2, !"frame-pointer", i32 1}
!18 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, globals: !29, splitDebugInlining: false)
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !21, file: !2, line: 26, baseType: !25, size: 32, align: 32, elements: !26)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !22, identifier: "std.io.path.PathImp")
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !21, file: !2, line: 22, baseType: !3, size: 128, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !21, file: !2, line: 23, baseType: !20, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "WIN32", value: 0)
!28 = !DIEnumerator(name: "POSIX", value: 1)
!29 = !{!0}
!30 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !31, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !42)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !3, !36}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !34)
!34 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !37, identifier: "Allocator")
!37 = !{!38, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !36, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!42 = !{}
!43 = !DILocalVariable(name: "name", arg: 1, scope: !30, file: !2, line: 12, type: !3)
!44 = !DILocation(line: 12, column: 27, scope: !30)
!45 = !DILocalVariable(name: "allocator", arg: 2, scope: !30, file: !2, line: 12, type: !36)
!46 = !DILocation(line: 12, column: 43, scope: !30)
!47 = !DILocation(line: 9, column: 11, scope: !48)
!48 = distinct !DILexicalBlock(scope: !30, file: !2, line: 13, column: 1)
!49 = !DILocalVariable(name: "current", scope: !50, file: !2, line: 592, type: !52, align: 8)
!50 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !51, file: !51, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !42)
!51 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !54, identifier: "std.core.mem.allocator.TempAllocator")
!54 = !{!55, !56, !69, !70, !71}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !53, file: !2, line: 12, baseType: !36, size: 128, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !53, file: !2, line: 13, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !59, identifier: "std.core.mem.allocator.TempAllocatorPage")
!59 = !{!60, !61, !62, !63, !64, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !58, file: !2, line: 24, baseType: !57, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !58, file: !2, line: 25, baseType: !39, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !58, file: !2, line: 26, baseType: !10, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !2, line: 27, baseType: !10, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !58, file: !2, line: 28, baseType: !10, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !2, line: 29, baseType: !66, align: 8, offset: 320)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 0, lowerBound: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !53, file: !2, line: 14, baseType: !10, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !53, file: !2, line: 15, baseType: !10, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !2, line: 16, baseType: !66, align: 8, offset: 320)
!72 = !DILocation(line: 592, column: 17, scope: !50, inlinedAt: !73)
!73 = !DILocation(line: 14, column: 2, scope: !30)
!74 = !DILocation(line: 396, column: 6, scope: !75, inlinedAt: !77)
!75 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !76, file: !76, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18)
!76 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!77 = !DILocation(line: 592, column: 27, scope: !50, inlinedAt: !73)
!78 = !DILocation(line: 398, column: 3, scope: !79, inlinedAt: !77)
!79 = distinct !DILexicalBlock(scope: !75, file: !76, line: 397, column: 2)
!80 = !DILocation(line: 400, column: 9, scope: !75, inlinedAt: !77)
!81 = !DILocalVariable(name: "original", scope: !50, file: !2, line: 594, type: !52, align: 8)
!82 = !DILocation(line: 594, column: 18, scope: !50, inlinedAt: !73)
!83 = !DILocation(line: 594, column: 29, scope: !50, inlinedAt: !73)
!84 = !DILocation(line: 595, column: 7, scope: !50, inlinedAt: !73)
!85 = !DILocation(line: 595, column: 18, scope: !50, inlinedAt: !73)
!86 = !DILocation(line: 595, column: 45, scope: !50, inlinedAt: !73)
!87 = !DILocalVariable(name: "mark", scope: !50, file: !2, line: 597, type: !10, align: 8)
!88 = !DILocation(line: 597, column: 6, scope: !50, inlinedAt: !73)
!89 = !DILocation(line: 597, column: 13, scope: !50, inlinedAt: !73)
!90 = !DILocalVariable(name: "val", scope: !91, file: !2, line: 18, type: !92, align: 8)
!91 = distinct !DILexicalBlock(scope: !30, file: !2, line: 15, column: 2)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !7, align: 8)
!93 = !DILocation(line: 18, column: 11, scope: !91)
!94 = !DILocation(line: 18, column: 30, scope: !91)
!95 = !DILocation(line: 18, column: 17, scope: !91)
!96 = !DILocation(line: 19, column: 10, scope: !91)
!97 = !DILocation(line: 19, column: 25, scope: !91)
!98 = !DILocation(line: 19, column: 16, scope: !91)
!99 = !DILocation(line: 19, column: 38, scope: !91)
!100 = !DILocation(line: 600, column: 17, scope: !101, inlinedAt: !73)
!101 = distinct !DILexicalBlock(scope: !50, file: !51, line: 599, column: 2)
!102 = !DILocation(line: 600, column: 3, scope: !101, inlinedAt: !73)
!103 = !DILocation(line: 602, column: 39, scope: !101, inlinedAt: !73)
!104 = !DILocation(line: 603, column: 9, scope: !101, inlinedAt: !73)
!105 = !DILocation(line: 600, column: 17, scope: !106, inlinedAt: !73)
!106 = distinct !DILexicalBlock(scope: !50, file: !51, line: 599, column: 2)
!107 = !DILocation(line: 600, column: 3, scope: !106, inlinedAt: !73)
!108 = !DILocation(line: 602, column: 39, scope: !106, inlinedAt: !73)
!109 = !DILocation(line: 603, column: 9, scope: !106, inlinedAt: !73)
!110 = distinct !DISubprogram(name: "get_var_temp", linkageName: "std.os.env.get_var_temp", scope: !2, file: !2, line: 39, type: !111, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !42)
!111 = !DISubroutineType(types: !112)
!112 = !{!33, !35, !3}
!113 = !DILocalVariable(name: "name", arg: 1, scope: !110, file: !2, line: 39, type: !3)
!114 = !DILocation(line: 39, column: 32, scope: !110)
!115 = !DILocation(line: 396, column: 6, scope: !116, inlinedAt: !117)
!116 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !76, file: !76, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18)
!117 = !DILocation(line: 41, column: 23, scope: !110)
!118 = !DILocation(line: 398, column: 3, scope: !119, inlinedAt: !117)
!119 = distinct !DILexicalBlock(scope: !116, file: !76, line: 397, column: 2)
!120 = !DILocation(line: 400, column: 9, scope: !116, inlinedAt: !117)
!121 = !DILocation(line: 41, column: 9, scope: !110)
