; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"void*[]", [6 x i64] }
%NativeMutex = type { [8 x i64], i8 }
%"QueueItem[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%QueueItem = type { ptr, %"any[]" }

@"std.thread.threadpool.ThreadPoolResult$QUEUE_FULL" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.thread.threadpool.ThreadPoolResult" to i64), %"char[]" { ptr @.fault, i64 10 }, i64 1 }, align 8
@.fault = internal constant [11 x i8] c"QUEUE_FULL\00", align 1
@"$ct.std.thread.threadpool.ThreadPoolResult" = linkonce global %.introspect { i8 9, i64 0, ptr null, i64 8, i64 0, i64 1, [0 x i64] zeroinitializer }, align 8
@"$ct.std.thread.threadpool.FixedThreadPool" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 176, i64 0, i64 7, [0 x i64] zeroinitializer }, align 8
@"$ct.std.thread.threadpool.QueueItem" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 2, [0 x i64] zeroinitializer }, align 8
@"$ct.anyfault" = linkonce global %.introspect { i8 6, i64 0, ptr null, i64 8, i64 0, i64 0, [0 x i64] zeroinitializer }, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIC Level", i32 2}
!4 = !{i32 1, !"uwtable", i32 1}
!5 = !{i32 2, !"frame-pointer", i32 1}
!6 = distinct !DICompileUnit(language: DW_LANG_C11, file: !7, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!7 = !DIFile(filename: "fixed_pool.c3", directory: "/opt/homebrew/lib/c3/std/threads")
!8 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !7, file: !7, line: 39, type: !9, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !72)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !13, !14, !24, !24}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !12)
!12 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !7, file: !7, line: 13, size: 1408, align: 64, elements: !16, identifier: "std.thread.threadpool.FixedThreadPool")
!16 = !{!17, !29, !54, !55, !56, !58, !66}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !15, file: !7, line: 15, baseType: !18, size: 576, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !7, file: !7, line: 11, baseType: !19, align: 8)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !7, file: !7, line: 4, size: 576, align: 64, elements: !20, identifier: "std.thread.os.NativeMutex")
!20 = !{!21, !27}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !19, file: !7, line: 6, baseType: !22, size: 512, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_mutex_t", scope: !7, file: !7, line: 96, baseType: !23, align: 8)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, align: 64, elements: !25)
!24 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!26}
!26 = !DISubrange(count: 8, lowerBound: 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !19, file: !7, line: 7, baseType: !28, size: 8, align: 8, offset: 512)
!28 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !15, file: !7, line: 16, baseType: !30, size: 128, align: 64, offset: 576)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !31, identifier: "QueueItem[]")
!31 = !{!32, !53}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !30, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !7, file: !7, line: 28, size: 192, align: 64, elements: !35, identifier: "std.thread.threadpool.QueueItem")
!35 = !{!36, !52}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !34, file: !7, line: 30, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !7, file: !7, line: 11, baseType: !38, align: 8)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !39, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41}
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !42, identifier: "any[]")
!42 = !{!43, !50}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !41, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !46, identifier: "any")
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !45, baseType: !13, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !41, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !24)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !34, file: !7, line: 31, baseType: !41, size: 128, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !30, baseType: !51, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !15, file: !7, line: 17, baseType: !51, size: 64, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !15, file: !7, line: 18, baseType: !51, size: 64, align: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, scope: !15, file: !7, line: 19, baseType: !57, size: 8, align: 8, offset: 832)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !15, file: !7, line: 24, baseType: !59, size: 128, align: 64, offset: 896)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !60, identifier: "Thread[]")
!60 = !{!61, !65}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !59, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !63, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !7, file: !7, line: 16, baseType: !64, align: 8)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_t", scope: !7, file: !7, line: 10, baseType: !13, align: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !59, baseType: !51, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !15, file: !7, line: 25, baseType: !67, size: 384, align: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !7, file: !7, line: 15, baseType: !68, align: 8)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_cond_t", scope: !7, file: !7, line: 93, baseType: !69, align: 8)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 384, align: 64, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 6, lowerBound: 0)
!72 = !{}
!73 = !DILocation(line: 40, column: 1, scope: !8)
!74 = !DILocalVariable(name: "self", arg: 1, scope: !8, file: !7, line: 39, type: !14)
!75 = !DILocation(line: 39, column: 31, scope: !8)
!76 = !DILocalVariable(name: "threads", arg: 2, scope: !8, file: !7, line: 39, type: !51)
!77 = !DILocation(line: 39, column: 42, scope: !8)
!78 = !DILocalVariable(name: "queue_size", arg: 3, scope: !8, file: !7, line: 39, type: !51)
!79 = !DILocation(line: 39, column: 55, scope: !8)
!80 = !DILocation(line: 35, column: 12, scope: !81)
!81 = distinct !DILexicalBlock(scope: !8, file: !7, line: 40, column: 1)
!82 = !DILocation(line: 35, column: 11, scope: !81)
!83 = !DILocation(line: 36, column: 11, scope: !81)
!84 = !DILocation(line: 36, column: 26, scope: !81)
!85 = !DILocation(line: 37, column: 11, scope: !81)
!86 = !DILocation(line: 41, column: 6, scope: !8)
!87 = !DILocation(line: 41, column: 36, scope: !8)
!88 = !DILocation(line: 43, column: 9, scope: !8)
!89 = !DILocation(line: 44, column: 3, scope: !8)
!90 = !DILocation(line: 45, column: 18, scope: !8)
!91 = !DILocation(line: 46, column: 18, scope: !8)
!92 = !DILocation(line: 286, column: 55, scope: !93, inlinedAt: !95)
!93 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !94, file: !94, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!94 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!95 = !DILocation(line: 269, column: 9, scope: !96, inlinedAt: !97)
!96 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !94, file: !94, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!97 = !DILocation(line: 763, column: 9, scope: !98, inlinedAt: !100)
!98 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !99, file: !99, line: 761, scopeLine: 761, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!99 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!100 = !DILocation(line: 47, column: 12, scope: !8)
!101 = !DILocation(line: 286, column: 40, scope: !93, inlinedAt: !95)
!102 = !DILocation(line: 62, column: 6, scope: !103, inlinedAt: !104)
!103 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !94, file: !94, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!104 = !DILocation(line: 286, column: 18, scope: !93, inlinedAt: !95)
!105 = !DILocation(line: 62, column: 20, scope: !103, inlinedAt: !104)
!106 = !DILocation(line: 28, column: 71, scope: !107, inlinedAt: !108)
!107 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !94, file: !94, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!108 = !DILocation(line: 68, column: 10, scope: !103, inlinedAt: !104)
!109 = !DILocation(line: 286, column: 67, scope: !93, inlinedAt: !95)
!110 = !DILocation(line: 252, column: 55, scope: !111, inlinedAt: !112)
!111 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !94, file: !94, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !6)
!112 = !DILocation(line: 244, column: 9, scope: !113, inlinedAt: !114)
