; ModuleID = 'std::compression::qoi'
source_filename = "std::compression::qoi"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%File = type { ptr }
%"any[]" = type { ptr, i64 }
%Header = type <{ i32, i32, i32, i8, i8 }>
%OpRGBA = type { i8, i8, i8, i8, i8 }
%OpRGB = type { i8, i8, i8, i8 }

@"$ct.std.compression.qoi.QOIDesc" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 12, i64 0, i64 4, [0 x i64] zeroinitializer }, align 8
@"std.compression.qoi.QOIError$INVALID_PARAMETERS" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.compression.qoi.QOIError" to i64), %"char[]" { ptr @.fault, i64 18 }, i64 1 }, align 8
@.fault = internal constant [19 x i8] c"INVALID_PARAMETERS\00", align 1
@"std.compression.qoi.QOIError$FILE_OPEN_FAILED" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.compression.qoi.QOIError" to i64), %"char[]" { ptr @.fault.1, i64 16 }, i64 2 }, align 8
@.fault.1 = internal constant [17 x i8] c"FILE_OPEN_FAILED\00", align 1
@"std.compression.qoi.QOIError$FILE_WRITE_FAILED" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.compression.qoi.QOIError" to i64), %"char[]" { ptr @.fault.2, i64 17 }, i64 3 }, align 8
@.fault.2 = internal constant [18 x i8] c"FILE_WRITE_FAILED\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PIXELS_MAX", linkageName: "std.compression.qoi.PIXELS_MAX", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "qoi.c3", directory: "/opt/homebrew/lib/c3/std/compression")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OP_RGB", linkageName: "std.compression.qoi.OP_RGB", scope: !2, file: !2, line: 393, type: !6, isLocal: true, isDefinition: true, align: 1)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "OP_RGBA", linkageName: "std.compression.qoi.OP_RGBA", scope: !2, file: !2, line: 394, type: !6, isLocal: true, isDefinition: true, align: 1)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "OP_INDEX", linkageName: "std.compression.qoi.OP_INDEX", scope: !2, file: !2, line: 396, type: !6, isLocal: true, isDefinition: true, align: 1)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "OP_DIFF", linkageName: "std.compression.qoi.OP_DIFF", scope: !2, file: !2, line: 397, type: !6, isLocal: true, isDefinition: true, align: 1)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "OP_LUMA", linkageName: "std.compression.qoi.OP_LUMA", scope: !2, file: !2, line: 398, type: !6, isLocal: true, isDefinition: true, align: 1)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "OP_RUN", linkageName: "std.compression.qoi.OP_RUN", scope: !2, file: !2, line: 399, type: !6, isLocal: true, isDefinition: true, align: 1)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "END_OF_STREAM", linkageName: "std.compression.qoi.END_OF_STREAM", scope: !2, file: !2, line: 412, type: !19, isLocal: true, isDefinition: true, align: 1)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 8, lowerBound: 0)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 2, !"wchar_size", i32 4}
!25 = !{i32 4, !"PIC Level", i32 2}
!26 = !{i32 1, !"uwtable", i32 1}
!27 = !{i32 2, !"frame-pointer", i32 1}
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, globals: !45, splitDebugInlining: false)
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIChannels", scope: !31, file: !2, line: 22, baseType: !6, size: 8, align: 8, elements: !41)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QOIDesc", scope: !2, file: !2, line: 33, size: 96, align: 32, elements: !32, identifier: "std.compression.qoi.QOIDesc")
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !31, file: !2, line: 35, baseType: !3, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !31, file: !2, line: 36, baseType: !3, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !2, line: 37, baseType: !30, size: 8, align: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !31, file: !2, line: 38, baseType: !37, size: 8, align: 8, offset: 72)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "QOIColorspace", scope: !31, file: !2, line: 10, baseType: !6, size: 8, align: 8, elements: !38)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "SRGB", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "LINEAR", value: 1, isUnsigned: true)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "AUTO", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "RGB", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "RGBA", value: 2, isUnsigned: true)
!45 = !{!0, !4, !7, !9, !11, !13, !15, !17}
!46 = distinct !DISubprogram(name: "write", linkageName: "std.compression.qoi.write", scope: !2, file: !2, line: 74, type: !47, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !54, !55, !60}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !50)
!50 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !53)
!53 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !56, identifier: "char[]")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, baseType: !52, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QOIDesc*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !{}
!62 = !DILocalVariable(name: "filename", arg: 1, scope: !46, file: !2, line: 74, type: !54)
!63 = !DILocation(line: 74, column: 22, scope: !46)
!64 = !DILocalVariable(name: "input", arg: 2, scope: !46, file: !2, line: 74, type: !55)
!65 = !DILocation(line: 74, column: 39, scope: !46)
!66 = !DILocalVariable(name: "desc", arg: 3, scope: !46, file: !2, line: 74, type: !60)
!67 = !DILocation(line: 74, column: 55, scope: !46)
!68 = !DILocalVariable(name: "current", scope: !69, file: !2, line: 592, type: !71, align: 8)
!69 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !70, file: !70, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!70 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !72, size: 64, align: 64, dwarfAddressSpace: 0)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !73, identifier: "std.core.mem.allocator.TempAllocator")
!73 = !{!74, !81, !94, !95, !96}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !72, file: !2, line: 12, baseType: !75, size: 128, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !76, identifier: "Allocator")
!76 = !{!77, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !75, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !72, file: !2, line: 13, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !84, identifier: "std.core.mem.allocator.TempAllocatorPage")
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !83, file: !2, line: 24, baseType: !82, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !83, file: !2, line: 25, baseType: !78, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !83, file: !2, line: 26, baseType: !52, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !2, line: 27, baseType: !52, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !83, file: !2, line: 28, baseType: !52, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !2, line: 29, baseType: !91, align: 8, offset: 320)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 0, lowerBound: 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !72, file: !2, line: 14, baseType: !52, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !72, file: !2, line: 15, baseType: !52, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !2, line: 16, baseType: !91, align: 8, offset: 320)
!97 = !DILocation(line: 592, column: 17, scope: !69, inlinedAt: !98)
!98 = !DILocation(line: 76, column: 2, scope: !46)
!99 = !DILocation(line: 396, column: 6, scope: !100, inlinedAt: !102)
!100 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !101, file: !101, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!101 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!102 = !DILocation(line: 592, column: 27, scope: !69, inlinedAt: !98)
!103 = !DILocation(line: 398, column: 3, scope: !104, inlinedAt: !102)
!104 = distinct !DILexicalBlock(scope: !100, file: !101, line: 397, column: 2)
!105 = !DILocation(line: 400, column: 9, scope: !100, inlinedAt: !102)
!106 = !DILocalVariable(name: "mark", scope: !69, file: !2, line: 597, type: !52, align: 8)
!107 = !DILocation(line: 597, column: 6, scope: !69, inlinedAt: !98)
!108 = !DILocation(line: 597, column: 13, scope: !69, inlinedAt: !98)
!109 = !DILocalVariable(name: "output", scope: !110, file: !2, line: 78, type: !55, align: 8)
!110 = distinct !DILexicalBlock(scope: !46, file: !2, line: 76, column: 10)
!111 = !DILocation(line: 78, column: 10, scope: !110)
!112 = !DILocation(line: 78, column: 19, scope: !110)
!113 = !DILocation(line: 600, column: 17, scope: !114, inlinedAt: !98)
!114 = distinct !DILexicalBlock(scope: !69, file: !70, line: 599, column: 2)
!115 = !DILocation(line: 600, column: 3, scope: !114, inlinedAt: !98)
!116 = !DILocation(line: 603, column: 9, scope: !114, inlinedAt: !98)
!117 = !DILocalVariable(name: "f", scope: !110, file: !2, line: 81, type: !118, align: 8)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !119, identifier: "std.io.File")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !118, file: !2, line: 6, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 356, baseType: !78, align: 8)
!122 = !DILocation(line: 81, column: 9, scope: !110)
!123 = !DILocation(line: 81, column: 13, scope: !110)
!124 = !DILocation(line: 82, column: 13, scope: !110)
!125 = !DILocation(line: 600, column: 17, scope: !126, inlinedAt: !98)
!126 = distinct !DILexicalBlock(scope: !69, file: !70, line: 599, column: 2)
!127 = !DILocation(line: 600, column: 3, scope: !126, inlinedAt: !98)
!128 = !DILocation(line: 603, column: 9, scope: !126, inlinedAt: !98)
!129 = !DILocalVariable(name: "written", scope: !110, file: !2, line: 85, type: !53, align: 8)
!130 = !DILocation(line: 85, column: 8, scope: !110)
!131 = !DILocation(line: 85, column: 18, scope: !110)
!132 = !DILocation(line: 86, column: 13, scope: !110)
!133 = !DILocation(line: 600, column: 17, scope: !134, inlinedAt: !98)
!134 = distinct !DILexicalBlock(scope: !69, file: !70, line: 599, column: 2)
!135 = !DILocation(line: 600, column: 3, scope: !134, inlinedAt: !98)
!136 = !DILocation(line: 603, column: 9, scope: !134, inlinedAt: !98)
!137 = !DILocation(line: 87, column: 13, scope: !110)
!138 = !DILocation(line: 600, column: 17, scope: !139, inlinedAt: !98)
!139 = distinct !DILexicalBlock(scope: !69, file: !70, line: 599, column: 2)
!140 = !DILocation(line: 600, column: 3, scope: !139, inlinedAt: !98)
!141 = !DILocation(line: 603, column: 9, scope: !139, inlinedAt: !98)
!142 = !DILocation(line: 89, column: 10, scope: !110)
!143 = !DILocation(line: 600, column: 17, scope: !144, inlinedAt: !98)
!144 = distinct !DILexicalBlock(scope: !69, file: !70, line: 599, column: 2)
!145 = !DILocation(line: 600, column: 3, scope: !144, inlinedAt: !98)
!146 = !DILocation(line: 603, column: 9, scope: !144, inlinedAt: !98)
!147 = distinct !DISubprogram(name: "read", linkageName: "std.compression.qoi.read", scope: !2, file: !2, line: 115, type: !148, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!148 = !DISubroutineType(types: !149)
!149 = !{!49, !150, !54, !60, !30, !75}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char[]*", baseType: !55, size: 64, align: 64, dwarfAddressSpace: 0)
!151 = !DILocalVariable(name: "filename", arg: 1, scope: !147, file: !2, line: 115, type: !54)
!152 = !DILocation(line: 115, column: 24, scope: !147)
!153 = !DILocalVariable(name: "desc", arg: 2, scope: !147, file: !2, line: 115, type: !60)
!154 = !DILocation(line: 115, column: 43, scope: !147)
!155 = !DILocalVariable(name: "channels", arg: 3, scope: !147, file: !2, line: 115, type: !30)
!156 = !DILocation(line: 115, column: 61, scope: !147)
!157 = !DILocalVariable(name: "allocator", arg: 4, scope: !147, file: !2, line: 115, type: !75)
!158 = !DILocation(line: 115, column: 88, scope: !147)
!159 = !DILocalVariable(name: "data", scope: !147, file: !2, line: 118, type: !55, align: 8)
!160 = !DILocation(line: 118, column: 10, scope: !147)
!161 = !DILocation(line: 118, column: 17, scope: !147)
!162 = !DILocation(line: 119, column: 12, scope: !147)
!163 = !DILocation(line: 119, column: 25, scope: !147)
!164 = !DILocation(line: 123, column: 9, scope: !147)
!165 = !DILocation(line: 120, column: 18, scope: !166)
!166 = distinct !DILexicalBlock(scope: !147, file: !2, line: 120, column: 8)
!167 = !DILocation(line: 120, column: 8, scope: !166)
!168 = !DILocation(line: 120, column: 18, scope: !169)
!169 = distinct !DILexicalBlock(scope: !147, file: !2, line: 120, column: 8)
!170 = !DILocation(line: 120, column: 8, scope: !169)
!171 = distinct !DISubprogram(name: "encode", linkageName: "std.compression.qoi.encode", scope: !2, file: !2, line: 144, type: !172, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!172 = !DISubroutineType(types: !173)
!173 = !{!49, !150, !55, !60, !75}
!174 = !DILocalVariable(name: "input", arg: 1, scope: !171, file: !2, line: 144, type: !55)
!175 = !DILocation(line: 144, column: 26, scope: !171)
!176 = !DILocalVariable(name: "desc", arg: 2, scope: !171, file: !2, line: 144, type: !60)
!177 = !DILocation(line: 144, column: 42, scope: !171)
!178 = !DILocalVariable(name: "allocator", arg: 3, scope: !171, file: !2, line: 144, type: !75)
!179 = !DILocation(line: 144, column: 58, scope: !171)
!180 = !DILocation(line: 147, column: 6, scope: !171)
!181 = !DILocation(line: 147, column: 25, scope: !171)
!182 = !DILocation(line: 147, column: 50, scope: !171)
!183 = !DILocation(line: 148, column: 6, scope: !171)
!184 = !DILocation(line: 148, column: 36, scope: !171)
!185 = !DILocalVariable(name: "pixels", scope: !171, file: !2, line: 149, type: !3, align: 4)
!186 = !DILocation(line: 149, column: 7, scope: !171)
!187 = !DILocation(line: 149, column: 16, scope: !171)
!188 = !DILocation(line: 149, column: 29, scope: !171)
!189 = !DILocation(line: 150, column: 6, scope: !171)
!190 = !DILocation(line: 150, column: 34, scope: !171)
!191 = !DILocalVariable(name: "image_size", scope: !171, file: !2, line: 153, type: !3, align: 4)
!192 = !DILocation(line: 153, column: 7, scope: !171)
!193 = !DILocation(line: 153, column: 20, scope: !171)
!194 = !DILocation(line: 153, column: 29, scope: !171)
!195 = !DILocation(line: 154, column: 6, scope: !171)
!196 = !DILocation(line: 154, column: 20, scope: !171)
!197 = !DILocation(line: 154, column: 38, scope: !171)
!198 = !DILocalVariable(name: "max_size", scope: !171, file: !2, line: 158, type: !3, align: 4)
!199 = !DILocation(line: 158, column: 7, scope: !171)
!200 = !DILocation(line: 158, column: 34, scope: !171)
!201 = !DILocation(line: 158, column: 18, scope: !171)
!202 = !DILocation(line: 158, column: 43, scope: !171)
!203 = !DILocalVariable(name: "output", scope: !171, file: !2, line: 159, type: !55, align: 8)
!204 = !DILocation(line: 159, column: 9, scope: !171)
!205 = !DILocation(line: 159, column: 58, scope: !171)
!206 = !DILocation(line: 286, column: 55, scope: !207, inlinedAt: !208)
!207 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !101, file: !101, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!208 = !DILocation(line: 269, column: 9, scope: !209, inlinedAt: !210)
!209 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !101, file: !101, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!210 = !DILocation(line: 159, column: 18, scope: !171)
!211 = !DILocation(line: 286, column: 40, scope: !207, inlinedAt: !208)
!212 = !DILocation(line: 62, column: 6, scope: !213, inlinedAt: !214)
!213 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !101, file: !101, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!214 = !DILocation(line: 286, column: 18, scope: !207, inlinedAt: !208)
!215 = !DILocation(line: 62, column: 20, scope: !213, inlinedAt: !214)
!216 = !DILocation(line: 28, column: 71, scope: !217, inlinedAt: !218)
!217 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !101, file: !101, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!218 = !DILocation(line: 68, column: 10, scope: !213, inlinedAt: !214)
!219 = !DILocation(line: 286, column: 67, scope: !207, inlinedAt: !208)
!220 = !DILocation(line: 163, column: 12, scope: !171)
!221 = !DILocation(line: 11, column: 36, scope: !222, inlinedAt: !224)
!222 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!223 = !DIFile(filename: "bits.c3", directory: "/opt/homebrew/lib/c3/std")
!224 = !DILocation(line: 164, column: 15, scope: !171)
!225 = !DILocation(line: 165, column: 21, scope: !171)
!226 = !DILocation(line: 11, column: 36, scope: !227, inlinedAt: !228)
!227 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!228 = !DILocation(line: 165, column: 15, scope: !171)
!229 = !DILocation(line: 166, column: 22, scope: !171)
!230 = !DILocation(line: 11, column: 36, scope: !231, inlinedAt: !232)
!231 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!232 = !DILocation(line: 166, column: 16, scope: !171)
!233 = !DILocation(line: 167, column: 15, scope: !171)
!234 = !DILocation(line: 168, column: 17, scope: !171)
!235 = !DILocalVariable(name: "pos", scope: !171, file: !2, line: 171, type: !3, align: 4)
!236 = !DILocation(line: 171, column: 7, scope: !171)
!237 = !DILocation(line: 171, column: 13, scope: !171)
!238 = !DILocalVariable(name: "loc", scope: !171, file: !2, line: 172, type: !3, align: 4)
!239 = !DILocation(line: 172, column: 7, scope: !171)
!240 = !DILocalVariable(name: "loc_end", scope: !171, file: !2, line: 173, type: !3, align: 4)
!241 = !DILocation(line: 173, column: 7, scope: !171)
!242 = !DILocation(line: 173, column: 17, scope: !171)
!243 = !DILocation(line: 173, column: 30, scope: !171)
!244 = !DILocalVariable(name: "run_length", scope: !171, file: !2, line: 174, type: !6, align: 1)
!245 = !DILocation(line: 174, column: 7, scope: !171)
!246 = !DILocation(line: 174, column: 20, scope: !171)
!247 = !DILocalVariable(name: "palette", scope: !171, file: !2, line: 176, type: !248, align: 4)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2048, align: 32, elements: !253)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", scope: !2, file: !2, line: 423, baseType: !250, align: 4)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, flags: DIFlagVector, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4, lowerBound: 0)
!253 = !{!254}
!254 = !DISubrange(count: 64, lowerBound: 0)
!255 = !DILocation(line: 176, column: 12, scope: !171)
!256 = !DILocalVariable(name: "prev", scope: !171, file: !2, line: 177, type: !249, align: 4)
!257 = !DILocation(line: 177, column: 8, scope: !171)
!258 = !DILocation(line: 177, column: 15, scope: !171)
!259 = !DILocalVariable(name: "p", scope: !171, file: !2, line: 178, type: !249, align: 4)
!260 = !DILocation(line: 178, column: 8, scope: !171)
!261 = !DILocation(line: 178, column: 12, scope: !171)
!262 = !DILocalVariable(name: "diff", scope: !171, file: !2, line: 180, type: !263, align: 4)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 32, align: 8, flags: DIFlagVector, elements: !265)
!264 = !DIBasicType(name: "ichar", size: 8, encoding: DW_ATE_signed_char)
!265 = !{!266}
!266 = !DISubrange(count: 3, lowerBound: 0)
!267 = !DILocation(line: 180, column: 13, scope: !171)
!268 = !DILocalVariable(name: "luma", scope: !171, file: !2, line: 181, type: !263, align: 4)
!269 = !DILocation(line: 181, column: 13, scope: !171)
!270 = !DILocation(line: 184, column: 13, scope: !271)
!271 = distinct !DILexicalBlock(scope: !171, file: !2, line: 184, column: 2)
!272 = !DILocation(line: 184, column: 16, scope: !271)
!273 = !DILocation(line: 184, column: 22, scope: !271)
!274 = !DILocation(line: 187, column: 10, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !2, line: 185, column: 2)
!276 = !DILocation(line: 190, column: 11, scope: !275)
!277 = !DILocation(line: 190, column: 17, scope: !275)
!278 = !DILocation(line: 190, column: 3, scope: !275)
!279 = !DILocation(line: 191, column: 7, scope: !275)
!280 = !DILocation(line: 191, column: 30, scope: !275)
!281 = !DILocation(line: 191, column: 36, scope: !275)
!282 = !DILocation(line: 191, column: 42, scope: !275)
!283 = !DILocation(line: 194, column: 7, scope: !275)
!284 = !DILocation(line: 194, column: 15, scope: !275)
!285 = !DILocation(line: 195, column: 4, scope: !286)
!286 = distinct !DILexicalBlock(scope: !275, file: !2, line: 194, column: 18)
!287 = !DILocation(line: 196, column: 8, scope: !286)
!288 = !DILocation(line: 196, column: 28, scope: !286)
!289 = !DILocation(line: 196, column: 35, scope: !286)
!290 = !DILocalVariable(name: "chunk", scope: !291, file: !2, line: 473, type: !292, align: 8)
!291 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRun*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!293 = !DILocation(line: 473, column: 9, scope: !291, inlinedAt: !294)
!294 = !DILocation(line: 197, column: 6, scope: !295)
!295 = distinct !DILexicalBlock(scope: !286, file: !2, line: 196, column: 44)
!296 = !DILocation(line: 473, column: 25, scope: !291, inlinedAt: !294)
!297 = !DILocation(line: 473, column: 31, scope: !291, inlinedAt: !294)
!298 = !DILocation(line: 474, column: 3, scope: !291, inlinedAt: !294)
!299 = !DILocation(line: 474, column: 2, scope: !291, inlinedAt: !294)
!300 = !DILocation(line: 475, column: 9, scope: !291, inlinedAt: !294)
!301 = !DILocation(line: 197, column: 48, scope: !295)
!302 = !DILocation(line: 198, column: 18, scope: !295)
!303 = !DILocation(line: 202, column: 8, scope: !304)
!304 = distinct !DILexicalBlock(scope: !275, file: !2, line: 200, column: 10)
!305 = !DILocalVariable(name: "chunk", scope: !306, file: !2, line: 473, type: !292, align: 8)
!306 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!307 = !DILocation(line: 473, column: 9, scope: !306, inlinedAt: !308)
!308 = !DILocation(line: 203, column: 6, scope: !309)
!309 = distinct !DILexicalBlock(scope: !304, file: !2, line: 202, column: 24)
!310 = !DILocation(line: 473, column: 25, scope: !306, inlinedAt: !308)
!311 = !DILocation(line: 473, column: 31, scope: !306, inlinedAt: !308)
!312 = !DILocation(line: 474, column: 3, scope: !306, inlinedAt: !308)
!313 = !DILocation(line: 474, column: 2, scope: !306, inlinedAt: !308)
!314 = !DILocation(line: 475, column: 9, scope: !306, inlinedAt: !308)
!315 = !DILocation(line: 203, column: 48, scope: !309)
!316 = !DILocation(line: 204, column: 18, scope: !309)
!317 = !DILocation(line: 425, column: 10, scope: !318, inlinedAt: !319)
!318 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!319 = !DILocation(line: 209, column: 19, scope: !320)
!320 = distinct !DILexicalBlock(scope: !304, file: !2, line: 207, column: 4)
!321 = !DILocation(line: 425, column: 20, scope: !318, inlinedAt: !319)
!322 = !DILocation(line: 425, column: 30, scope: !318, inlinedAt: !319)
!323 = !DILocation(line: 425, column: 40, scope: !318, inlinedAt: !319)
!324 = !DILocation(line: 209, column: 32, scope: !320)
!325 = !DILocation(line: 209, column: 11, scope: !320)
!326 = !DILocalVariable(name: "chunk", scope: !327, file: !2, line: 473, type: !328, align: 8)
!327 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpIndex*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !DILocation(line: 473, column: 9, scope: !327, inlinedAt: !330)
!330 = !DILocation(line: 210, column: 7, scope: !331)
!331 = distinct !DILexicalBlock(scope: !320, file: !2, line: 210, column: 6)
!332 = !DILocation(line: 473, column: 25, scope: !327, inlinedAt: !330)
!333 = !DILocation(line: 473, column: 31, scope: !327, inlinedAt: !330)
!334 = !DILocation(line: 474, column: 3, scope: !327, inlinedAt: !330)
!335 = !DILocation(line: 474, column: 2, scope: !327, inlinedAt: !330)
!336 = !DILocation(line: 475, column: 9, scope: !327, inlinedAt: !330)
!337 = !DILocation(line: 425, column: 10, scope: !338, inlinedAt: !339)
!338 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!339 = !DILocation(line: 212, column: 7, scope: !331)
!340 = !DILocation(line: 425, column: 20, scope: !338, inlinedAt: !339)
!341 = !DILocation(line: 425, column: 30, scope: !338, inlinedAt: !339)
!342 = !DILocation(line: 425, column: 40, scope: !338, inlinedAt: !339)
!343 = !DILocation(line: 216, column: 11, scope: !320)
!344 = !DILocation(line: 216, column: 19, scope: !320)
!345 = !DILocation(line: 216, column: 24, scope: !320)
!346 = !DILocation(line: 216, column: 34, scope: !320)
!347 = !DILocation(line: 218, column: 13, scope: !348)
!348 = distinct !DILexicalBlock(scope: !320, file: !2, line: 218, column: 6)
!349 = !DILocation(line: 218, column: 21, scope: !348)
!350 = !DILocation(line: 220, column: 7, scope: !348)
!351 = !DILocation(line: 220, column: 22, scope: !348)
!352 = !DILocation(line: 221, column: 7, scope: !348)
!353 = !DILocation(line: 221, column: 22, scope: !348)
!354 = !DILocation(line: 222, column: 7, scope: !348)
!355 = !DILocation(line: 222, column: 22, scope: !348)
!356 = !DILocalVariable(name: "chunk", scope: !357, file: !2, line: 473, type: !358, align: 8)
!357 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpDiff*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !DILocation(line: 473, column: 9, scope: !357, inlinedAt: !360)
!360 = !DILocation(line: 224, column: 8, scope: !361)
!361 = distinct !DILexicalBlock(scope: !348, file: !2, line: 223, column: 8)
!362 = !DILocation(line: 473, column: 25, scope: !357, inlinedAt: !360)
!363 = !DILocation(line: 473, column: 31, scope: !357, inlinedAt: !360)
!364 = !DILocation(line: 474, column: 3, scope: !357, inlinedAt: !360)
!365 = !DILocation(line: 474, column: 2, scope: !357, inlinedAt: !360)
!366 = !DILocation(line: 475, column: 9, scope: !357, inlinedAt: !360)
!367 = !DILocation(line: 226, column: 14, scope: !361)
!368 = !DILocation(line: 226, column: 9, scope: !361)
!369 = !DILocation(line: 227, column: 14, scope: !361)
!370 = !DILocation(line: 227, column: 9, scope: !361)
!371 = !DILocation(line: 228, column: 14, scope: !361)
!372 = !DILocation(line: 228, column: 9, scope: !361)
!373 = !DILocation(line: 425, column: 10, scope: !374, inlinedAt: !375)
!374 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!375 = !DILocation(line: 230, column: 15, scope: !361)
!376 = !DILocation(line: 425, column: 20, scope: !374, inlinedAt: !375)
!377 = !DILocation(line: 425, column: 30, scope: !374, inlinedAt: !375)
!378 = !DILocation(line: 425, column: 40, scope: !374, inlinedAt: !375)
!379 = !DILocation(line: 230, column: 27, scope: !361)
!380 = !DILocation(line: 233, column: 16, scope: !381)
!381 = distinct !DILexicalBlock(scope: !348, file: !2, line: 231, column: 13)
!382 = !DILocation(line: 233, column: 25, scope: !381)
!383 = !DILocation(line: 233, column: 33, scope: !381)
!384 = !DILocation(line: 233, column: 41, scope: !381)
!385 = !DILocation(line: 233, column: 50, scope: !381)
!386 = !DILocation(line: 235, column: 8, scope: !381)
!387 = !DILocation(line: 235, column: 24, scope: !381)
!388 = !DILocation(line: 236, column: 8, scope: !381)
!389 = !DILocation(line: 236, column: 25, scope: !381)
!390 = !DILocation(line: 237, column: 8, scope: !381)
!391 = !DILocation(line: 237, column: 24, scope: !381)
!392 = !DILocalVariable(name: "chunk", scope: !393, file: !2, line: 473, type: !394, align: 8)
!393 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpLuma*", baseType: !395, size: 64, align: 64, dwarfAddressSpace: 0)
!395 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!396 = !DILocation(line: 473, column: 9, scope: !393, inlinedAt: !397)
!397 = !DILocation(line: 239, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !381, file: !2, line: 238, column: 9)
!399 = !DILocation(line: 473, column: 25, scope: !393, inlinedAt: !397)
!400 = !DILocation(line: 473, column: 31, scope: !393, inlinedAt: !397)
!401 = !DILocation(line: 474, column: 3, scope: !393, inlinedAt: !397)
!402 = !DILocation(line: 474, column: 2, scope: !393, inlinedAt: !397)
!403 = !DILocation(line: 475, column: 9, scope: !393, inlinedAt: !397)
!404 = !DILocation(line: 241, column: 15, scope: !398)
!405 = !DILocation(line: 241, column: 10, scope: !398)
!406 = !DILocation(line: 242, column: 15, scope: !398)
!407 = !DILocation(line: 242, column: 10, scope: !398)
!408 = !DILocation(line: 243, column: 15, scope: !398)
!409 = !DILocation(line: 243, column: 10, scope: !398)
!410 = !DILocation(line: 425, column: 10, scope: !411, inlinedAt: !412)
!411 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!412 = !DILocation(line: 245, column: 16, scope: !398)
!413 = !DILocation(line: 425, column: 20, scope: !411, inlinedAt: !412)
!414 = !DILocation(line: 425, column: 30, scope: !411, inlinedAt: !412)
!415 = !DILocation(line: 425, column: 40, scope: !411, inlinedAt: !412)
!416 = !DILocation(line: 245, column: 28, scope: !398)
!417 = !DILocation(line: 246, column: 16, scope: !418)
!418 = distinct !DILexicalBlock(scope: !381, file: !2, line: 246, column: 14)
!419 = !DILocation(line: 251, column: 10, scope: !420)
!420 = distinct !DILexicalBlock(scope: !320, file: !2, line: 251, column: 6)
!421 = !DILocation(line: 251, column: 20, scope: !420)
!422 = !DILocalVariable(name: "chunk", scope: !423, file: !2, line: 473, type: !424, align: 8)
!423 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGBA*", baseType: !425, size: 64, align: 64, dwarfAddressSpace: 0)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGBA", scope: !2, file: !2, line: 435, size: 40, align: 8, elements: !426, identifier: "std.compression.qoi.OpRGBA")
!426 = !{!427, !428, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !425, file: !2, line: 437, baseType: !6, size: 8, align: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !425, file: !2, line: 438, baseType: !6, size: 8, align: 8, offset: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !425, file: !2, line: 439, baseType: !6, size: 8, align: 8, offset: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !425, file: !2, line: 440, baseType: !6, size: 8, align: 8, offset: 24)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !425, file: !2, line: 441, baseType: !6, size: 8, align: 8, offset: 32)
!432 = !DILocation(line: 473, column: 9, scope: !423, inlinedAt: !433)
!433 = !DILocation(line: 252, column: 8, scope: !434)
!434 = distinct !DILexicalBlock(scope: !420, file: !2, line: 251, column: 25)
!435 = !DILocation(line: 473, column: 25, scope: !423, inlinedAt: !433)
!436 = !DILocation(line: 473, column: 31, scope: !423, inlinedAt: !433)
!437 = !DILocation(line: 474, column: 3, scope: !423, inlinedAt: !433)
!438 = !DILocation(line: 474, column: 2, scope: !423, inlinedAt: !433)
!439 = !DILocation(line: 475, column: 9, scope: !423, inlinedAt: !433)
!440 = !DILocation(line: 252, column: 43, scope: !434)
!441 = !DILocation(line: 252, column: 52, scope: !434)
!442 = !DILocation(line: 252, column: 57, scope: !434)
!443 = !DILocation(line: 252, column: 62, scope: !434)
!444 = !DILocation(line: 252, column: 67, scope: !434)
!445 = !DILocalVariable(name: "chunk", scope: !446, file: !2, line: 473, type: !447, align: 8)
!446 = distinct !DISubprogram(name: "@extract", linkageName: "@extract", scope: !2, file: !2, line: 470, scopeLine: 470, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OpRGB*", baseType: !448, size: 64, align: 64, dwarfAddressSpace: 0)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "OpRGB", scope: !2, file: !2, line: 428, size: 32, align: 8, elements: !449, identifier: "std.compression.qoi.OpRGB")
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !448, file: !2, line: 430, baseType: !6, size: 8, align: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !448, file: !2, line: 431, baseType: !6, size: 8, align: 8, offset: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !448, file: !2, line: 432, baseType: !6, size: 8, align: 8, offset: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !448, file: !2, line: 433, baseType: !6, size: 8, align: 8, offset: 24)
!454 = !DILocation(line: 473, column: 9, scope: !446, inlinedAt: !455)
!455 = !DILocation(line: 254, column: 8, scope: !456)
!456 = distinct !DILexicalBlock(scope: !420, file: !2, line: 253, column: 13)
!457 = !DILocation(line: 473, column: 25, scope: !446, inlinedAt: !455)
!458 = !DILocation(line: 473, column: 31, scope: !446, inlinedAt: !455)
!459 = !DILocation(line: 474, column: 3, scope: !446, inlinedAt: !455)
!460 = !DILocation(line: 474, column: 2, scope: !446, inlinedAt: !455)
!461 = !DILocation(line: 475, column: 9, scope: !446, inlinedAt: !455)
!462 = !DILocation(line: 254, column: 42, scope: !456)
!463 = !DILocation(line: 254, column: 50, scope: !456)
!464 = !DILocation(line: 254, column: 55, scope: !456)
!465 = !DILocation(line: 254, column: 60, scope: !456)
!466 = !DILocation(line: 425, column: 10, scope: !467, inlinedAt: !468)
!467 = distinct !DISubprogram(name: "hash", linkageName: "hash", scope: !2, file: !2, line: 424, scopeLine: 424, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!468 = !DILocation(line: 256, column: 14, scope: !420)
!469 = !DILocation(line: 425, column: 20, scope: !467, inlinedAt: !468)
!470 = !DILocation(line: 425, column: 30, scope: !467, inlinedAt: !468)
!471 = !DILocation(line: 425, column: 40, scope: !467, inlinedAt: !468)
!472 = !DILocation(line: 256, column: 26, scope: !420)
!473 = !DILocation(line: 184, column: 34, scope: !271)
!474 = !DILocation(line: 184, column: 41, scope: !271)
!475 = !DILocation(line: 262, column: 2, scope: !171)
!476 = !DILocation(line: 262, column: 9, scope: !171)
!477 = !DILocation(line: 263, column: 2, scope: !171)
!478 = !DILocation(line: 265, column: 9, scope: !171)
!479 = !DILocation(line: 265, column: 16, scope: !171)
!480 = !DILocation(line: 265, column: 17, scope: !171)
!481 = !DILocation(line: 163, column: 4, scope: !171)
!482 = distinct !DISubprogram(name: "decode", linkageName: "std.compression.qoi.decode", scope: !2, file: !2, line: 290, type: !483, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !61)
!483 = !DISubroutineType(types: !484)
!484 = !{!49, !150, !55, !60, !30, !75}
!485 = !DILocalVariable(name: "data", arg: 1, scope: !482, file: !2, line: 290, type: !55)
!486 = !DILocation(line: 290, column: 26, scope: !482)
!487 = !DILocalVariable(name: "desc", arg: 2, scope: !482, file: !2, line: 290, type: !60)
!488 = !DILocation(line: 290, column: 41, scope: !482)
!489 = !DILocalVariable(name: "channels", arg: 3, scope: !482, file: !2, line: 290, type: !30)
!490 = !DILocation(line: 290, column: 59, scope: !482)
!491 = !DILocalVariable(name: "allocator", arg: 4, scope: !482, file: !2, line: 290, type: !75)
!492 = !DILocation(line: 290, column: 86, scope: !482)
!493 = !DILocation(line: 293, column: 6, scope: !482)
!494 = !DILocation(line: 293, column: 59, scope: !482)
!495 = !DILocalVariable(name: "header", scope: !482, file: !2, line: 296, type: !496, align: 8)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Header*", baseType: !497, size: 64, align: 64, dwarfAddressSpace: 0)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Header", scope: !2, file: !2, line: 401, size: 112, align: 8, elements: !498, identifier: "std.compression.qoi.Header")
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "be_magic", scope: !497, file: !2, line: 403, baseType: !3, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "be_width", scope: !497, file: !2, line: 404, baseType: !3, size: 32, align: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "be_height", scope: !497, file: !2, line: 405, baseType: !3, size: 32, align: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !497, file: !2, line: 408, baseType: !6, size: 8, align: 8, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !497, file: !2, line: 409, baseType: !6, size: 8, align: 8, offset: 104)
!504 = !DILocation(line: 296, column: 10, scope: !482)
!505 = !DILocation(line: 296, column: 28, scope: !482)
!506 = !DILocation(line: 299, column: 12, scope: !482)
!507 = !DILocation(line: 11, column: 36, scope: !508, inlinedAt: !509)
!508 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!509 = !DILocation(line: 299, column: 6, scope: !482)
!510 = !DILocation(line: 299, column: 47, scope: !482)
!511 = !DILocation(line: 302, column: 2, scope: !482)
!512 = !DILocation(line: 302, column: 21, scope: !482)
!513 = !DILocation(line: 11, column: 36, scope: !514, inlinedAt: !515)
!514 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!515 = !DILocation(line: 302, column: 15, scope: !482)
!516 = !DILocation(line: 303, column: 2, scope: !482)
!517 = !DILocation(line: 303, column: 22, scope: !482)
!518 = !DILocation(line: 11, column: 36, scope: !519, inlinedAt: !520)
!519 = distinct !DISubprogram(name: "bswap", linkageName: "bswap", scope: !223, file: !223, line: 11, scopeLine: 11, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28)
!520 = !DILocation(line: 303, column: 16, scope: !482)
!521 = !DILocation(line: 304, column: 2, scope: !482)
!522 = !DILocation(line: 304, column: 41, scope: !482)
!523 = !DILocalVariable(name: ".temp", scope: !524, file: !2, line: 417, type: !526, align: 1)
!524 = distinct !DILexicalBlock(scope: !525, file: !2, line: 417, column: 2)
!525 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 24, align: 8, elements: !265)
!527 = !DILocation(line: 417, column: 19, scope: !524, inlinedAt: !528)
!528 = !DILocation(line: 304, column: 18, scope: !482)
!529 = !DILocalVariable(name: ".temp", scope: !524, file: !2, line: 417, type: !52, align: 8)
!530 = !DILocalVariable(name: "value", scope: !531, file: !2, line: 417, type: !30, align: 1)
!531 = distinct !DILexicalBlock(scope: !524, file: !2, line: 417, column: 33)
!532 = !DILocation(line: 417, column: 11, scope: !531, inlinedAt: !528)
!533 = !DILocation(line: 417, column: 19, scope: !531, inlinedAt: !528)
!534 = !DILocation(line: 418, column: 7, scope: !535, inlinedAt: !528)
!535 = distinct !DILexicalBlock(scope: !531, file: !2, line: 417, column: 33)
!536 = !DILocation(line: 418, column: 19, scope: !535, inlinedAt: !528)
!537 = !DILocation(line: 418, column: 31, scope: !535, inlinedAt: !528)
!538 = !DILocation(line: 420, column: 9, scope: !525, inlinedAt: !528)
!539 = !DILocation(line: 305, column: 2, scope: !482)
!540 = !DILocation(line: 305, column: 45, scope: !482)
!541 = !DILocalVariable(name: ".temp", scope: !542, file: !2, line: 417, type: !544, align: 1)
!542 = distinct !DILexicalBlock(scope: !543, file: !2, line: 417, column: 2)
!543 = distinct !DISubprogram(name: "@enumcast", linkageName: "@enumcast", scope: !2, file: !2, line: 415, scopeLine: 415, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !28, retainedNodes: !61)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16, align: 8, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 2, lowerBound: 0)
!547 = !DILocation(line: 417, column: 19, scope: !542, inlinedAt: !548)
!548 = !DILocation(line: 305, column: 20, scope: !482)
!549 = !DILocalVariable(name: ".temp", scope: !542, file: !2, line: 417, type: !52, align: 8)
!550 = !DILocalVariable(name: "value", scope: !551, file: !2, line: 417, type: !37, align: 1)
!551 = distinct !DILexicalBlock(scope: !542, file: !2, line: 417, column: 33)
