; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-apple-macosx15.0"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%File = type { ptr }
%"char[][]" = type { ptr, i64 }
%SubProcess = type { ptr, ptr, ptr, i32, i32, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char*[]" = type { ptr, i64 }
%Posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }

@"std.os.process.SubProcessResult$FAILED_TO_CREATE_PIPE" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.process.SubProcessResult" to i64), %"char[]" { ptr @.fault, i64 21 }, i64 1 }, align 8
@.fault = internal constant [22 x i8] c"FAILED_TO_CREATE_PIPE\00", align 1
@"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDIN" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.process.SubProcessResult" to i64), %"char[]" { ptr @.fault.1, i64 20 }, i64 2 }, align 8
@.fault.1 = internal constant [21 x i8] c"FAILED_TO_OPEN_STDIN\00", align 1
@"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDOUT" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.os.process.SubProcessResult" to i64), %"char[]" { ptr @.fault.2, i64 21 }, i64 3 }, align 8
@.fault.2 = internal constant [22 x i8] c"FAILED_TO_OPEN_STDOUT\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_ENVIRONMENT", linkageName: "std.os.process.EMPTY_ENVIRONMENT", scope: !2, file: !2, line: 258, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "/opt/homebrew/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !7)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !5, align: 8)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !{!8}
!8 = !DISubrange(count: 1, lowerBound: 0)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 2, !"wchar_size", i32 4}
!12 = !{i32 4, !"PIC Level", i32 2}
!13 = !{i32 1, !"uwtable", i32 1}
!14 = !{i32 2, !"frame-pointer", i32 1}
!15 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !16, splitDebugInlining: false)
!16 = !{!0}
!17 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 356, type: !18, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !25}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !21, identifier: "std.io.File")
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !20, file: !2, line: 6, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 356, baseType: !24, align: 8)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 19, size: 320, align: 64, elements: !27, identifier: "std.os.process.SubProcess")
!27 = !{!28, !29, !30, !31, !34, !35}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !26, file: !2, line: 21, baseType: !23, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !26, file: !2, line: 22, baseType: !23, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !26, file: !2, line: 23, baseType: !23, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !26, file: !2, line: 30, baseType: !32, size: 32, align: 32, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pid_t", scope: !2, file: !2, line: 16, baseType: !33, align: 4)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !26, file: !2, line: 31, baseType: !33, size: 32, align: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !26, file: !2, line: 33, baseType: !36, size: 8, align: 8, offset: 256)
!36 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!37 = !{}
!38 = !DILocation(line: 357, column: 1, scope: !17)
!39 = !DILocalVariable(name: "self", arg: 1, scope: !17, file: !2, line: 356, type: !25)
!40 = !DILocation(line: 356, column: 27, scope: !17)
!41 = !DILocation(line: 358, column: 27, scope: !17)
!42 = !DILocation(line: 358, column: 9, scope: !17)
!43 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 380, type: !44, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!44 = !DISubroutineType(types: !45)
!45 = !{!36, !25}
!46 = !DILocation(line: 381, column: 1, scope: !43)
!47 = !DILocalVariable(name: "self", arg: 1, scope: !43, file: !2, line: 380, type: !25)
!48 = !DILocation(line: 380, column: 28, scope: !43)
!49 = !DILocation(line: 382, column: 6, scope: !43)
!50 = !DILocation(line: 382, column: 36, scope: !43)
!51 = !DILocation(line: 382, column: 23, scope: !43)
!52 = !DILocation(line: 383, column: 6, scope: !43)
!53 = !DILocation(line: 385, column: 16, scope: !54)
!54 = distinct !DILexicalBlock(scope: !43, file: !2, line: 384, column: 2)
!55 = !DILocation(line: 385, column: 3, scope: !54)
!56 = !DILocation(line: 386, column: 7, scope: !54)
!57 = !DILocation(line: 386, column: 27, scope: !54)
!58 = !DILocation(line: 386, column: 58, scope: !54)
!59 = !DILocation(line: 386, column: 45, scope: !54)
!60 = !DILocation(line: 388, column: 2, scope: !43)
!61 = !DILocation(line: 388, column: 20, scope: !43)
!62 = !DILocation(line: 388, column: 39, scope: !43)
!63 = !DILocation(line: 388, column: 58, scope: !43)
!64 = !DILocation(line: 396, column: 9, scope: !43)
!65 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 399, type: !66, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !24, !25}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !69)
!69 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!70 = !DILocation(line: 400, column: 1, scope: !65)
!71 = !DILocalVariable(name: "self", arg: 1, scope: !65, file: !2, line: 399, type: !25)
!72 = !DILocation(line: 399, column: 31, scope: !65)
!73 = !DILocation(line: 404, column: 19, scope: !65)
!74 = !DILocation(line: 404, column: 31, scope: !65)
!75 = !DILocation(line: 404, column: 7, scope: !65)
!76 = !DILocation(line: 404, column: 42, scope: !65)
!77 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 444, type: !78, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!78 = !DISubroutineType(types: !79)
!79 = !{!68, !80, !25, !5, !82}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !81, size: 64, align: 64, dwarfAddressSpace: 0)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !82)
!82 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!83 = !DILocation(line: 445, column: 1, scope: !77)
!84 = !DILocalVariable(name: "self", arg: 1, scope: !77, file: !2, line: 444, type: !25)
!85 = !DILocation(line: 444, column: 32, scope: !77)
!86 = !DILocalVariable(name: "buffer", arg: 2, scope: !77, file: !2, line: 444, type: !5)
!87 = !DILocation(line: 444, column: 45, scope: !77)
!88 = !DILocalVariable(name: "size", arg: 3, scope: !77, file: !2, line: 444, type: !81)
!89 = !DILocation(line: 444, column: 57, scope: !77)
!90 = !DILocation(line: 449, column: 31, scope: !77)
!91 = !DILocation(line: 449, column: 10, scope: !77)
!92 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 453, type: !78, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!93 = !DILocation(line: 454, column: 1, scope: !92)
!94 = !DILocalVariable(name: "self", arg: 1, scope: !92, file: !2, line: 453, type: !25)
!95 = !DILocation(line: 453, column: 32, scope: !92)
!96 = !DILocalVariable(name: "buffer", arg: 2, scope: !92, file: !2, line: 453, type: !5)
!97 = !DILocation(line: 453, column: 45, scope: !92)
!98 = !DILocalVariable(name: "size", arg: 3, scope: !92, file: !2, line: 453, type: !81)
!99 = !DILocation(line: 453, column: 57, scope: !92)
!100 = !DILocation(line: 458, column: 31, scope: !92)
!101 = !DILocation(line: 458, column: 10, scope: !92)
!102 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 462, type: !103, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!103 = !DISubroutineType(types: !104)
!104 = !{!68, !105, !25}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!106 = !DILocation(line: 463, column: 1, scope: !102)
!107 = !DILocalVariable(name: "self", arg: 1, scope: !102, file: !2, line: 462, type: !25)
!108 = !DILocation(line: 462, column: 32, scope: !102)
!109 = !DILocation(line: 464, column: 7, scope: !102)
!110 = !DILocation(line: 464, column: 29, scope: !102)
!111 = !DILocalVariable(name: "status", scope: !102, file: !2, line: 470, type: !112, align: 4)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !33, align: 4)
!113 = !DILocation(line: 470, column: 8, scope: !102)
!114 = !DILocalVariable(name: "is_alive", scope: !102, file: !2, line: 471, type: !36, align: 1)
!115 = !DILocation(line: 471, column: 8, scope: !102)
!116 = !DILocation(line: 471, column: 34, scope: !102)
!117 = !DILocation(line: 471, column: 55, scope: !102)
!118 = !DILocation(line: 471, column: 19, scope: !102)
!119 = !DILocation(line: 472, column: 7, scope: !102)
!120 = !DILocation(line: 472, column: 24, scope: !102)
!121 = !DILocation(line: 473, column: 3, scope: !102)
!122 = !DILocation(line: 473, column: 19, scope: !102)
!123 = !DILocation(line: 474, column: 3, scope: !102)
!124 = !DILocation(line: 44, column: 37, scope: !125, inlinedAt: !127)
!125 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !126, file: !126, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!126 = !DIFile(filename: "process.c3", directory: "/opt/homebrew/lib/c3/std/os/posix")
!127 = !DILocation(line: 46, column: 38, scope: !128, inlinedAt: !129)
!128 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !126, file: !126, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!129 = !DILocation(line: 474, column: 24, scope: !102)
!130 = !DILocation(line: 43, column: 41, scope: !131, inlinedAt: !132)
!131 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !126, file: !126, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!132 = !DILocation(line: 474, column: 51, scope: !102)
!133 = !DILocation(line: 474, column: 80, scope: !102)
!134 = !DILocation(line: 475, column: 3, scope: !102)
!135 = !DILocation(line: 475, column: 16, scope: !102)
!136 = !DILocation(line: 476, column: 3, scope: !102)
!137 = !DILocation(line: 477, column: 10, scope: !102)
!138 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 340, type: !139, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!139 = !DISubroutineType(types: !140)
!140 = !{!68, !141, !25}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !112, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !DILocation(line: 341, column: 1, scope: !138)
!143 = !DILocalVariable(name: "self", arg: 1, scope: !138, file: !2, line: 340, type: !25)
!144 = !DILocation(line: 340, column: 26, scope: !138)
!145 = !DILocation(line: 342, column: 6, scope: !138)
!146 = !DILocation(line: 344, column: 16, scope: !147)
!147 = distinct !DILexicalBlock(scope: !138, file: !2, line: 343, column: 2)
!148 = !DILocation(line: 344, column: 3, scope: !147)
!149 = !DILocation(line: 345, column: 3, scope: !147)
!150 = !DILocation(line: 345, column: 21, scope: !147)
!151 = !DILocalVariable(name: "status", scope: !138, file: !2, line: 347, type: !112, align: 4)
!152 = !DILocation(line: 347, column: 7, scope: !138)
!153 = !DILocation(line: 348, column: 6, scope: !138)
!154 = !DILocation(line: 348, column: 20, scope: !138)
!155 = !DILocation(line: 348, column: 49, scope: !138)
!156 = !DILocation(line: 348, column: 70, scope: !138)
!157 = !DILocation(line: 348, column: 34, scope: !138)
!158 = !DILocation(line: 348, column: 81, scope: !138)
!159 = !DILocation(line: 350, column: 2, scope: !138)
!160 = !DILocation(line: 350, column: 15, scope: !138)
!161 = !DILocation(line: 351, column: 2, scope: !138)
!162 = !DILocation(line: 351, column: 18, scope: !138)
!163 = !DILocation(line: 353, column: 9, scope: !138)
!164 = !DILocation(line: 44, column: 37, scope: !165, inlinedAt: !166)
!165 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !126, file: !126, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!166 = !DILocation(line: 46, column: 38, scope: !167, inlinedAt: !168)
!167 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !126, file: !126, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!168 = !DILocation(line: 353, column: 30, scope: !138)
!169 = !DILocation(line: 43, column: 41, scope: !170, inlinedAt: !171)
!170 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !126, file: !126, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!171 = !DILocation(line: 353, column: 57, scope: !138)
!172 = !DILocation(line: 353, column: 86, scope: !138)
!173 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 271, type: !174, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!174 = !DISubroutineType(types: !175)
!175 = !{!68, !176, !178, !182, !33, !182}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !179, identifier: "char[]")
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !178, baseType: !5, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !178, baseType: !81, size: 64, align: 64, offset: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !183, identifier: "String[]")
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !182, baseType: !176, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, baseType: !81, size: 64, align: 64, offset: 64)
!186 = !DILocalVariable(name: "buffer", arg: 1, scope: !173, file: !2, line: 271, type: !178)
!187 = !DILocation(line: 271, column: 44, scope: !173)
!188 = !DILocalVariable(name: "command_line", arg: 2, scope: !173, file: !2, line: 271, type: !182)
!189 = !DILocation(line: 271, column: 61, scope: !173)
!190 = !DILocalVariable(name: "options", arg: 3, scope: !173, file: !2, line: 271, type: !33)
!191 = !DILocation(line: 271, column: 93, scope: !173)
!192 = !DILocalVariable(name: "environment", arg: 4, scope: !173, file: !2, line: 271, type: !182)
!193 = !DILocation(line: 271, column: 116, scope: !173)
!194 = !DILocalVariable(name: "process", scope: !173, file: !2, line: 273, type: !26, align: 8)
!195 = !DILocation(line: 273, column: 13, scope: !173)
!196 = !DILocation(line: 273, column: 23, scope: !173)
!197 = !DILocation(line: 274, column: 2, scope: !173)
!198 = !DILocalVariable(name: "len", scope: !173, file: !2, line: 275, type: !81, align: 8)
!199 = !DILocation(line: 275, column: 6, scope: !173)
!200 = !DILocation(line: 275, column: 44, scope: !173)
!201 = !DILocation(line: 275, column: 12, scope: !173)
!202 = !DILocation(line: 276, column: 17, scope: !173)
!203 = !DILocation(line: 276, column: 24, scope: !173)
!204 = !DILocation(line: 276, column: 25, scope: !173)
!205 = !DILocation(line: 276, column: 10, scope: !173)
!206 = distinct !DISubprogram(name: "tcopy_command_line", linkageName: "std.os.process.tcopy_command_line", scope: !2, file: !2, line: 247, type: !207, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15, retainedNodes: !37)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !182}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ZString*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!210 = !DILocalVariable(name: "command_line", arg: 1, scope: !206, file: !2, line: 247, type: !182)
!211 = !DILocation(line: 247, column: 41, scope: !206)
!212 = !DILocation(line: 245, column: 11, scope: !213)
!213 = distinct !DILexicalBlock(scope: !206, file: !2, line: 248, column: 1)
!214 = !DILocalVariable(name: "copy", scope: !206, file: !2, line: 249, type: !209, align: 8)
!215 = !DILocation(line: 249, column: 11, scope: !206)
!216 = !DILocation(line: 249, column: 49, scope: !206)
!217 = !DILocation(line: 777, column: 41, scope: !218, inlinedAt: !220)
!218 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !219, file: !219, line: 775, scopeLine: 775, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!219 = !DIFile(filename: "mem.c3", directory: "/opt/homebrew/lib/c3/std/core")
!220 = !DILocation(line: 249, column: 18, scope: !206)
!221 = !DILocation(line: 777, column: 26, scope: !218, inlinedAt: !220)
!222 = !DILocation(line: 777, column: 18, scope: !218, inlinedAt: !220)
!223 = !DILocation(line: 777, column: 68, scope: !218, inlinedAt: !220)
!224 = !DILocation(line: 250, column: 20, scope: !225)
!225 = distinct !DILexicalBlock(scope: !206, file: !2, line: 250, column: 2)
!226 = !DILocalVariable(name: ".temp", scope: !225, file: !2, line: 250, type: !81, align: 8)
!227 = !DILocation(line: 250, column: 11, scope: !225)
!228 = !DILocalVariable(name: "i", scope: !229, file: !2, line: 250, type: !81, align: 8)
!229 = distinct !DILexicalBlock(scope: !225, file: !2, line: 251, column: 2)
!230 = !DILocation(line: 250, column: 11, scope: !229)
!231 = !DILocalVariable(name: "str", scope: !229, file: !2, line: 250, type: !177, align: 8)
!232 = !DILocation(line: 250, column: 14, scope: !229)
!233 = !DILocation(line: 250, column: 20, scope: !229)
!234 = !DILocation(line: 252, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !229, file: !2, line: 251, column: 2)
!236 = !DILocation(line: 252, column: 8, scope: !235)
!237 = !DILocation(line: 252, column: 13, scope: !235)
!238 = !DILocation(line: 254, column: 2, scope: !206)
!239 = !DILocation(line: 254, column: 7, scope: !206)
!240 = !DILocation(line: 254, column: 27, scope: !206)
!241 = !DILocation(line: 255, column: 9, scope: !206)
!242 = distinct !DISubprogram(name: "tcopy_env", linkageName: "std.os.process.tcopy_env", scope: !2, file: !2, line: 259, type: !207, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15, retainedNodes: !37)
!243 = !DILocalVariable(name: "environment", arg: 1, scope: !242, file: !2, line: 259, type: !182)
!244 = !DILocation(line: 259, column: 32, scope: !242)
!245 = !DILocation(line: 261, column: 6, scope: !242)
!246 = !DILocation(line: 261, column: 31, scope: !242)
!247 = !DILocalVariable(name: "copy", scope: !242, file: !2, line: 262, type: !209, align: 8)
!248 = !DILocation(line: 262, column: 11, scope: !242)
!249 = !DILocation(line: 262, column: 49, scope: !242)
!250 = !DILocation(line: 777, column: 41, scope: !251, inlinedAt: !252)
!251 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !219, file: !219, line: 775, scopeLine: 775, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!252 = !DILocation(line: 262, column: 18, scope: !242)
!253 = !DILocation(line: 777, column: 26, scope: !251, inlinedAt: !252)
!254 = !DILocation(line: 777, column: 18, scope: !251, inlinedAt: !252)
!255 = !DILocation(line: 777, column: 68, scope: !251, inlinedAt: !252)
!256 = !DILocation(line: 263, column: 2, scope: !242)
!257 = !DILocation(line: 263, column: 7, scope: !242)
!258 = !DILocation(line: 263, column: 26, scope: !242)
!259 = !DILocation(line: 264, column: 20, scope: !260)
!260 = distinct !DILexicalBlock(scope: !242, file: !2, line: 264, column: 2)
!261 = !DILocalVariable(name: ".temp", scope: !260, file: !2, line: 264, type: !81, align: 8)
!262 = !DILocation(line: 264, column: 11, scope: !260)
!263 = !DILocalVariable(name: "i", scope: !264, file: !2, line: 264, type: !81, align: 8)
!264 = distinct !DILexicalBlock(scope: !260, file: !2, line: 265, column: 2)
!265 = !DILocation(line: 264, column: 11, scope: !264)
!266 = !DILocalVariable(name: "str", scope: !264, file: !2, line: 264, type: !177, align: 8)
!267 = !DILocation(line: 264, column: 14, scope: !264)
!268 = !DILocation(line: 264, column: 20, scope: !264)
!269 = !DILocation(line: 266, column: 3, scope: !270)
!270 = distinct !DILexicalBlock(scope: !264, file: !2, line: 265, column: 2)
!271 = !DILocation(line: 266, column: 8, scope: !270)
!272 = !DILocation(line: 266, column: 13, scope: !270)
!273 = !DILocation(line: 268, column: 9, scope: !242)
!274 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 282, type: !275, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !15, retainedNodes: !37)
!275 = !DISubroutineType(types: !276)
!276 = !{!68, !25, !182, !33, !182}
!277 = !DILocalVariable(name: "command_line", arg: 1, scope: !274, file: !2, line: 282, type: !182)
!278 = !DILocation(line: 282, column: 32, scope: !274)
!279 = !DILocalVariable(name: "options", arg: 2, scope: !274, file: !2, line: 282, type: !33)
!280 = !DILocation(line: 282, column: 64, scope: !274)
!281 = !DILocalVariable(name: "environment", arg: 3, scope: !274, file: !2, line: 282, type: !182)
!282 = !DILocation(line: 282, column: 87, scope: !274)
!283 = !DILocation(line: 280, column: 12, scope: !284)
!284 = distinct !DILexicalBlock(scope: !274, file: !2, line: 283, column: 1)
!285 = !DILocation(line: 280, column: 28, scope: !284)
!286 = !DILocation(line: 280, column: 11, scope: !284)
!287 = !DILocalVariable(name: "stdinfd", scope: !274, file: !2, line: 284, type: !288, align: 4)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, align: 32, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 2, lowerBound: 0)
!291 = !DILocation(line: 284, column: 10, scope: !274)
!292 = !DILocalVariable(name: "stdoutfd", scope: !274, file: !2, line: 285, type: !288, align: 4)
!293 = !DILocation(line: 285, column: 10, scope: !274)
!294 = !DILocalVariable(name: "stderrfd", scope: !274, file: !2, line: 286, type: !288, align: 4)
!295 = !DILocation(line: 286, column: 10, scope: !274)
!296 = !DILocation(line: 288, column: 6, scope: !274)
!297 = !DILocation(line: 288, column: 36, scope: !274)
!298 = !DILocation(line: 289, column: 6, scope: !274)
!299 = !DILocation(line: 289, column: 37, scope: !274)
!300 = !DILocation(line: 290, column: 7, scope: !274)
!301 = !DILocation(line: 290, column: 41, scope: !274)
!302 = !DILocation(line: 290, column: 72, scope: !274)
!303 = !DILocalVariable(name: "actions", scope: !274, file: !2, line: 292, type: !304, align: 8)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_spawn_file_actions_t", scope: !2, file: !2, line: 4, size: 640, align: 64, elements: !305, identifier: "std.os.posix.Posix_spawn_file_actions_t")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__allocated", scope: !304, file: !2, line: 6, baseType: !33, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__used", scope: !304, file: !2, line: 7, baseType: !33, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__actions", scope: !304, file: !2, line: 8, baseType: !24, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !304, file: !2, line: 9, baseType: !310, size: 512, align: 32, offset: 128)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, align: 32, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 16, lowerBound: 0)
!313 = !DILocation(line: 292, column: 29, scope: !274)
!314 = !DILocation(line: 293, column: 6, scope: !274)
!315 = !DILocation(line: 293, column: 55, scope: !274)
!316 = !DILocation(line: 295, column: 59, scope: !274)
!317 = !DILocation(line: 295, column: 6, scope: !274)
!318 = !DILocation(line: 294, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!320 = !DILocation(line: 296, column: 62, scope: !274)
!321 = !DILocation(line: 296, column: 6, scope: !274)
!322 = !DILocation(line: 294, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!324 = !DILocation(line: 297, column: 60, scope: !274)
!325 = !DILocation(line: 297, column: 6, scope: !274)
!326 = !DILocation(line: 294, column: 8, scope: !327)
!327 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!328 = !DILocation(line: 298, column: 59, scope: !274)
!329 = !DILocation(line: 298, column: 63, scope: !274)
!330 = !DILocation(line: 298, column: 6, scope: !274)
!331 = !DILocation(line: 294, column: 8, scope: !332)
!332 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!333 = !DILocation(line: 299, column: 6, scope: !274)
!334 = !DILocation(line: 301, column: 7, scope: !335)
!335 = distinct !DILexicalBlock(scope: !274, file: !2, line: 300, column: 2)
!336 = !DILocation(line: 294, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!338 = !DILocation(line: 305, column: 61, scope: !339)
!339 = distinct !DILexicalBlock(scope: !274, file: !2, line: 304, column: 2)
!340 = !DILocation(line: 305, column: 7, scope: !339)
!341 = !DILocation(line: 294, column: 8, scope: !342)
!342 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!343 = !DILocation(line: 306, column: 60, scope: !339)
!344 = !DILocation(line: 306, column: 64, scope: !339)
!345 = !DILocation(line: 306, column: 7, scope: !339)
!346 = !DILocation(line: 294, column: 8, scope: !347)
!347 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!348 = !DILocalVariable(name: "child", scope: !274, file: !2, line: 308, type: !32, align: 4)
!349 = !DILocation(line: 308, column: 8, scope: !274)
!350 = !DILocalVariable(name: "current", scope: !351, file: !2, line: 592, type: !352, align: 8)
!351 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !219, file: !219, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15, retainedNodes: !37)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !353, size: 64, align: 64, dwarfAddressSpace: 0)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !354, identifier: "std.core.mem.allocator.TempAllocator")
!354 = !{!355, !361, !374, !375, !376}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !353, file: !2, line: 12, baseType: !356, size: 128, align: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !357, identifier: "Allocator")
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !356, baseType: !24, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, baseType: !360, size: 64, align: 64, offset: 64)
!360 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !353, file: !2, line: 13, baseType: !362, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !363, size: 64, align: 64, dwarfAddressSpace: 0)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !364, identifier: "std.core.mem.allocator.TempAllocatorPage")
!364 = !{!365, !366, !367, !368, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !363, file: !2, line: 24, baseType: !362, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !363, file: !2, line: 25, baseType: !24, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !363, file: !2, line: 26, baseType: !81, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !363, file: !2, line: 27, baseType: !81, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !363, file: !2, line: 28, baseType: !81, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !363, file: !2, line: 29, baseType: !371, align: 8, offset: 320)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 0, lowerBound: 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !353, file: !2, line: 14, baseType: !81, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !353, file: !2, line: 15, baseType: !81, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !353, file: !2, line: 16, baseType: !371, align: 8, offset: 320)
!377 = !DILocation(line: 592, column: 17, scope: !351, inlinedAt: !378)
!378 = !DILocation(line: 309, column: 2, scope: !274)
!379 = !DILocation(line: 396, column: 6, scope: !380, inlinedAt: !382)
!380 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !381, file: !381, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !15)
!381 = !DIFile(filename: "mem_allocator.c3", directory: "/opt/homebrew/lib/c3/std/core")
!382 = !DILocation(line: 592, column: 27, scope: !351, inlinedAt: !378)
!383 = !DILocation(line: 398, column: 3, scope: !384, inlinedAt: !382)
!384 = distinct !DILexicalBlock(scope: !380, file: !381, line: 397, column: 2)
!385 = !DILocation(line: 400, column: 9, scope: !380, inlinedAt: !382)
!386 = !DILocalVariable(name: "mark", scope: !351, file: !2, line: 597, type: !81, align: 8)
!387 = !DILocation(line: 597, column: 6, scope: !351, inlinedAt: !378)
!388 = !DILocation(line: 597, column: 13, scope: !351, inlinedAt: !378)
!389 = !DILocalVariable(name: "command_line_copy", scope: !390, file: !2, line: 311, type: !209, align: 8)
!390 = distinct !DILexicalBlock(scope: !274, file: !2, line: 310, column: 2)
!391 = !DILocation(line: 311, column: 12, scope: !390)
!392 = !DILocation(line: 311, column: 51, scope: !390)
!393 = !DILocation(line: 311, column: 32, scope: !390)
!394 = !DILocalVariable(name: "used_environment", scope: !390, file: !2, line: 312, type: !209, align: 8)
!395 = !DILocation(line: 312, column: 12, scope: !390)
!396 = !DILocation(line: 312, column: 31, scope: !390)
!397 = !DILocation(line: 312, column: 61, scope: !390)
!398 = !DILocation(line: 312, column: 88, scope: !390)
!399 = !DILocation(line: 312, column: 78, scope: !390)
!400 = !DILocation(line: 313, column: 7, scope: !390)
!401 = !DILocation(line: 315, column: 30, scope: !402)
!402 = distinct !DILexicalBlock(scope: !390, file: !2, line: 314, column: 3)
!403 = !DILocation(line: 315, column: 87, scope: !402)
!404 = !DILocation(line: 315, column: 8, scope: !402)
!405 = !DILocation(line: 600, column: 17, scope: !406, inlinedAt: !378)
!406 = distinct !DILexicalBlock(scope: !351, file: !219, line: 599, column: 2)
!407 = !DILocation(line: 600, column: 3, scope: !406, inlinedAt: !378)
!408 = !DILocation(line: 294, column: 8, scope: !409)
!409 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!410 = !DILocation(line: 319, column: 30, scope: !411)
!411 = distinct !DILexicalBlock(scope: !390, file: !2, line: 318, column: 3)
!412 = !DILocation(line: 319, column: 87, scope: !411)
!413 = !DILocation(line: 319, column: 8, scope: !411)
!414 = !DILocation(line: 600, column: 17, scope: !415, inlinedAt: !378)
!415 = distinct !DILexicalBlock(scope: !351, file: !219, line: 599, column: 2)
!416 = !DILocation(line: 600, column: 3, scope: !415, inlinedAt: !378)
!417 = !DILocation(line: 294, column: 8, scope: !418)
!418 = distinct !DILexicalBlock(scope: !274, file: !2, line: 294, column: 8)
!419 = !DILocation(line: 600, column: 17, scope: !420, inlinedAt: !378)
!420 = distinct !DILexicalBlock(scope: !351, file: !219, line: 599, column: 2)
!421 = !DILocation(line: 600, column: 3, scope: !420, inlinedAt: !378)
!422 = !DILocation(line: 322, column: 22, scope: !274)
!423 = !DILocation(line: 322, column: 2, scope: !274)
!424 = !DILocalVariable(name: "stdin", scope: !274, file: !2, line: 323, type: !23, align: 8)
!425 = !DILocation(line: 323, column: 8, scope: !274)
!426 = !DILocation(line: 323, column: 37, scope: !274)
!427 = !DILocation(line: 323, column: 41, scope: !274)
!428 = !DILocation(line: 323, column: 16, scope: !274)
!429 = !DILocation(line: 324, column: 23, scope: !274)
!430 = !DILocation(line: 324, column: 2, scope: !274)
!431 = !DILocalVariable(name: "stdout", scope: !274, file: !2, line: 325, type: !23, align: 8)
!432 = !DILocation(line: 325, column: 8, scope: !274)
